contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/**
 * Copyright (c) 2014, Analog Devices, Inc.  All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted (subject to the limitations in the
 * disclaimer below) provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * - Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in the
 *   documentation and/or other materials provided with the
 *   distribution.
 *
 * - Neither the name of Analog Devices, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE
 * GRANTED BY THIS LICENSE.  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT
 * HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
 * BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
 * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
 * IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/****************************************************************************************************//**
 * @file     ADUCRF101.h
 *
 * @brief    CMSIS Cortex-M3 Core Peripheral Access Layer Header File for
 *           default ADUCRF101 Device Series
 *
 * @version  V1.0
 * @date     Thursday January 10 2013 15:30
 *
 *******************************************************************************************************/



/** @addtogroup ADUCRF101
  * @{
  */

#ifndef __ADUCRF101_H__
#define __ADUCRF101_H__

#ifndef __NO_MMR_STRUCTS__
// The new style CMSIS structure definitions for MMRs clash with
// the old style defs. If the old style are required for compilation
// then set __NO_MMR_STRUCTS__ to 0x1
#define __NO_MMR_STRUCTS__ 0x0
#endif

#ifdef __cplusplus
extern "C" {
#endif


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -------------------  Cortex-M3 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                        = -15,  /*!<   1  Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn               = -14,  /*!<   2  Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn                    = -13,  /*!<   3  Hard Fault, all classes of Fault */
  MemoryManagement_IRQn             = -12,  /*!<   4  Memory Management, MPU mismatch, including Access Violation and No Match */
  BusFault_IRQn                     = -11,  /*!<   5  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn                   = -10,  /*!<   6  Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SVCall_IRQn                       = -5,   /*!<  11  System Service Call via SVC instruction */
  DebugMonitor_IRQn                 = -4,   /*!<  12  Debug Monitor                    */
  PendSV_IRQn                       = -2,   /*!<  14  Pendable request for system service */
  SysTick_IRQn                      = -1,   /*!<  15  System Tick Timer                */
// --------------------------  ADUCRF101 Specific Interrupt Numbers  ------------------------------
  WUT_IRQn                          = 0,    /*!<   0  WUT                              */
  EINT0_IRQn                        = 1,    /*!<   1  EINT0                            */
  EINT1_IRQn                        = 2,    /*!<   2  EINT1                            */
  EINT2_IRQn                        = 3,    /*!<   3  EINT2                            */
  EINT3_IRQn                        = 4,    /*!<   4  EINT3                            */
  EINT4_IRQn                        = 5,    /*!<   5  EINT4                            */
  EINT5_IRQn                        = 6,    /*!<   6  EINT5                            */
  EINT6_IRQn                        = 7,    /*!<   7  EINT6                            */
  EINT7_IRQn                        = 8,    /*!<   8  EINT7                            */
  EINT8_IRQn                        = 9,    /*!<   9  EINT8                            */
  UHFTRX_IRQn                       = 9,    /*!<   9  UHFTRX                           */
  WDT_IRQn                          = 10,   /*!<  10  WDT                              */
  TIMER0_IRQn                       = 12,   /*!<  12  TIMER0                           */
  TIMER1_IRQn                       = 13,   /*!<  13  TIMER1                           */
  ADC0_IRQn                         = 14,   /*!<  14  ADC0                             */
  FLASH_IRQn                        = 15,   /*!<  15  FLASH                            */
  UART_IRQn                         = 16,   /*!<  16  UART                             */
  SPI0_IRQn                         = 17,   /*!<  17  SPI0                             */
  SPI1_IRQn                         = 18,   /*!<  18  SPI1                             */
  I2CS_IRQn                         = 19,   /*!<  19  I2CS                             */
  I2CM_IRQn                         = 20,   /*!<  20  I2CM                             */
  DMA_ERR_IRQn                      = 23,   /*!<  23  DMA_ERR                          */
  DMA_SPI1_TX_IRQn                  = 24,   /*!<  24  DMA_SPI1_TX                      */
  DMA_SPI1_RX_IRQn                  = 25,   /*!<  25  DMA_SPI1_RX                      */
  DMA_UART_TX_IRQn                  = 26,   /*!<  26  DMA_UART_TX                      */
  DMA_UART_RX_IRQn                  = 27,   /*!<  27  DMA_UART_RX                      */
  DMA_I2CS_TX_IRQn                  = 28,   /*!<  28  DMA_I2CS_TX                      */
  DMA_I2CS_RX_IRQn                  = 29,   /*!<  29  DMA_I2CS_RX                      */
  DMA_I2CM_TX_IRQn                  = 30,   /*!<  30  DMA_I2CM_TX                      */
  DMA_I2CM_RX_IRQn                  = 31,   /*!<  31  DMA_I2CM_RX                      */
  DMA_ADC0_IRQn                     = 35,   /*!<  35  DMA_ADC0                         */
  DMA_SPI0_TX_IRQn                  = 36,   /*!<  36  DMA_SPI0_TX                      */
  DMA_SPI0_RX_IRQn                  = 37,   /*!<  37  DMA_SPI0_RX                      */
  PWM_TRIP_IRQn                     = 38,   /*!<  38  PWM_TRIP                         */
  PWM_PAIR0_IRQn                    = 39,   /*!<  39  PWM_PAIR0                        */
  PWM_PAIR1_IRQn                    = 40,   /*!<  40  PWM_PAIR1                        */
  PWM_PAIR2_IRQn                    = 41,   /*!<  41  PWM_PAIR2                        */
  PWM_PAIR3_IRQn                    = 42    /*!<  42  PWM_PAIR3                        */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the cm3 Processor and Core Peripherals---------------- */

#define __CM3_REV              0x0200       /*!< Cortex-M3 Core Revision          */
#define __MPU_PRESENT             0         /*!< MPU present or not                    */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used */
/** @} */ /* End of group Configuration_of_CMSIS */

#include <core_cm3.h>                       /*!< Cortex-M3 processor and core peripherals */
#include "system_ADuCRF101.h"               /*!< ADUCRF101 System                      */


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif




/* TCON[EVENTEN] - Enable event bit. */
#define TCON_EVENTEN_MSK               (0x1   << 12 )
#define TCON_EVENTEN                   (0x1   << 12 )
#define TCON_EVENTEN_DIS               (0x0   << 12 ) /* DIS. Cleared by user.    */
#define TCON_EVENTEN_EN                (0x1   << 12 ) /* EN. Enable time capture of an event. */

/* TCON[EVENT] - Event select bits. Settings not described are reserved and should not be used. */
#define TCON_EVENT_MSK                 (0xF   << 8  )

/* TCON[RLD] - Reload control bit for periodic mode. */
#define TCON_RLD_MSK                   (0x1   << 7  )
#define TCON_RLD                       (0x1   << 7  )
#define TCON_RLD_DIS                   (0x0   << 7  ) /* DIS. Reload on a time out. */
#define TCON_RLD_EN                    (0x1   << 7  ) /* EN. Reload the counter on a write to T0CLRI. */

