contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* TCON[CLK] - Clock select. */
#define TCON_CLK_MSK                   (0x3   << 5  )
#define TCON_CLK_UCLK                  (0x0   << 5  ) /* UCLK. Undivided system clock. */
#define TCON_CLK_PCLK                  (0x1   << 5  ) /* PCLK. Peripheral clock.  */
#define TCON_CLK_LFOSC                 (0x2   << 5  ) /* LFOSC. 32 kHz internal oscillator. */
#define TCON_CLK_LFXTAL                (0x3   << 5  ) /* LFXTAL. 32 kHz external crystal. */

/* TCON[ENABLE] - Timer enable bit. */
#define TCON_ENABLE_MSK                (0x1   << 4  )
#define TCON_ENABLE                    (0x1   << 4  )
#define TCON_ENABLE_DIS                (0x0   << 4  ) /* DIS. Disable the timer. Clearing this bit resets the timer, including the T0VAL register. */
#define TCON_ENABLE_EN                 (0x1   << 4  ) /* EN. Enable the timer.  The timer starts counting from its initial value, 0 if count-up mode or 0xFFFF if count-down mode. */

/* TCON[MOD] - Timer mode. */
#define TCON_MOD_MSK                   (0x1   << 3  )
#define TCON_MOD                       (0x1   << 3  )
#define TCON_MOD_FREERUN               (0x0   << 3  ) /* FREERUN. Operate in free running mode. */
#define TCON_MOD_PERIODIC              (0x1   << 3  ) /* PERIODIC. Operate in periodic mode. */

/* TCON[UP] - Count down/up. */
#define TCON_UP_MSK                    (0x1   << 2  )
#define TCON_UP                        (0x1   << 2  )
#define TCON_UP_DIS                    (0x0   << 2  ) /* DIS. Timer to count down. */
#define TCON_UP_EN                     (0x1   << 2  ) /* EN. Timer to count up.   */

/* TCON[PRE] - Prescaler. */
#define TCON_PRE_MSK                   (0x3   << 0  )
#define TCON_PRE_DIV1                  (0x0   << 0  ) /* DIV1. Source clock/1.If the selected clock source is UCLK or PCLK this setting results in a prescaler of 4. */
#define TCON_PRE_DIV16                 (0x1   << 0  ) /* DIV16. Source clock/16.  */
#define TCON_PRE_DIV256                (0x2   << 0  ) /* DIV256. Source clock/256. */
#define TCON_PRE_DIV32768              (0x3   << 0  ) /* DIV32768. Source clock/32768. */

/* TCLRI[CAP] - Clear captured event interrupt. */
#define TCLRI_CAP_MSK                  (0x1   << 1  )
#define TCLRI_CAP                      (0x1   << 1  )
#define TCLRI_CAP_CLR                  (0x1   << 1  ) /* CLR. Clear a captured event interrupt. This bit always reads 0. */

/* TCLRI[TMOUT] - Clear timeout interrupt. */
#define TCLRI_TMOUT_MSK                (0x1   << 0  )
#define TCLRI_TMOUT                    (0x1   << 0  )
#define TCLRI_TMOUT_CLR                (0x1   << 0  ) /* CLR. Clear a timeout interrupt. This bit always reads 0. */

/* TSTA[CLRI] - T0CLRI write sync in progress.. */
#define TSTA_CLRI_MSK                  (0x1   << 7  )
#define TSTA_CLRI                      (0x1   << 7  )
#define TSTA_CLRI_CLR                  (0x0   << 7  ) /* CLR. Cleared when the interrupt is cleared in the timer clock domain. */
#define TSTA_CLRI_SET                  (0x1   << 7  ) /* SET. Set automatically when the T0CLRI value is being updated in the timer clock domain, indicating that the timers configuration is not yet valid. */

/* TSTA[CON] - T0CON write sync in progress. */
#define TSTA_CON_MSK                   (0x1   << 6  )
#define TSTA_CON                       (0x1   << 6  )
#define TSTA_CON_CLR                   (0x0   << 6  ) /* CLR. Timer ready to receive commands to T0CON. The previous change of T0CON has been synchronized in the timer clock domain. */
#define TSTA_CON_SET                   (0x1   << 6  ) /* SET. Timer not ready to receive commands to T0CON. Previous change of the T0CON value has not been synchronized in the timer clock domain. */

/* TSTA[CAP] - Capture event pending. */
#define TSTA_CAP_MSK                   (0x1   << 1  )
#define TSTA_CAP                       (0x1   << 1  )
#define TSTA_CAP_CLR                   (0x0   << 1  ) /* CLR. No capture event is pending. */
#define TSTA_CAP_SET                   (0x1   << 1  ) /* SET. Capture event is pending. */

/* TSTA[TMOUT] - Time out event occurred. */
#define TSTA_TMOUT_MSK                 (0x1   << 0  )
#define TSTA_TMOUT                     (0x1   << 0  )
#define TSTA_TMOUT_CLR                 (0x0   << 0  ) /* CLR. No timeout event has occurred. */
#define TSTA_TMOUT_SET                 (0x1   << 0  ) /* SET. Timeout event has occurred.  For count-up mode, this is when the counter reaches full scale. For count-down mode, this is when the counter reaches 0. */

/* GPCON[CON7] - Configuration bits for Px.7 (not available for port 1). */
#define GPCON_CON7_MSK                 (0x3   << 14 )

/* GPCON[CON6] - Configuration bits for Px.6 (not available for port 1). */
#define GPCON_CON6_MSK                 (0x3   << 12 )

/* GPCON[CON5] - Configuration bits for Px.5. */
#define GPCON_CON5_MSK                 (0x3   << 10 )

/* GPCON[CON4] - Configuration bits for Px.4. */
#define GPCON_CON4_MSK                 (0x3   << 8  )

/* GPCON[CON3] - Configuration bits for Px.3. */
#define GPCON_CON3_MSK                 (0x3   << 6  )

/* GPCON[CON2] - Configuration bits for Px.2. */
#define GPCON_CON2_MSK                 (0x3   << 4  )

/* GPCON[CON1] - Configuration bits for Px.1. */
#define GPCON_CON1_MSK                 (0x3   << 2  )

/* GPCON[CON0] - Configuration bits for Px.0. */
#define GPCON_CON0_MSK                 (0x3   << 0  )

/* GPOEN[OEN7] - Port pin direction. */
#define GPOEN_OEN7_MSK                 (0x1   << 7  )
#define GPOEN_OEN7                     (0x1   << 7  )
#define GPOEN_OEN7_IN                  (0x0   << 7  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GPOEN_OEN7_OUT                 (0x1   << 7  ) /* OUT. Enables the output on corresponding port pin. */

/* GPOEN[OEN6] - Port pin direction. */
#define GPOEN_OEN6_MSK                 (0x1   << 6  )
#define GPOEN_OEN6                     (0x1   << 6  )
#define GPOEN_OEN6_IN                  (0x0   << 6  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GPOEN_OEN6_OUT                 (0x1   << 6  ) /* OUT. Enables the output on corresponding port pin. */

/* GPOEN[OEN5] - Port pin direction. */
#define GPOEN_OEN5_MSK                 (0x1   << 5  )
#define GPOEN_OEN5                     (0x1   << 5  )
#define GPOEN_OEN5_IN                  (0x0   << 5  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GPOEN_OEN5_OUT                 (0x1   << 5  ) /* OUT. Enables the output on corresponding port pin. */

/* GPOEN[OEN4] - Port pin direction. */
#define GPOEN_OEN4_MSK                 (0x1   << 4  )
#define GPOEN_OEN4                     (0x1   << 4  )
#define GPOEN_OEN4_IN                  (0x0   << 4  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GPOEN_OEN4_OUT                 (0x1   << 4  ) /* OUT. Enables the output on corresponding port pin. */

