contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GPOEN[OEN3] - Port pin direction. */
#define GPOEN_OEN3_MSK                 (0x1   << 3  )
#define GPOEN_OEN3                     (0x1   << 3  )
#define GPOEN_OEN3_IN                  (0x0   << 3  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GPOEN_OEN3_OUT                 (0x1   << 3  ) /* OUT. Enables the output on corresponding port pin. */

/* GPOEN[OEN2] - Port pin direction. */
#define GPOEN_OEN2_MSK                 (0x1   << 2  )
#define GPOEN_OEN2                     (0x1   << 2  )
#define GPOEN_OEN2_IN                  (0x0   << 2  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GPOEN_OEN2_OUT                 (0x1   << 2  ) /* OUT. Enables the output on corresponding port pin. */

/* GPOEN[OEN1] - Port pin direction. */
#define GPOEN_OEN1_MSK                 (0x1   << 1  )
#define GPOEN_OEN1                     (0x1   << 1  )
#define GPOEN_OEN1_IN                  (0x0   << 1  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GPOEN_OEN1_OUT                 (0x1   << 1  ) /* OUT. Enables the output on corresponding port pin. */

/* GPOEN[OEN0] - Port pin direction. */
#define GPOEN_OEN0_MSK                 (0x1   << 0  )
#define GPOEN_OEN0                     (0x1   << 0  )
#define GPOEN_OEN0_IN                  (0x0   << 0  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GPOEN_OEN0_OUT                 (0x1   << 0  ) /* OUT. Enables the output on corresponding port pin.. */

/* GPIN[IN7] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GPIN_IN7_MSK                   (0x1   << 7  )
#define GPIN_IN7                       (0x1   << 7  )
#define GPIN_IN7_LOW                   (0x0   << 7  ) /* LOW                      */
#define GPIN_IN7_HIGH                  (0x1   << 7  ) /* HIGH                     */

/* GPIN[IN6] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GPIN_IN6_MSK                   (0x1   << 6  )
#define GPIN_IN6                       (0x1   << 6  )
#define GPIN_IN6_LOW                   (0x0   << 6  ) /* LOW                      */
#define GPIN_IN6_HIGH                  (0x1   << 6  ) /* HIGH                     */

/* GPIN[IN5] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GPIN_IN5_MSK                   (0x1   << 5  )
#define GPIN_IN5                       (0x1   << 5  )
#define GPIN_IN5_LOW                   (0x0   << 5  ) /* LOW                      */
#define GPIN_IN5_HIGH                  (0x1   << 5  ) /* HIGH                     */

/* GPIN[IN4] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GPIN_IN4_MSK                   (0x1   << 4  )
#define GPIN_IN4                       (0x1   << 4  )
#define GPIN_IN4_LOW                   (0x0   << 4  ) /* LOW                      */
#define GPIN_IN4_HIGH                  (0x1   << 4  ) /* HIGH                     */

/* GPIN[IN3] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GPIN_IN3_MSK                   (0x1   << 3  )
#define GPIN_IN3                       (0x1   << 3  )
#define GPIN_IN3_LOW                   (0x0   << 3  ) /* LOW                      */
#define GPIN_IN3_HIGH                  (0x1   << 3  ) /* HIGH                     */

/* GPIN[IN2] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GPIN_IN2_MSK                   (0x1   << 2  )
#define GPIN_IN2                       (0x1   << 2  )
#define GPIN_IN2_LOW                   (0x0   << 2  ) /* LOW                      */
#define GPIN_IN2_HIGH                  (0x1   << 2  ) /* HIGH                     */

/* GPIN[IN1] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GPIN_IN1_MSK                   (0x1   << 1  )
#define GPIN_IN1                       (0x1   << 1  )
#define GPIN_IN1_LOW                   (0x0   << 1  ) /* LOW                      */
#define GPIN_IN1_HIGH                  (0x1   << 1  ) /* HIGH                     */

/* GPIN[IN0] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GPIN_IN0_MSK                   (0x1   << 0  )
#define GPIN_IN0                       (0x1   << 0  )
#define GPIN_IN0_LOW                   (0x0   << 0  ) /* LOW                      */
#define GPIN_IN0_HIGH                  (0x1   << 0  ) /* HIGH                     */

/* GPOUT[OUT7] - Data out register. */
#define GPOUT_OUT7_MSK                 (0x1   << 7  )
#define GPOUT_OUT7                     (0x1   << 7  )
#define GPOUT_OUT7_LOW                 (0x0   << 7  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GPOUT_OUT7_HIGH                (0x1   << 7  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GPOUT[OUT6] - Data out register. */
#define GPOUT_OUT6_MSK                 (0x1   << 6  )
#define GPOUT_OUT6                     (0x1   << 6  )
#define GPOUT_OUT6_LOW                 (0x0   << 6  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GPOUT_OUT6_HIGH                (0x1   << 6  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GPOUT[OUT5] - Data out register. */
#define GPOUT_OUT5_MSK                 (0x1   << 5  )
#define GPOUT_OUT5                     (0x1   << 5  )
#define GPOUT_OUT5_LOW                 (0x0   << 5  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GPOUT_OUT5_HIGH                (0x1   << 5  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GPOUT[OUT4] - Data out register. */
#define GPOUT_OUT4_MSK                 (0x1   << 4  )
#define GPOUT_OUT4                     (0x1   << 4  )
#define GPOUT_OUT4_LOW                 (0x0   << 4  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GPOUT_OUT4_HIGH                (0x1   << 4  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GPOUT[OUT3] - Data out register. */
#define GPOUT_OUT3_MSK                 (0x1   << 3  )
#define GPOUT_OUT3                     (0x1   << 3  )
#define GPOUT_OUT3_LOW                 (0x0   << 3  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GPOUT_OUT3_HIGH                (0x1   << 3  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

