contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GPOUT[OUT2] - Data out register. */
#define GPOUT_OUT2_MSK                 (0x1   << 2  )
#define GPOUT_OUT2                     (0x1   << 2  )
#define GPOUT_OUT2_LOW                 (0x0   << 2  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GPOUT_OUT2_HIGH                (0x1   << 2  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GPOUT[OUT1] - Data out register. */
#define GPOUT_OUT1_MSK                 (0x1   << 1  )
#define GPOUT_OUT1                     (0x1   << 1  )
#define GPOUT_OUT1_LOW                 (0x0   << 1  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GPOUT_OUT1_HIGH                (0x1   << 1  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GPOUT[OUT0] - Data out register. */
#define GPOUT_OUT0_MSK                 (0x1   << 0  )
#define GPOUT_OUT0                     (0x1   << 0  )
#define GPOUT_OUT0_LOW                 (0x0   << 0  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GPOUT_OUT0_HIGH                (0x1   << 0  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GPSET[SET7] - Set output high for corresponding port pin. */
#define GPSET_SET7_MSK                 (0x1   << 7  )
#define GPSET_SET7                     (0x1   << 7  )
#define GPSET_SET7_SET                 (0x1   << 7  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GPSET[SET6] - Set output high for corresponding port pin. */
#define GPSET_SET6_MSK                 (0x1   << 6  )
#define GPSET_SET6                     (0x1   << 6  )
#define GPSET_SET6_SET                 (0x1   << 6  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GPSET[SET5] - Set output high for corresponding port pin. */
#define GPSET_SET5_MSK                 (0x1   << 5  )
#define GPSET_SET5                     (0x1   << 5  )
#define GPSET_SET5_SET                 (0x1   << 5  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GPSET[SET4] - Set output high for corresponding port pin. */
#define GPSET_SET4_MSK                 (0x1   << 4  )
#define GPSET_SET4                     (0x1   << 4  )
#define GPSET_SET4_SET                 (0x1   << 4  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GPSET[SET3] - Set output high for corresponding port pin. */
#define GPSET_SET3_MSK                 (0x1   << 3  )
#define GPSET_SET3                     (0x1   << 3  )
#define GPSET_SET3_SET                 (0x1   << 3  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GPSET[SET2] - Set output high for corresponding port pin. */
#define GPSET_SET2_MSK                 (0x1   << 2  )
#define GPSET_SET2                     (0x1   << 2  )
#define GPSET_SET2_SET                 (0x1   << 2  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GPSET[SET1] - Set output high for corresponding port pin. */
#define GPSET_SET1_MSK                 (0x1   << 1  )
#define GPSET_SET1                     (0x1   << 1  )
#define GPSET_SET1_SET                 (0x1   << 1  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GPSET[SET0] - Set output high for corresponding port pin. */
#define GPSET_SET0_MSK                 (0x1   << 0  )
#define GPSET_SET0                     (0x1   << 0  )
#define GPSET_SET0_SET                 (0x1   << 0  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GPCLR[CLR7] - Set by user code to drive the corresponding GPIO low. */
#define GPCLR_CLR7_MSK                 (0x1   << 7  )
#define GPCLR_CLR7                     (0x1   << 7  )
#define GPCLR_CLR7_CLR                 (0x1   << 7  ) /* CLR                      */

/* GPCLR[CLR6] - Set by user code to drive the corresponding GPIO low. */
#define GPCLR_CLR6_MSK                 (0x1   << 6  )
#define GPCLR_CLR6                     (0x1   << 6  )
#define GPCLR_CLR6_CLR                 (0x1   << 6  ) /* CLR                      */

/* GPCLR[CLR5] - Set by user code to drive the corresponding GPIO low. */
#define GPCLR_CLR5_MSK                 (0x1   << 5  )
#define GPCLR_CLR5                     (0x1   << 5  )
#define GPCLR_CLR5_CLR                 (0x1   << 5  ) /* CLR                      */

/* GPCLR[CLR4] - Set by user code to drive the corresponding GPIO low. */
#define GPCLR_CLR4_MSK                 (0x1   << 4  )
#define GPCLR_CLR4                     (0x1   << 4  )
#define GPCLR_CLR4_CLR                 (0x1   << 4  ) /* CLR                      */

/* GPCLR[CLR3] - Set by user code to drive the corresponding GPIO low. */
#define GPCLR_CLR3_MSK                 (0x1   << 3  )
#define GPCLR_CLR3                     (0x1   << 3  )
#define GPCLR_CLR3_CLR                 (0x1   << 3  ) /* CLR                      */

/* GPCLR[CLR2] - Set by user code to drive the corresponding GPIO low. */
#define GPCLR_CLR2_MSK                 (0x1   << 2  )
#define GPCLR_CLR2                     (0x1   << 2  )
#define GPCLR_CLR2_CLR                 (0x1   << 2  ) /* CLR                      */

/* GPCLR[CLR1] - Set by user code to drive the corresponding GPIO low. */
#define GPCLR_CLR1_MSK                 (0x1   << 1  )
#define GPCLR_CLR1                     (0x1   << 1  )
#define GPCLR_CLR1_CLR                 (0x1   << 1  ) /* CLR                      */

/* GPCLR[CLR0] - Set by user code to drive the corresponding GPIO low. */
#define GPCLR_CLR0_MSK                 (0x1   << 0  )
#define GPCLR_CLR0                     (0x1   << 0  )
#define GPCLR_CLR0_CLR                 (0x1   << 0  ) /* CLR                      */

/* GPTGL[TGL7] - Toggle for corresponding port pin. */
#define GPTGL_TGL7_MSK                 (0x1   << 7  )
#define GPTGL_TGL7                     (0x1   << 7  )
#define GPTGL_TGL7_TGL                 (0x1   << 7  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GPTGL[TGL6] - Toggle for corresponding port pin. */
#define GPTGL_TGL6_MSK                 (0x1   << 6  )
#define GPTGL_TGL6                     (0x1   << 6  )
#define GPTGL_TGL6_TGL                 (0x1   << 6  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GPTGL[TGL5] - Toggle for corresponding port pin. */
#define GPTGL_TGL5_MSK                 (0x1   << 5  )
#define GPTGL_TGL5                     (0x1   << 5  )
#define GPTGL_TGL5_TGL                 (0x1   << 5  ) /* TGL. Set by user code to invert the corresponding GPIO. */

