contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GPTGL[TGL4] - Toggle for corresponding port pin. */
#define GPTGL_TGL4_MSK                 (0x1   << 4  )
#define GPTGL_TGL4                     (0x1   << 4  )
#define GPTGL_TGL4_TGL                 (0x1   << 4  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GPTGL[TGL3] - Toggle for corresponding port pin. */
#define GPTGL_TGL3_MSK                 (0x1   << 3  )
#define GPTGL_TGL3                     (0x1   << 3  )
#define GPTGL_TGL3_TGL                 (0x1   << 3  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GPTGL[TGL2] - Toggle for corresponding port pin. */
#define GPTGL_TGL2_MSK                 (0x1   << 2  )
#define GPTGL_TGL2                     (0x1   << 2  )
#define GPTGL_TGL2_TGL                 (0x1   << 2  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GPTGL[TGL1] - Toggle for corresponding port pin. */
#define GPTGL_TGL1_MSK                 (0x1   << 1  )
#define GPTGL_TGL1                     (0x1   << 1  )
#define GPTGL_TGL1_TGL                 (0x1   << 1  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GPTGL[TGL0] - Toggle for corresponding port pin. */
#define GPTGL_TGL0_MSK                 (0x1   << 0  )
#define GPTGL_TGL0                     (0x1   << 0  )
#define GPTGL_TGL0_TGL                 (0x1   << 0  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* CLK[T1] - T1 clocks enable bit. */
#define CLK_T1_MSK                     (0x1   << 11 )
#define CLK_T1                         (0x1   << 11 )
#define CLK_T1_DIS                     (0x0   << 11 ) /* DIS. Disable T1 clocks.  */
#define CLK_T1_EN                      (0x1   << 11 ) /* EN. Enable T1 clocks.    */

/* CLK[T0] - T0 clocks enable bit. */
#define CLK_T0_MSK                     (0x1   << 10 )
#define CLK_T0                         (0x1   << 10 )
#define CLK_T0_DIS                     (0x0   << 10 ) /* DIS. Disable T0 clocks.  */
#define CLK_T0_EN                      (0x1   << 10 ) /* EN. Enable T0 clocks.    */

/* CLK[PWM] - PWM clocks enable bit. */
#define CLK_PWM_MSK                    (0x1   << 9  )
#define CLK_PWM                        (0x1   << 9  )
#define CLK_PWM_DIS                    (0x0   << 9  ) /* DIS. Disable PWM clocks. */
#define CLK_PWM_EN                     (0x1   << 9  ) /* EN. Enable PWM clocks.   */

/* CLK[I2C] - I2C clocks enable bit. */
#define CLK_I2C_MSK                    (0x1   << 8  )
#define CLK_I2C                        (0x1   << 8  )
#define CLK_I2C_DIS                    (0x0   << 8  ) /* DIS. Disable I2C clocks. */
#define CLK_I2C_EN                     (0x1   << 8  ) /* EN. Enable I2C clocks.   */

/* CLK[COM] - UART clocks enable bit. */
#define CLK_COM_MSK                    (0x1   << 7  )
#define CLK_COM                        (0x1   << 7  )
#define CLK_COM_DIS                    (0x0   << 7  ) /* DIS. Disable UART clocks. */
#define CLK_COM_EN                     (0x1   << 7  ) /* EN. Enable UART clocks.  */

/* CLK[SPI1] - SPI1 clocks enable bit. */
#define CLK_SPI1_MSK                   (0x1   << 6  )
#define CLK_SPI1                       (0x1   << 6  )
#define CLK_SPI1_DIS                   (0x0   << 6  ) /* DIS. Disable SPI1 clocks. */
#define CLK_SPI1_EN                    (0x1   << 6  ) /* EN. Enable SPI1 clocks.  */

/* CLK[SPI0] - SPI0 clocks enable bit. */
#define CLK_SPI0_MSK                   (0x1   << 5  )
#define CLK_SPI0                       (0x1   << 5  )
#define CLK_SPI0_DIS                   (0x0   << 5  ) /* DIS. Disable SPI0 clocks. */
#define CLK_SPI0_EN                    (0x1   << 5  ) /* EN. Enable SPI0 clocks.  */

/* CLK[T2] - T2 clocks enable bit. */
#define CLK_T2_MSK                     (0x1   << 4  )
#define CLK_T2                         (0x1   << 4  )
#define CLK_T2_DIS                     (0x0   << 4  ) /* DIS. Disable T2 clocks.  */
#define CLK_T2_EN                      (0x1   << 4  ) /* EN. Enable T2 clocks.    */

/* CLK[ADC] - ADC clocks enable bit. */
#define CLK_ADC_MSK                    (0x1   << 3  )
#define CLK_ADC                        (0x1   << 3  )
#define CLK_ADC_DIS                    (0x0   << 3  ) /* DIS. Disable ADC clocks. */
#define CLK_ADC_EN                     (0x1   << 3  ) /* EN. Enable ADC clocks.   */

/* CLK[SRAM] - SRAM clocks enable bit. */
#define CLK_SRAM_MSK                   (0x1   << 2  )
#define CLK_SRAM                       (0x1   << 2  )
#define CLK_SRAM_DIS                   (0x0   << 2  ) /* DIS. Disable SRAM memory clocks. */
#define CLK_SRAM_EN                    (0x1   << 2  ) /* EN. Enable SRAM memory clocks. */

/* CLK[FEE] - Flash clocks enable bit. */
#define CLK_FEE_MSK                    (0x1   << 1  )
#define CLK_FEE                        (0x1   << 1  )
#define CLK_FEE_DIS                    (0x0   << 1  ) /* DIS. Disable Flash memory clocks. */
#define CLK_FEE_EN                     (0x1   << 1  ) /* EN. Enable Flash memory clocks. */

/* CLK[DMA] - DMA clock enable bit. */
#define CLK_DMA_MSK                    (0x1   << 0  )
#define CLK_DMA                        (0x1   << 0  )
#define CLK_DMA_DIS                    (0x0   << 0  ) /* DIS. Disable DMA clock.  */
#define CLK_DMA_EN                     (0x1   << 0  ) /* EN. Enable DMA clock.    */

/* SPIDIV[BCRST] - Configures the behavior of SPI communication after an abrupt deassertion of CS.  This bit should be set in slave and master mode. */
#define SPIDIV_BCRST_MSK               (0x1   << 7  )
#define SPIDIV_BCRST                   (0x1   << 7  )
#define SPIDIV_BCRST_DIS               (0x0   << 7  ) /* DIS. Resumes communication from where it stopped when the CS is deasserted. The rest of the bits are then received/ transmitted when CS returns low. User code should ignore the CSERR interrupt. */
#define SPIDIV_BCRST_EN                (0x1   << 7  ) /* EN. Enabled for a clean restart of SPI transfer after a CSERR condition. User code must also clear the SPI enable bit in SPI0CON during the CSERR interrupt. */

/* SPIDIV[DIV] - Factor used to divide UCLK in the generation of the master mode serial clock. */
#define SPIDIV_DIV_MSK                 (0x3F  << 0  )

/* SPICON[MOD] - IRQ mode bits. When TIM is set these bits configure when the Tx/Rx interrupts occur in a transfer. For a DMA Rx transfer, these bits should be 00. */
#define SPICON_MOD_MSK                 (0x3   << 14 )
#define SPICON_MOD_TX1RX1              (0x0   << 14 ) /* TX1RX1. Tx/Rx interrupt occurs when 1 byte has been transmitted/received from/into the FIFO. */
#define SPICON_MOD_TX2RX2              (0x1   << 14 ) /* TX2RX2. Tx/Rx interrupt occurs when 2 bytes have been transmitted/received from/into the FIFO. */
#define SPICON_MOD_TX3RX3              (0x2   << 14 ) /* TX3RX3. Tx/Rx interrupt occurs when 3 bytes have been transmitted/received from/into the FIFO. */
#define SPICON_MOD_TX4RX4              (0x3   << 14 ) /* TX4RX4. Tx/Rx interrupt occurs when 4 bytes have been transmitted/received from/into the FIFO. */

