contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* SPICON[TFLUSH] - Tx FIFO flush enable bit. */
#define SPICON_TFLUSH_MSK              (0x1   << 13 )
#define SPICON_TFLUSH                  (0x1   << 13 )
#define SPICON_TFLUSH_DIS              (0x0   << 13 ) /* DIS. Disable Tx FIFO flushing. */
#define SPICON_TFLUSH_EN               (0x1   << 13 ) /* EN. Flush the Tx FIFO. This bit does not clear itself and should be toggled if a single flush is required. If this bit is left high, then either the last transmitted value or 0x00 is transmitted depending on the ZEN bit (SPI0CON[7]). Any writes to the Tx FIFO are ignored while this bit is set. */

/* SPICON[RFLUSH] - Rx FIFO flush enable bit. */
#define SPICON_RFLUSH_MSK              (0x1   << 12 )
#define SPICON_RFLUSH                  (0x1   << 12 )
#define SPICON_RFLUSH_DIS              (0x0   << 12 ) /* DIS. Disable Rx FIFO flushing. */
#define SPICON_RFLUSH_EN               (0x1   << 12 ) /* EN. If this bit is set, all incoming data is ignored and no interrupts are generated. If set and TIM = 0  (SPI0CON[6]), a read of the Rx FIFO initiates a transfer. */

/* SPICON[CON] - Continuous transfer enable bit. */
#define SPICON_CON_MSK                 (0x1   << 11 )
#define SPICON_CON                     (0x1   << 11 )
#define SPICON_CON_DIS                 (0x0   << 11 ) /* DIS. Disable continuous transfer. Each transfer consists of a single 8-bit serial transfer. If valid data exists in the SPIxTX register, then a new transfer is initiated after a stall period of one serial clock cycle. The CS line is deactivated for this one serial clock cycle. */
#define SPICON_CON_EN                  (0x1   << 11 ) /* EN. Enable continuous transfer. In master mode, the transfer continues until no valid data is available in the Tx register. CS is asserted and remains asserted for the duration of each 8-bit serial transfer until Tx is empty. */

/* SPICON[LOOPBACK] - Loopback enable bit. */
#define SPICON_LOOPBACK_MSK            (0x1   << 10 )
#define SPICON_LOOPBACK                (0x1   << 10 )
#define SPICON_LOOPBACK_DIS            (0x0   << 10 ) /* DIS. Normal mode.        */
#define SPICON_LOOPBACK_EN             (0x1   << 10 ) /* EN. Connect MISO to MOSI, thus, data transmitted from Tx register is looped back to the Rx register. SPI must be configured in master mode. */

/* SPICON[SOEN] - Slave output enable bit. */
#define SPICON_SOEN_MSK                (0x1   << 9  )
#define SPICON_SOEN                    (0x1   << 9  )
#define SPICON_SOEN_DIS                (0x0   << 9  ) /* DIS. Disable the output driver on the MISO pin. The MISO pin is open-circuit when this bit is clear. */
#define SPICON_SOEN_EN                 (0x1   << 9  ) /* EN. MISO operates as normal. */

/* SPICON[RXOF] - RX overflow overwrite enable bit. */
#define SPICON_RXOF_MSK                (0x1   << 8  )
#define SPICON_RXOF                    (0x1   << 8  )
#define SPICON_RXOF_DIS                (0x0   << 8  ) /* DIS. The new serial byte received is discarded when there is no space left in the FIFO */
#define SPICON_RXOF_EN                 (0x1   << 8  ) /* EN. The valid data in the Rx register is overwritten by the new serial byte received when there is no space left in the FIFO. */

/* SPICON[ZEN] - Transmit underrun: Transmit 0s when the Tx FIFO is empty */
#define SPICON_ZEN_MSK                 (0x1   << 7  )
#define SPICON_ZEN                     (0x1   << 7  )
#define SPICON_ZEN_DIS                 (0x0   << 7  ) /* DIS. The last byte from the previous transmission is shifted out when a transfer is initiated with no valid data in the FIFO. */
#define SPICON_ZEN_EN                  (0x1   << 7  ) /* EN. Transmit 0x00 when a transfer is initiated with no valid data in the FIFO. */

/* SPICON[TIM] - Transfer and interrupt mode bit. */
#define SPICON_TIM_MSK                 (0x1   << 6  )
#define SPICON_TIM                     (0x1   << 6  )
#define SPICON_TIM_TXWR                (0x1   << 6  ) /* TXWR. Initiate transfer with a write to the SPIxTX register.  Interrupt only occurs when Tx is empty. */
#define SPICON_TIM_RXRD                (0x0   << 6  ) /* RXRD. Initiate transfer with a read of the SPIxRX register.  The read must be done while the SPI interface is idle. Interrupt only occurs when Rx is full. */

/* SPICON[LSB] - LSB first transfer enable bit. */
#define SPICON_LSB_MSK                 (0x1   << 5  )
#define SPICON_LSB                     (0x1   << 5  )
#define SPICON_LSB_DIS                 (0x0   << 5  ) /* DIS. MSB is transmitted first. */
#define SPICON_LSB_EN                  (0x1   << 5  ) /* EN. LSB is transmitted first. */

/* SPICON[WOM] - Wired OR enable bit. */
#define SPICON_WOM_MSK                 (0x1   << 4  )
#define SPICON_WOM                     (0x1   << 4  )
#define SPICON_WOM_DIS                 (0x0   << 4  ) /* DIS. Normal driver output operation. */
#define SPICON_WOM_EN                  (0x1   << 4  ) /* EN. Enable open circuit data output for multimaster/multislave configuration. */

/* SPICON[CPOL] - Serial clock polarity mode bit. */
#define SPICON_CPOL_MSK                (0x1   << 3  )
#define SPICON_CPOL                    (0x1   << 3  )
#define SPICON_CPOL_LOW                (0x0   << 3  ) /* LOW. Serial clock idles low. */
#define SPICON_CPOL_HIGH               (0x1   << 3  ) /* HIGH. Serial clock idles high. */

/* SPICON[CPHA] - Serial clock phase mode bit. */
#define SPICON_CPHA_MSK                (0x1   << 2  )
#define SPICON_CPHA                    (0x1   << 2  )
#define SPICON_CPHA_SAMPLELEADING      (0x0   << 2  ) /* SAMPLELEADING. Serial clock pulses at the middle of the first data bit transfer. */
#define SPICON_CPHA_SAMPLETRAILING     (0x1   << 2  ) /* SAMPLETRAILING. Serial clock pulses at the start of the first data bit. */

/* SPICON[MASEN] - Master mode enable bit. */
#define SPICON_MASEN_MSK               (0x1   << 1  )
#define SPICON_MASEN                   (0x1   << 1  )
#define SPICON_MASEN_DIS               (0x0   << 1  ) /* DIS. Configure in slave mode. */
#define SPICON_MASEN_EN                (0x1   << 1  ) /* EN. Configure in master mode. */

/* SPICON[ENABLE] - SPI enable bit. */
#define SPICON_ENABLE_MSK              (0x1   << 0  )
#define SPICON_ENABLE                  (0x1   << 0  )
#define SPICON_ENABLE_DIS              (0x0   << 0  ) /* DIS. Disable the SPI. Clearing this bit will also reset all the FIFO related logic to enable a clean start. */
#define SPICON_ENABLE_EN               (0x1   << 0  ) /* EN. Enable the SPI.      */

