contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* SPIDMA[IENRXDMA] - Receive DMA request enable bit. */
#define SPIDMA_IENRXDMA_MSK            (0x1   << 2  )
#define SPIDMA_IENRXDMA                (0x1   << 2  )
#define SPIDMA_IENRXDMA_DIS            (0x0   << 2  ) /* DIS. Disable Rx DMA requests. */
#define SPIDMA_IENRXDMA_EN             (0x1   << 2  ) /* EN. Enable Rx DMA requests. */

/* SPIDMA[IENTXDMA] - Transmit DMA request enable bit. */
#define SPIDMA_IENTXDMA_MSK            (0x1   << 1  )
#define SPIDMA_IENTXDMA                (0x1   << 1  )
#define SPIDMA_IENTXDMA_DIS            (0x0   << 1  ) /* DIS. Disable Tx DMA requests. */
#define SPIDMA_IENTXDMA_EN             (0x1   << 1  ) /* EN. Enable Tx DMA requests. */

/* SPIDMA[ENABLE] - DMA data transfer enable bit. */
#define SPIDMA_ENABLE_MSK              (0x1   << 0  )
#define SPIDMA_ENABLE                  (0x1   << 0  )
#define SPIDMA_ENABLE_DIS              (0x0   << 0  ) /* DIS. Disable DMA transfer. This bit needs to be cleared to prevent extra DMA request to the µDMA controller. */
#define SPIDMA_ENABLE_EN               (0x1   << 0  ) /* EN. Enable a DMA transfer. Starts the transfer of a master configured to initiate transfer on transmit. */

/* SPISTA[CSERR] - CS error status bit. This bit generates an interrupt when detecting an abrupt CS desassertion before the full byte of data is transmitted completely. */
#define SPISTA_CSERR_MSK               (0x1   << 12 )
#define SPISTA_CSERR                   (0x1   << 12 )
#define SPISTA_CSERR_CLR               (0x0   << 12 ) /* CLR: Cleared when no CS error is detected. Cleared to 0 on a read of SPI0STA register. */
#define SPISTA_CSERR_SET               (0x1   << 12 ) /* SET: Set when the CS line is deasserted abruptly. */

/* SPISTA[RXS] - Rx FIFO excess bytes present. */
#define SPISTA_RXS_MSK                 (0x1   << 11 )
#define SPISTA_RXS                     (0x1   << 11 )
#define SPISTA_RXS_CLR                 (0x0   << 11 ) /* CLR. When the number of bytes in the FIFO is equal or less than the number in SPI0CON[15:14]. This bit is not cleared on a read of SPI0STA register. */
#define SPISTA_RXS_SET                 (0x1   << 11 ) /* SET. When there are more bytes in the Rx FIFO than configured in MOD (SPI0CON[15:14]). For example if MOD = TX1RX1, RXS is set when there are 2 or more bytes in the Rx FIFO. This bit does not dependent on SPI0CON[6] and does not cause an interrupt. */

/* SPISTA[RXFSTA] - Rx FIFO status bits, indicates how many valid bytes are in the Rx FIFO. */
#define SPISTA_RXFSTA_MSK              (0x7   << 8  )
#define SPISTA_RXFSTA_EMPTY            (0x0   << 8  ) /* EMPTY. When Rx FIFO is empty. */
#define SPISTA_RXFSTA_ONEBYTE          (0x1   << 8  ) /* ONEBYTE. When 1 valid byte is in the FIFO. */
#define SPISTA_RXFSTA_TWOBYTES         (0x2   << 8  ) /* TWOBYTES. When 2 valid bytes are in the FIFO. */
#define SPISTA_RXFSTA_THREEBYTES       (0x3   << 8  ) /* THREEBYTES. When 3 valid bytes are in the FIFO. */
#define SPISTA_RXFSTA_FOURBYTES        (0x4   << 8  ) /* FOURBYTES. When 4 valid bytes are in the FIFO. */

/* SPISTA[RXOF] - Rx FIFO overflow status bit. This bit generates an interrupt. */
#define SPISTA_RXOF_MSK                (0x1   << 7  )
#define SPISTA_RXOF                    (0x1   << 7  )
#define SPISTA_RXOF_CLR                (0x0   << 7  ) /* CLR. Cleared to 0 on a read of SPI0STA register. */
#define SPISTA_RXOF_SET                (0x1   << 7  ) /* SET. Set when the Rx FIFO is already full when new data is loaded to the FIFO. This bit generates an interrupt except when RFLUSH is set. (SPI0CON[12]). */

/* SPISTA[RX] - Rx interrupt status bit. This bit generates an interrupt, except when DMA transfer is enabled. */
#define SPISTA_RX_MSK                  (0x1   << 6  )
#define SPISTA_RX                      (0x1   << 6  )
#define SPISTA_RX_CLR                  (0x0   << 6  ) /* CLR. Cleared to 0 on a read of SPI0STA register. */
#define SPISTA_RX_SET                  (0x1   << 6  ) /* SET. Set when a receive interrupt occurs. This bit is set when TIM (SPI0CON[6]) is cleared and the required number of bytes have been received. */

/* SPISTA[TX] - Tx interrupt status bit. This bit generates an interrupt, except when DMA transfer is enabled. */
#define SPISTA_TX_MSK                  (0x1   << 5  )
#define SPISTA_TX                      (0x1   << 5  )
#define SPISTA_TX_CLR                  (0x0   << 5  ) /* CLR. Cleared to 0 on a read of SPI0STA register. */
#define SPISTA_TX_SET                  (0x1   << 5  ) /* SET. Set when a transmit interrupt occurs. This bit is set when TIM (SPI0CON[6]) set and the required number of bytes have been transmitted. */

/* SPISTA[TXUR] - Tx FIFO Underrun. This bit generates an interrupt. */
#define SPISTA_TXUR_MSK                (0x1   << 4  )
#define SPISTA_TXUR                    (0x1   << 4  )
#define SPISTA_TXUR_CLR                (0x0   << 4  ) /* CLR. Cleared to 0 on a read of SPI0STA register. */
#define SPISTA_TXUR_SET                (0x1   << 4  ) /* SET. Set when a transmit is initiated without any valid data in the Tx FIFO. This bit generates an interrupt except when TFLUSH is set in SPI0CON. */

/* SPISTA[TXFSTA] - Tx FIFO status bits, indicates how many valid bytes are in the Tx FIFO. */
#define SPISTA_TXFSTA_MSK              (0x7   << 1  )
#define SPISTA_TXFSTA_EMPTY            (0x0   << 1  ) /* EMPTY. Tx FIFO is empty. */
#define SPISTA_TXFSTA_ONEBYTE          (0x1   << 1  ) /* ONEBYTE. 1 valid byte is in the FIFO. */
#define SPISTA_TXFSTA_TWOBYTES         (0x2   << 1  ) /* TWOBYTES. 2 valid bytes are in the FIFO. */
#define SPISTA_TXFSTA_THREEBYTES       (0x3   << 1  ) /* THREEBYTES. 3 valid bytes are in the FIFO. */
#define SPISTA_TXFSTA_FOURBYTES        (0x4   << 1  ) /* FOURBYTES . 4 valid bytes are in the FIFO. */

/* SPISTA[IRQ] - Interrupt status bit. */
#define SPISTA_IRQ_MSK                 (0x1   << 0  )
#define SPISTA_IRQ                     (0x1   << 0  )
#define SPISTA_IRQ_CLR                 (0x0   << 0  ) /* CLR. Cleared to 0 on a read of SPI0STA register. */
#define SPISTA_IRQ_SET                 (0x1   << 0  ) /* SET. Set to 1 when an SPI0 based interrupt occurs. */

