contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* SPIDIV[BCRST] - Configures the behavior of SPI communication after an abrupt deassertion of CS.  This bit should be set in slave and master mode. */
#define SPIDIV_BCRST_MSK               (0x1   << 7  )
#define SPIDIV_BCRST                   (0x1   << 7  )
#define SPIDIV_BCRST_DIS               (0x0   << 7  ) /* DIS. Resumes communication from where it stopped when the CS is deasserted. The rest of the bits are then received/ transmitted when CS returns low. User code should ignore the CSERR interrupt. */
#define SPIDIV_BCRST_EN                (0x1   << 7  ) /* EN. Enabled for a clean restart of SPI transfer after a CSERR condition. User code must also clear the SPI enable bit in SPI0CON during the CSERR interrupt. */

/* SPIDIV[DIV] - Factor used to divide UCLK in the generation of the master mode serial clock. */
#define SPIDIV_DIV_MSK                 (0x3F  << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        ADC0                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Analog to Digital Converter (pADI_ADC0)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_ADC0 Structure                    */
  __IO uint16_t  ADCCFG;                    /*!< ADC Configuration Register            */
  __I  uint16_t  RESERVED0;
  __IO uint8_t   ADCCON;                    /*!< ADC Control Register                  */
  __I  uint8_t   RESERVED1[3];
  __IO uint8_t   ADCSTA;                    /*!< ADC Status Register                   */
  __I  uint8_t   RESERVED2[3];
  __IO uint16_t  ADCDAT;                    /*!< ADC Data Register                     */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  ADCGN;                     /*!< ADC Gain Register                     */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  ADCOF;                     /*!< ADC Offset Register                   */
} ADI_ADC_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          ADCCFG                                     (*(volatile unsigned short int *) 0x40050000)
#define          ADCCON                                     (*(volatile unsigned char      *) 0x40050004)
#define          ADCSTA                                     (*(volatile unsigned char      *) 0x40050008)
#define          ADCDAT                                     (*(volatile unsigned short int *) 0x4005000C)
#define          ADCGN                                      (*(volatile unsigned short int *) 0x40050010)
#define          ADCOF                                      (*(volatile unsigned short int *) 0x40050014)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for ADCCFG*/
#define ADCCFG_RVAL                    0xA00

/* ADCCFG[REF] - Reference select */
#define ADCCFG_REF_BBA                 (*(volatile unsigned long *) 0x42A00034)
#define ADCCFG_REF_MSK                 (0x1   << 13 )
#define ADCCFG_REF                     (0x1   << 13 )
#define ADCCFG_REF_INTERNAL125V        (0x0   << 13 ) /* INTERNAL125V. Select the internal 1.25 V reference as the ADC reference. */
#define ADCCFG_REF_LVDD                (0x1   << 13 ) /* LVDD. Select the 1.8V regulator output (LVDD1) as the ADC reference. */

/* ADCCFG[CLK] - ADC clock frequency */
#define ADCCFG_CLK_MSK                 (0x7   << 10 )
#define ADCCFG_CLK_FCORE               (0x0   << 10 ) /* FCORE.                   */
#define ADCCFG_CLK_FCOREDIV2           (0x1   << 10 ) /* FCOREDIV2.               */
#define ADCCFG_CLK_FCOREDIV4           (0x2   << 10 ) /* FCOREDIV4.               */
#define ADCCFG_CLK_FCOREDIV8           (0x3   << 10 ) /* FCOREDIV8.               */
#define ADCCFG_CLK_FCOREDIV16          (0x4   << 10 ) /* FCOREDIV16.              */
#define ADCCFG_CLK_FCOREDIV32          (0x5   << 10 ) /* FCOREDIV32.              */

/* ADCCFG[ACQ] - Acquisition clocks */
#define ADCCFG_ACQ_MSK                 (0x3   << 8  )
#define ADCCFG_ACQ_2                   (0x0   << 8  ) /* 2.                       */
#define ADCCFG_ACQ_4                   (0x1   << 8  ) /* 4.                       */
#define ADCCFG_ACQ_8                   (0x2   << 8  ) /* 8.                       */
#define ADCCFG_ACQ_16                  (0x3   << 8  ) /* 16.                      */

/* ADCCFG[CHSEL] - Channel select */
#define ADCCFG_CHSEL_MSK               (0xF   << 0  )
#define ADCCFG_CHSEL_ADC0              (0x0   << 0  ) /* ADC0. Single ended ADC0 input. */
#define ADCCFG_CHSEL_ADC1              (0x1   << 0  ) /* ADC1. Single ended ADC1 input. */
#define ADCCFG_CHSEL_ADC2              (0x2   << 0  ) /* ADC2. Single ended ADC2 input. */
#define ADCCFG_CHSEL_ADC3              (0x3   << 0  ) /* ADC3. Single ended ADC3 input. */
#define ADCCFG_CHSEL_ADC4              (0x4   << 0  ) /* ADC4. Single ended ADC4 input. */
#define ADCCFG_CHSEL_ADC5              (0x5   << 0  ) /* ADC5. Single ended ADC5 input. */
#define ADCCFG_CHSEL_DIFF0             (0x6   << 0  ) /* DIFF0. Differential ADC0 - ADC1 inputs. */
#define ADCCFG_CHSEL_DIFF1             (0x7   << 0  ) /* DIFF1. Differential ADC2 - ADC3 inputs. */
#define ADCCFG_CHSEL_DIFF2             (0x8   << 0  ) /* DIFF2. Differential ADC4 - ADC5 inputs. */
#define ADCCFG_CHSEL_TEMP              (0x9   << 0  ) /* TEMP. Internal temperature sensor. */
#define ADCCFG_CHSEL_VBATDIV4          (0xA   << 0  ) /* VBATDIV4. Internal supply divided by 4. */
#define ADCCFG_CHSEL_LVDDDIV2          (0xB   << 0  ) /* LVDDDIV2. Internal 1.8V regulator output (LVDD1) divided by 2. */
#define ADCCFG_CHSEL_VREF              (0xC   << 0  ) /* VREF. Internal ADC reference input for gain calibration. */
#define ADCCFG_CHSEL_AGND              (0xD   << 0  ) /* AGND. Internal ADC ground input for offset calibration. */

/* Reset Value for ADCCON*/
#define ADCCON_RVAL                    0x90

/* ADCCON[REFBUF] - Reference buffer enable bit. */
#define ADCCON_REFBUF_BBA              (*(volatile unsigned long *) 0x42A0009C)
#define ADCCON_REFBUF_MSK              (0x1   << 7  )
#define ADCCON_REFBUF                  (0x1   << 7  )
#define ADCCON_REFBUF_EN               (0x0   << 7  ) /* EN. Turn on the reference buffer. The reference buffer takes 5 ms to settle and consumes approximately 210 μA. */
#define ADCCON_REFBUF_DIS              (0x1   << 7  ) /* DIS. Turn off the reference buffer. The internal reference buffer must be turned off if using an external reference. */

/* ADCCON[DMA] - DMA transfer enable bit. */
#define ADCCON_DMA_BBA                 (*(volatile unsigned long *) 0x42A00098)
#define ADCCON_DMA_MSK                 (0x1   << 6  )
#define ADCCON_DMA                     (0x1   << 6  )
#define ADCCON_DMA_DIS                 (0x0   << 6  ) /* DIS. Disable DMA transfer. */
#define ADCCON_DMA_EN                  (0x1   << 6  ) /* EN. Enable DMA transfer. */

/* ADCCON[IEN] - Interrupt enable. */
#define ADCCON_IEN_BBA                 (*(volatile unsigned long *) 0x42A00094)
#define ADCCON_IEN_MSK                 (0x1   << 5  )
#define ADCCON_IEN                     (0x1   << 5  )
#define ADCCON_IEN_DIS                 (0x0   << 5  ) /* DIS. Disable the ADC interrupt. */
#define ADCCON_IEN_EN                  (0x1   << 5  ) /* EN. Enable the ADC interrupt. An interrupt is generated when new data is available. */

/* ADCCON[ENABLE] - ADC enable. */
#define ADCCON_ENABLE_BBA              (*(volatile unsigned long *) 0x42A00090)
#define ADCCON_ENABLE_MSK              (0x1   << 4  )
#define ADCCON_ENABLE                  (0x1   << 4  )
#define ADCCON_ENABLE_EN               (0x0   << 4  ) /* EN. Enable the ADC.      */
#define ADCCON_ENABLE_DIS              (0x1   << 4  ) /* DIS. Disable the ADC.    */

/* ADCCON[MOD] - Conversion mode. */
#define ADCCON_MOD_MSK                 (0x7   << 1  )
#define ADCCON_MOD_SOFT                (0x0   << 1  ) /* SOFT. Software trigger, used in conjunction with the START bit. */
#define ADCCON_MOD_CONT                (0x1   << 1  ) /* CONT. Continuous convert mode. */
#define ADCCON_MOD_T0OVF               (0x3   << 1  ) /* T0OVF. Timer0 overflow.  */
#define ADCCON_MOD_T1OVF               (0x4   << 1  ) /* T1OVF. Timer1 overflow.  */
#define ADCCON_MOD_GPIO                (0x5   << 1  ) /* GPIO. ADC conversion triggered by P0.3 input. */

