contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* ADCCON[START] - ADC conversion start. */
#define ADCCON_START_BBA               (*(volatile unsigned long *) 0x42A00080)
#define ADCCON_START_MSK               (0x1   << 0  )
#define ADCCON_START                   (0x1   << 0  )
#define ADCCON_START_DIS               (0x0   << 0  ) /* DIS. Has no effect.      */
#define ADCCON_START_EN                (0x1   << 0  ) /* EN. Start conversion when SOFT conversion mode is selected. This bit does not clear after a single software conversion. */

/* Reset Value for ADCSTA*/
#define ADCSTA_RVAL                    0x0

/* ADCSTA[READY] - ADC Ready bit */
#define ADCSTA_READY_BBA               (*(volatile unsigned long *) 0x42A00100)
#define ADCSTA_READY_MSK               (0x1   << 0  )
#define ADCSTA_READY                   (0x1   << 0  )
#define ADCSTA_READY_CLR               (0x0   << 0  ) /* CLR. Cleared automatically when ADCDAT is read. */
#define ADCSTA_READY_EN                (0x1   << 0  ) /* EN. Set by the ADC when a conversion is complete. This bit generates an interrupt if enabled (IEN set in ADCCON). */

/* Reset Value for ADCDAT*/
#define ADCDAT_RVAL                    0x0

/* ADCDAT[VALUE] - ADC result */
#define ADCDAT_VALUE_MSK               (0xFFF << 2  )

/* ADCDAT[Value_Reserved] - ADC result / Reserved */
#define ADCDAT_Value_Reserved_MSK      (0x3   << 0  )

/* Reset Value for ADCGN*/
#define ADCGN_RVAL                     0x0

/* ADCGN[VALUE] - Gain */
#define ADCGN_VALUE_MSK                (0xFFFF << 0  )

/* Reset Value for ADCOF*/
#define ADCOF_RVAL                     0x0

/* ADCOF[VALUE] - Offset */
#define ADCOF_VALUE_MSK                (0xFFFF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        CLKCTL                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Clock Control (pADI_CLKCTL)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_CLKCTL Structure                  */
  __IO uint16_t  CLKCON;                    /*!< System Clocking Architecture Control Register */
  __I  uint16_t  RESERVED0[519];
  __IO uint8_t   XOSCCON;                   /*!< Crystal Oscillator Control Register   */
  __I  uint8_t   RESERVED1[111];
  __IO uint16_t  CLKACT;                    /*!< Clock in Active Mode Enable Register  */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  CLKPD;                     /*!< Clock in Power-Down Mode Enable Register */
} ADI_CLKCTL_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          CLKCON                                     (*(volatile unsigned short int *) 0x40002000)
#define          XOSCCON                                    (*(volatile unsigned char      *) 0x40002410)
#define          CLKACT                                     (*(volatile unsigned short int *) 0x40002480)
#define          CLKPD                                      (*(volatile unsigned short int *) 0x40002484)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for CLKCON*/
#define CLKCON_RVAL                    0x0

/* CLKCON[CLKOUT] - GPIO output clock multiplexer select bits. */
#define CLKCON_CLKOUT_MSK              (0x7   << 5  )
#define CLKCON_CLKOUT_UCLKCG           (0x0   << 5  ) /* UCLKCG.                  */
#define CLKCON_CLKOUT_UCLK             (0x1   << 5  ) /* UCLK.                    */
#define CLKCON_CLKOUT_PCLK             (0x2   << 5  ) /* PCLK.                    */
#define CLKCON_CLKOUT_HFOSC            (0x5   << 5  ) /* HFOSC.                   */
#define CLKCON_CLKOUT_LFOSC            (0x6   << 5  ) /* LFOSC.                   */
#define CLKCON_CLKOUT_LFXTAL           (0x7   << 5  ) /* LFXTAL.                  */

/* CLKCON[CLKMUX] - Digital subsystem clock source select bits. */
#define CLKCON_CLKMUX_MSK              (0x3   << 3  )
#define CLKCON_CLKMUX_HFOSC            (0x0   << 3  ) /* HFOSC. 16MHz internal oscillator. */
#define CLKCON_CLKMUX_LFXTAL           (0x1   << 3  ) /* LFXTAL. 32.768kHz external crystal. */
#define CLKCON_CLKMUX_LFOSC            (0x2   << 3  ) /* LFOSC. 32.768kHz internal oscillator. */
#define CLKCON_CLKMUX_ECLKIN           (0x3   << 3  ) /* ECLKIN. External clock on P0.5. */

/* CLKCON[CD] - Clock divide bits. */
#define CLKCON_CD_MSK                  (0x7   << 0  )
#define CLKCON_CD_DIV1                 (0x0   << 0  ) /* DIV1.                    */
#define CLKCON_CD_DIV2                 (0x1   << 0  ) /* DIV2.                    */
#define CLKCON_CD_DIV4                 (0x2   << 0  ) /* DIV4.                    */
#define CLKCON_CD_DIV8                 (0x3   << 0  ) /* DIV8.                    */
#define CLKCON_CD_DIV16                (0x4   << 0  ) /* DIV16.                   */
#define CLKCON_CD_DIV32                (0x5   << 0  ) /* DIV32.                   */
#define CLKCON_CD_DIV64                (0x6   << 0  ) /* DIV64.                   */
#define CLKCON_CD_DIV128               (0x7   << 0  ) /* DIV128.                  */

/* Reset Value for XOSCCON*/
#define XOSCCON_RVAL                   0x0

/* XOSCCON[ENABLE] - Crystal oscillator circuit enable bit. */
#define XOSCCON_ENABLE_BBA             (*(volatile unsigned long *) 0x42048200)
#define XOSCCON_ENABLE_MSK             (0x1   << 0  )
#define XOSCCON_ENABLE                 (0x1   << 0  )
#define XOSCCON_ENABLE_DIS             (0x0   << 0  ) /* DIS. Disables the watch crystal circuitry.(LFXTAL) */
#define XOSCCON_ENABLE_EN              (0x1   << 0  ) /* EN. Enables the watch crystal circuitry.(LFXTAL) */

/* Reset Value for CLKACT*/
#define CLKACT_RVAL                    0x3FFF

/* CLKACT[T1] - T1 clocks enable bit. */
#define CLKACT_T1_BBA                  (*(volatile unsigned long *) 0x4204902C)
#define CLKACT_T1_MSK                  (0x1   << 11 )
#define CLKACT_T1                      (0x1   << 11 )
#define CLKACT_T1_DIS                  (0x0   << 11 ) /* DIS. Disable T1 clocks.  */
#define CLKACT_T1_EN                   (0x1   << 11 ) /* EN. Enable T1 clocks.    */

/* CLKACT[T0] - T0 clocks enable bit. */
#define CLKACT_T0_BBA                  (*(volatile unsigned long *) 0x42049028)
#define CLKACT_T0_MSK                  (0x1   << 10 )
#define CLKACT_T0                      (0x1   << 10 )
#define CLKACT_T0_DIS                  (0x0   << 10 ) /* DIS. Disable T0 clocks.  */
#define CLKACT_T0_EN                   (0x1   << 10 ) /* EN. Enable T0 clocks.    */

/* CLKACT[PWM] - PWM clocks enable bit. */
#define CLKACT_PWM_BBA                 (*(volatile unsigned long *) 0x42049024)
#define CLKACT_PWM_MSK                 (0x1   << 9  )
#define CLKACT_PWM                     (0x1   << 9  )
#define CLKACT_PWM_DIS                 (0x0   << 9  ) /* DIS. Disable PWM clocks. */
#define CLKACT_PWM_EN                  (0x1   << 9  ) /* EN. Enable PWM clocks.   */

/* CLKACT[I2C] - I2C clocks enable bit. */
#define CLKACT_I2C_BBA                 (*(volatile unsigned long *) 0x42049020)
#define CLKACT_I2C_MSK                 (0x1   << 8  )
#define CLKACT_I2C                     (0x1   << 8  )
#define CLKACT_I2C_DIS                 (0x0   << 8  ) /* DIS. Disable I2C clocks. */
#define CLKACT_I2C_EN                  (0x1   << 8  ) /* EN. Enable I2C clocks.   */

/* CLKACT[COM] - UART clocks enable bit. */
#define CLKACT_COM_BBA                 (*(volatile unsigned long *) 0x4204901C)
#define CLKACT_COM_MSK                 (0x1   << 7  )
#define CLKACT_COM                     (0x1   << 7  )
#define CLKACT_COM_DIS                 (0x0   << 7  ) /* DIS. Disable UART clocks. */
#define CLKACT_COM_EN                  (0x1   << 7  ) /* EN. Enable UART clocks.  */

/* CLKACT[SPI1] - SPI1 clocks enable bit. */
#define CLKACT_SPI1_BBA                (*(volatile unsigned long *) 0x42049018)
#define CLKACT_SPI1_MSK                (0x1   << 6  )
#define CLKACT_SPI1                    (0x1   << 6  )
#define CLKACT_SPI1_DIS                (0x0   << 6  ) /* DIS. Disable SPI1 clocks. */
#define CLKACT_SPI1_EN                 (0x1   << 6  ) /* EN. Enable SPI1 clocks.  */

/* CLKACT[SPI0] - SPI0 clocks enable bit. */
#define CLKACT_SPI0_BBA                (*(volatile unsigned long *) 0x42049014)
#define CLKACT_SPI0_MSK                (0x1   << 5  )
#define CLKACT_SPI0                    (0x1   << 5  )
#define CLKACT_SPI0_DIS                (0x0   << 5  ) /* DIS. Disable SPI0 clocks. */
#define CLKACT_SPI0_EN                 (0x1   << 5  ) /* EN. Enable SPI0 clocks.  */

/* CLKACT[T2] - T2 clocks enable bit. */
#define CLKACT_T2_BBA                  (*(volatile unsigned long *) 0x42049010)
#define CLKACT_T2_MSK                  (0x1   << 4  )
#define CLKACT_T2                      (0x1   << 4  )
#define CLKACT_T2_DIS                  (0x0   << 4  ) /* DIS. Disable T2 clocks.  */
#define CLKACT_T2_EN                   (0x1   << 4  ) /* EN. Enable T2 clocks.    */

/* CLKACT[ADC] - ADC clocks enable bit. */
#define CLKACT_ADC_BBA                 (*(volatile unsigned long *) 0x4204900C)
#define CLKACT_ADC_MSK                 (0x1   << 3  )
#define CLKACT_ADC                     (0x1   << 3  )
#define CLKACT_ADC_DIS                 (0x0   << 3  ) /* DIS. Disable ADC clocks. */
#define CLKACT_ADC_EN                  (0x1   << 3  ) /* EN. Enable ADC clocks.   */

