contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* CLKACT[SRAM] - SRAM clocks enable bit. */
#define CLKACT_SRAM_BBA                (*(volatile unsigned long *) 0x42049008)
#define CLKACT_SRAM_MSK                (0x1   << 2  )
#define CLKACT_SRAM                    (0x1   << 2  )
#define CLKACT_SRAM_DIS                (0x0   << 2  ) /* DIS. Disable SRAM memory clocks. */
#define CLKACT_SRAM_EN                 (0x1   << 2  ) /* EN. Enable SRAM memory clocks. */

/* CLKACT[FEE] - Flash clocks enable bit. */
#define CLKACT_FEE_BBA                 (*(volatile unsigned long *) 0x42049004)
#define CLKACT_FEE_MSK                 (0x1   << 1  )
#define CLKACT_FEE                     (0x1   << 1  )
#define CLKACT_FEE_DIS                 (0x0   << 1  ) /* DIS. Disable Flash memory clocks. */
#define CLKACT_FEE_EN                  (0x1   << 1  ) /* EN. Enable Flash memory clocks. */

/* CLKACT[DMA] - DMA clock enable bit. */
#define CLKACT_DMA_BBA                 (*(volatile unsigned long *) 0x42049000)
#define CLKACT_DMA_MSK                 (0x1   << 0  )
#define CLKACT_DMA                     (0x1   << 0  )
#define CLKACT_DMA_DIS                 (0x0   << 0  ) /* DIS.Disable DMA clock.   */
#define CLKACT_DMA_EN                  (0x1   << 0  ) /* EN. Enable DMA clock.    */

/* Reset Value for CLKPD*/
#define CLKPD_RVAL                     0x3FFF

/* CLKPD[T1] - T1 clocks enable bit. */
#define CLKPD_T1_BBA                   (*(volatile unsigned long *) 0x420490AC)
#define CLKPD_T1_MSK                   (0x1   << 11 )
#define CLKPD_T1                       (0x1   << 11 )
#define CLKPD_T1_DIS                   (0x0   << 11 ) /* DIS. Disable T1 clocks.  */
#define CLKPD_T1_EN                    (0x1   << 11 ) /* EN. Enable T1 clocks.    */

/* CLKPD[T0] - T0 clocks enable bit. */
#define CLKPD_T0_BBA                   (*(volatile unsigned long *) 0x420490A8)
#define CLKPD_T0_MSK                   (0x1   << 10 )
#define CLKPD_T0                       (0x1   << 10 )
#define CLKPD_T0_DIS                   (0x0   << 10 ) /* DIS. Disable T0 clocks.  */
#define CLKPD_T0_EN                    (0x1   << 10 ) /* EN. Enable T0 clocks.    */

/* CLKPD[PWM] - PWM clocks enable bit. */
#define CLKPD_PWM_BBA                  (*(volatile unsigned long *) 0x420490A4)
#define CLKPD_PWM_MSK                  (0x1   << 9  )
#define CLKPD_PWM                      (0x1   << 9  )
#define CLKPD_PWM_DIS                  (0x0   << 9  ) /* DIS. Disable PWM clocks. */
#define CLKPD_PWM_EN                   (0x1   << 9  ) /* EN. Enable PWM clocks.   */

/* CLKPD[I2C] - I2C clocks enable bit. */
#define CLKPD_I2C_BBA                  (*(volatile unsigned long *) 0x420490A0)
#define CLKPD_I2C_MSK                  (0x1   << 8  )
#define CLKPD_I2C                      (0x1   << 8  )
#define CLKPD_I2C_DIS                  (0x0   << 8  ) /* DIS. Disable I2C clocks. */
#define CLKPD_I2C_EN                   (0x1   << 8  ) /* EN. Enable I2C clocks.   */

/* CLKPD[COM] - UART clocks enable bit. */
#define CLKPD_COM_BBA                  (*(volatile unsigned long *) 0x4204909C)
#define CLKPD_COM_MSK                  (0x1   << 7  )
#define CLKPD_COM                      (0x1   << 7  )
#define CLKPD_COM_DIS                  (0x0   << 7  ) /* DIS. Disable UART clocks. */
#define CLKPD_COM_EN                   (0x1   << 7  ) /* EN. Enable UART clocks.  */

/* CLKPD[SPI1] - SPI1 clocks enable bit. */
#define CLKPD_SPI1_BBA                 (*(volatile unsigned long *) 0x42049098)
#define CLKPD_SPI1_MSK                 (0x1   << 6  )
#define CLKPD_SPI1                     (0x1   << 6  )
#define CLKPD_SPI1_DIS                 (0x0   << 6  ) /* DIS. Disable SPI1 clocks. */
#define CLKPD_SPI1_EN                  (0x1   << 6  ) /* EN. Enable SPI1 clocks.  */

/* CLKPD[SPI0] - SPI0 clocks enable bit. */
#define CLKPD_SPI0_BBA                 (*(volatile unsigned long *) 0x42049094)
#define CLKPD_SPI0_MSK                 (0x1   << 5  )
#define CLKPD_SPI0                     (0x1   << 5  )
#define CLKPD_SPI0_DIS                 (0x0   << 5  ) /* DIS. Disable SPI0 clocks. */
#define CLKPD_SPI0_EN                  (0x1   << 5  ) /* EN. Enable SPI0 clocks.  */

/* CLKPD[T2] - T2 clocks enable bit. */
#define CLKPD_T2_BBA                   (*(volatile unsigned long *) 0x42049090)
#define CLKPD_T2_MSK                   (0x1   << 4  )
#define CLKPD_T2                       (0x1   << 4  )
#define CLKPD_T2_DIS                   (0x0   << 4  ) /* DIS. Disable T2 clocks.  */
#define CLKPD_T2_EN                    (0x1   << 4  ) /* EN. Enable T2 clocks.    */

/* CLKPD[ADC] - ADC clocks enable bit. */
#define CLKPD_ADC_BBA                  (*(volatile unsigned long *) 0x4204908C)
#define CLKPD_ADC_MSK                  (0x1   << 3  )
#define CLKPD_ADC                      (0x1   << 3  )
#define CLKPD_ADC_DIS                  (0x0   << 3  ) /* DIS. Disable ADC clocks. */
#define CLKPD_ADC_EN                   (0x1   << 3  ) /* EN. Enable ADC clocks.   */

/* CLKPD[SRAM] - SRAM clocks enable bit. */
#define CLKPD_SRAM_BBA                 (*(volatile unsigned long *) 0x42049088)
#define CLKPD_SRAM_MSK                 (0x1   << 2  )
#define CLKPD_SRAM                     (0x1   << 2  )
#define CLKPD_SRAM_DIS                 (0x0   << 2  ) /* DIS. Disable SRAM memory clocks. */
#define CLKPD_SRAM_EN                  (0x1   << 2  ) /* EN. Enable SRAM memory clocks. */

/* CLKPD[FEE] - Flash clocks enable bit. */
#define CLKPD_FEE_BBA                  (*(volatile unsigned long *) 0x42049084)
#define CLKPD_FEE_MSK                  (0x1   << 1  )
#define CLKPD_FEE                      (0x1   << 1  )
#define CLKPD_FEE_DIS                  (0x0   << 1  ) /* DIS. Disable Flash memory clocks. */
#define CLKPD_FEE_EN                   (0x1   << 1  ) /* EN. Enable Flash memory clocks. */

/* CLKPD[DMA] - DMA clock enable bit. */
#define CLKPD_DMA_BBA                  (*(volatile unsigned long *) 0x42049080)
#define CLKPD_DMA_MSK                  (0x1   << 0  )
#define CLKPD_DMA                      (0x1   << 0  )
#define CLKPD_DMA_DIS                  (0x0   << 0  ) /* DIS. Disable DMA clock.  */
#define CLKPD_DMA_EN                   (0x1   << 0  ) /* EN. Enable DMA clock.    */
// ------------------------------------------------------------------------------------------------
// -----                                        DMA                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Direct Memory Access (pADI_DMA)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_DMA Structure                     */
  __IO uint32_t  DMASTA;                    /*!< Status Register                       */
  __IO uint32_t  DMACFG;                    /*!< Configuration Register                */
  __IO uint32_t  DMAPDBPTR;                 /*!< Primary Control Database Pointer Register */
  __IO uint32_t  DMAADBPTR;                 /*!< Alternate Control Database Pointer Register */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  DMASWREQ;                  /*!< Channel Software Request Register     */
  __I  uint32_t  RESERVED1[2];
  __IO uint32_t  DMARMSKSET;                /*!< Channel Request Mask Set Register     */
  __IO uint32_t  DMARMSKCLR;                /*!< Channel Request Mask Clear Register   */
  __IO uint32_t  DMAENSET;                  /*!< Channel Enable Set Register           */
  __IO uint32_t  DMAENCLR;                  /*!< Channel Enable Clear Register         */
  __IO uint32_t  DMAALTSET;                 /*!< Channel Primary-Alternate Set Register */
  __IO uint32_t  DMAALTCLR;                 /*!< Channel Primary-Alternate Clear Register */
  __IO uint32_t  DMAPRISET;                 /*!< Channel Priority Set Register         */
  __IO uint32_t  DMAPRICLR;                 /*!< Channel Priority Clear Register       */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  DMAERRCLR;                 /*!< Bus Error Clear Register              */
} ADI_DMA_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          DMASTA                                     (*(volatile unsigned long      *) 0x40010000)
#define          DMACFG                                     (*(volatile unsigned long      *) 0x40010004)
#define          DMAPDBPTR                                  (*(volatile unsigned long      *) 0x40010008)
#define          DMAADBPTR                                  (*(volatile unsigned long      *) 0x4001000C)
#define          DMASWREQ                                   (*(volatile unsigned long      *) 0x40010014)
#define          DMARMSKSET                                 (*(volatile unsigned long      *) 0x40010020)
#define          DMARMSKCLR                                 (*(volatile unsigned long      *) 0x40010024)
#define          DMAENSET                                   (*(volatile unsigned long      *) 0x40010028)
#define          DMAENCLR                                   (*(volatile unsigned long      *) 0x4001002C)
#define          DMAALTSET                                  (*(volatile unsigned long      *) 0x40010030)
#define          DMAALTCLR                                  (*(volatile unsigned long      *) 0x40010034)
#define          DMAPRISET                                  (*(volatile unsigned long      *) 0x40010038)
#define          DMAPRICLR                                  (*(volatile unsigned long      *) 0x4001003C)
#define          DMAERRCLR                                  (*(volatile unsigned long      *) 0x4001004C)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for DMASTA*/
#define DMASTA_RVAL                    0xD0000

