contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* DMASTA[CHNLSMINUS1] - Number of available DMA channels minus 1. For example, if there are 14 channels available, the register reads back 0xD for these bits. */
#define DMASTA_CHNLSMINUS1_MSK         (0x1F  << 16 )
#define DMASTA_CHNLSMINUS1_FOURTEENCHNLS (0xD   << 16 ) /* FOURTEENCHNLS - Controller configured to use 14 DMA channels. */

/* DMASTA[STATE] - Current state of DMA controller state machine.  Provides insight into the operation performed by the DMA at the time this register is read. */
#define DMASTA_STATE_MSK               (0xF   << 4  )
#define DMASTA_STATE_IDLE              (0x0   << 4  ) /* IDL. Idle.               */
#define DMASTA_STATE_RDCHNLDATA        (0x1   << 4  ) /* RDCHNLDATA. Reading channel controller data. */
#define DMASTA_STATE_RDSRCENDPTR       (0x2   << 4  ) /* RDSRCENDPTR. Reading source data end pointer. */
#define DMASTA_STATE_RDDSTENDPTR       (0x3   << 4  ) /* RDDSTENDPTR. Reading destination end pointer. */
#define DMASTA_STATE_RDSRCDATA         (0x4   << 4  ) /* RDSRCDATA. Reading source data. */
#define DMASTA_STATE_WRDSTDATA         (0x5   << 4  ) /* WRDSTDATA. Writing destination data. */
#define DMASTA_STATE_WAITDMAREQCLR     (0x6   << 4  ) /* WAITDMAREQCLR. Waiting for DMA request to clear. */
#define DMASTA_STATE_WRCHNLDATA        (0x7   << 4  ) /* WRCHNLDATA. Writing channel controller data. */
#define DMASTA_STATE_STALLED           (0x8   << 4  ) /* STALLED. Stalled.        */
#define DMASTA_STATE_DONE              (0x9   << 4  ) /* DONE. Done.              */
#define DMASTA_STATE_SCATRGATHR        (0xA   << 4  ) /* SCATRGATHR. Peripheral scatter-gather transition. */

/* DMASTA[ENABLE] - Enable status of the controller. */
#define DMASTA_ENABLE_BBA              (*(volatile unsigned long *) 0x42200000)
#define DMASTA_ENABLE_MSK              (0x1   << 0  )
#define DMASTA_ENABLE                  (0x1   << 0  )
#define DMASTA_ENABLE_CLR              (0x0   << 0  ) /* CLR. Controller is disabled. */
#define DMASTA_ENABLE_SET              (0x1   << 0  ) /* SET. Controller is enabled. */

/* Reset Value for DMACFG*/
#define DMACFG_RVAL                    0x0

/* DMACFG[ENABLE] - Controller enable. */
#define DMACFG_ENABLE_BBA              (*(volatile unsigned long *) 0x42200080)
#define DMACFG_ENABLE_MSK              (0x1   << 0  )
#define DMACFG_ENABLE                  (0x1   << 0  )
#define DMACFG_ENABLE_DIS              (0x0   << 0  ) /* DIS. Controller is disabled. */
#define DMACFG_ENABLE_EN               (0x1   << 0  ) /* EN. Controller is enabled. */

/* Reset Value for DMAPDBPTR*/
#define DMAPDBPTR_RVAL                 0x0

/* DMAPDBPTR[CTRLBASEPTR] - Pointer to the base address of the primary data structure. 5 + log (2)M LSBs are reserved and must be written 0. M is the number of channels. */
#define DMAPDBPTR_CTRLBASEPTR_MSK      (0xFFFFFFFF << 0  )

/* Reset Value for DMAADBPTR*/
#define DMAADBPTR_RVAL                 0x100

/* DMAADBPTR[ALTCBPTR] - Base address of the alternate data structure. */
#define DMAADBPTR_ALTCBPTR_MSK         (0xFFFFFFFF << 0  )

/* Reset Value for DMASWREQ*/
#define DMASWREQ_RVAL                  0x0

/* DMASWREQ[SPI0RX] - DMA SPI0 RX. */
#define DMASWREQ_SPI0RX_BBA            (*(volatile unsigned long *) 0x422002B4)
#define DMASWREQ_SPI0RX_MSK            (0x1   << 13 )
#define DMASWREQ_SPI0RX                (0x1   << 13 )
#define DMASWREQ_SPI0RX_DIS            (0x0   << 13 ) /* DIS. Does not create a DMA request for SPI0RX. */
#define DMASWREQ_SPI0RX_EN             (0x1   << 13 ) /* EN. Generates a DMA request for SPI0RX. */

/* DMASWREQ[SPI0TX] - DMA SPI0 TX. */
#define DMASWREQ_SPI0TX_BBA            (*(volatile unsigned long *) 0x422002B0)
#define DMASWREQ_SPI0TX_MSK            (0x1   << 12 )
#define DMASWREQ_SPI0TX                (0x1   << 12 )
#define DMASWREQ_SPI0TX_DIS            (0x0   << 12 ) /* DIS.  Does not create a DMA request for SPI0TX. */
#define DMASWREQ_SPI0TX_EN             (0x1   << 12 ) /* EN. Generates a DMA request for SPI0TX. */

/* DMASWREQ[ADC] - DMA ADC. */
#define DMASWREQ_ADC_BBA               (*(volatile unsigned long *) 0x422002AC)
#define DMASWREQ_ADC_MSK               (0x1   << 11 )
#define DMASWREQ_ADC                   (0x1   << 11 )
#define DMASWREQ_ADC_DIS               (0x0   << 11 ) /* DIS. Does not create a DMA request for ADC. */
#define DMASWREQ_ADC_EN                (0x1   << 11 ) /* EN. Generates a DMA request for ADC. */

/* DMASWREQ[I2CMRX] - DMA I2C Master RX. */
#define DMASWREQ_I2CMRX_BBA            (*(volatile unsigned long *) 0x4220029C)
#define DMASWREQ_I2CMRX_MSK            (0x1   << 7  )
#define DMASWREQ_I2CMRX                (0x1   << 7  )
#define DMASWREQ_I2CMRX_DIS            (0x0   << 7  ) /* DIS. Does not create a DMA request for I2CMRX. */
#define DMASWREQ_I2CMRX_EN             (0x1   << 7  ) /* EN. Generates a DMA request for I2CMRX. */

/* DMASWREQ[I2CMTX] - DMA I2C Master TX. */
#define DMASWREQ_I2CMTX_BBA            (*(volatile unsigned long *) 0x42200298)
#define DMASWREQ_I2CMTX_MSK            (0x1   << 6  )
#define DMASWREQ_I2CMTX                (0x1   << 6  )
#define DMASWREQ_I2CMTX_DIS            (0x0   << 6  ) /* DIS. Does not create a DMA request for I2CMTX. */
#define DMASWREQ_I2CMTX_EN             (0x1   << 6  ) /* EN. Generates a DMA request for I2CMTX. */

/* DMASWREQ[I2CSRX] - DMA I2C Slave RX. */
#define DMASWREQ_I2CSRX_BBA            (*(volatile unsigned long *) 0x42200294)
#define DMASWREQ_I2CSRX_MSK            (0x1   << 5  )
#define DMASWREQ_I2CSRX                (0x1   << 5  )
#define DMASWREQ_I2CSRX_DIS            (0x0   << 5  ) /* DIS. Does not create a DMA request for I2CSRX. */
#define DMASWREQ_I2CSRX_EN             (0x1   << 5  ) /* EN. Generates a DMA request for I2CSRX. */

/* DMASWREQ[I2CSTX] - DMA I2C Slave TX. */
#define DMASWREQ_I2CSTX_BBA            (*(volatile unsigned long *) 0x42200290)
#define DMASWREQ_I2CSTX_MSK            (0x1   << 4  )
#define DMASWREQ_I2CSTX                (0x1   << 4  )
#define DMASWREQ_I2CSTX_DIS            (0x0   << 4  ) /* DIS. Does not create a DMA request for I2CSTX. */
#define DMASWREQ_I2CSTX_EN             (0x1   << 4  ) /* EN. Generates a DMA request for I2CSTX. */

/* DMASWREQ[UARTRX] - DMA UART RX. */
#define DMASWREQ_UARTRX_BBA            (*(volatile unsigned long *) 0x4220028C)
#define DMASWREQ_UARTRX_MSK            (0x1   << 3  )
#define DMASWREQ_UARTRX                (0x1   << 3  )
#define DMASWREQ_UARTRX_DIS            (0x0   << 3  ) /* DIS. Does not create a DMA request for UARTRX. */
#define DMASWREQ_UARTRX_EN             (0x1   << 3  ) /* EN. Generates a DMA request for UARTRX. */

/* DMASWREQ[UARTTX] - DMA UART TX. */
#define DMASWREQ_UARTTX_BBA            (*(volatile unsigned long *) 0x42200288)
#define DMASWREQ_UARTTX_MSK            (0x1   << 2  )
#define DMASWREQ_UARTTX                (0x1   << 2  )
#define DMASWREQ_UARTTX_DIS            (0x0   << 2  ) /* DIS.  Does not create a DMA request for UARTTX. */
#define DMASWREQ_UARTTX_EN             (0x1   << 2  ) /* EN. Generates a DMA request for UARTTX. */

/* DMASWREQ[SPI1RX] - DMA SPI 1 RX. */
#define DMASWREQ_SPI1RX_BBA            (*(volatile unsigned long *) 0x42200284)
#define DMASWREQ_SPI1RX_MSK            (0x1   << 1  )
#define DMASWREQ_SPI1RX                (0x1   << 1  )
#define DMASWREQ_SPI1RX_DIS            (0x0   << 1  ) /* DIS.  Does not create a DMA request for SPI1RX. */
#define DMASWREQ_SPI1RX_EN             (0x1   << 1  ) /* EN. Generates a DMA request for SPI1RX. */

/* DMASWREQ[SPI1TX] - DMA SPI 1 TX. */
#define DMASWREQ_SPI1TX_BBA            (*(volatile unsigned long *) 0x42200280)
#define DMASWREQ_SPI1TX_MSK            (0x1   << 0  )
#define DMASWREQ_SPI1TX                (0x1   << 0  )
#define DMASWREQ_SPI1TX_DIS            (0x0   << 0  ) /* DIS. Does not create a DMA request for SPI1TX. */
#define DMASWREQ_SPI1TX_EN             (0x1   << 0  ) /* EN. Generates a DMA request for SPI1TX. */

/* Reset Value for DMARMSKSET*/
#define DMARMSKSET_RVAL                0x0

/* DMARMSKSET[SPI0RX] - DMA SPI0 RX. */
#define DMARMSKSET_SPI0RX_BBA          (*(volatile unsigned long *) 0x42200434)
#define DMARMSKSET_SPI0RX_MSK          (0x1   << 13 )
#define DMARMSKSET_SPI0RX              (0x1   << 13 )
#define DMARMSKSET_SPI0RX_DIS          (0x0   << 13 ) /* DIS. When read: Requests are enabled for SPI0RX. When written: No effect. Use the DMARMSKCLR register to enable DMA requests. */
#define DMARMSKSET_SPI0RX_EN           (0x1   << 13 ) /* EN. When read: Requests are disabled for SPI0RX. When written: Disables peripheral associated with SPI0RX from generating DMA requests. */

/* DMARMSKSET[SPI0TX] - DMA SPI0 TX. */
#define DMARMSKSET_SPI0TX_BBA          (*(volatile unsigned long *) 0x42200430)
#define DMARMSKSET_SPI0TX_MSK          (0x1   << 12 )
#define DMARMSKSET_SPI0TX              (0x1   << 12 )
#define DMARMSKSET_SPI0TX_DIS          (0x0   << 12 ) /* DIS. When read: Requests are enabled for SPI0TX. When written: No effect. Use the DMARMSKCLR register to enable DMA requests. */
#define DMARMSKSET_SPI0TX_EN           (0x1   << 12 ) /* EN.  When read: Requests are disabled for SPI0TX. When written: Disables peripheral associated with SPI0TX from generating DMA requests. */

/* DMARMSKSET[ADC] - DMA ADC. */
#define DMARMSKSET_ADC_BBA             (*(volatile unsigned long *) 0x4220042C)
#define DMARMSKSET_ADC_MSK             (0x1   << 11 )
#define DMARMSKSET_ADC                 (0x1   << 11 )
#define DMARMSKSET_ADC_DIS             (0x0   << 11 ) /* DIS. When read: Requests are enabled for ADC. When written: No effect. Use the DMARMSKCLR register to enable DMA requests. */
#define DMARMSKSET_ADC_EN              (0x1   << 11 ) /* EN.  When read: Requests are disabled for ADC. When written: Disables peripheral associated with ADC from generating DMA requests. */

/* DMARMSKSET[I2CMRX] - DMA I2C Master RX. */
#define DMARMSKSET_I2CMRX_BBA          (*(volatile unsigned long *) 0x4220041C)
#define DMARMSKSET_I2CMRX_MSK          (0x1   << 7  )
#define DMARMSKSET_I2CMRX              (0x1   << 7  )
#define DMARMSKSET_I2CMRX_DIS          (0x0   << 7  ) /* DIS. When read: Requests are enabled for I2CMRX. When written: No effect. Use the DMARMSKCLR register to enable DMA requests. */
#define DMARMSKSET_I2CMRX_EN           (0x1   << 7  ) /* EN.  When read: Requests are disabled for I2CMRX. When written: Disables peripheral associated with I2CMRX from generating DMA requests. */

