contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* DMARMSKSET[I2CMTX] - DMA I2C Master TX. */
#define DMARMSKSET_I2CMTX_BBA          (*(volatile unsigned long *) 0x42200418)
#define DMARMSKSET_I2CMTX_MSK          (0x1   << 6  )
#define DMARMSKSET_I2CMTX              (0x1   << 6  )
#define DMARMSKSET_I2CMTX_DIS          (0x0   << 6  ) /* DIS. When read: Requests are enabled for I2CMTX. When written: No effect. Use the DMARMSKCLR register to enable DMA requests. */
#define DMARMSKSET_I2CMTX_EN           (0x1   << 6  ) /* EN.  When read: Requests are disabled for I2CMTX. When written: Disables peripheral associated with I2CMTX from generating DMA requests. */

/* DMARMSKSET[I2CSRX] - DMA I2C Slave RX. */
#define DMARMSKSET_I2CSRX_BBA          (*(volatile unsigned long *) 0x42200414)
#define DMARMSKSET_I2CSRX_MSK          (0x1   << 5  )
#define DMARMSKSET_I2CSRX              (0x1   << 5  )
#define DMARMSKSET_I2CSRX_DIS          (0x0   << 5  ) /* DIS. When read: Requests are enabled for I2CSRX. When written: No effect. Use the DMARMSKCLR register to enable DMA requests. */
#define DMARMSKSET_I2CSRX_EN           (0x1   << 5  ) /* EN.  When read: Requests are disabled for I2CSRX. When written: Disables peripheral associated with I2CSRX from generating DMA requests. */

/* DMARMSKSET[I2CSTX] - DMA I2C Slave TX. */
#define DMARMSKSET_I2CSTX_BBA          (*(volatile unsigned long *) 0x42200410)
#define DMARMSKSET_I2CSTX_MSK          (0x1   << 4  )
#define DMARMSKSET_I2CSTX              (0x1   << 4  )
#define DMARMSKSET_I2CSTX_DIS          (0x0   << 4  ) /* DIS. When read: Requests are enabled forI2CSTX. When written: No effect. Use the DMARMSKCLR register to enable DMA requests. */
#define DMARMSKSET_I2CSTX_EN           (0x1   << 4  ) /* EN.  When read: Requests are disabled for I2CSTX. When written: Disables peripheral associated with I2CSTX from generating DMA requests. */

/* DMARMSKSET[UARTRX] - DMA UART RX. */
#define DMARMSKSET_UARTRX_BBA          (*(volatile unsigned long *) 0x4220040C)
#define DMARMSKSET_UARTRX_MSK          (0x1   << 3  )
#define DMARMSKSET_UARTRX              (0x1   << 3  )
#define DMARMSKSET_UARTRX_DIS          (0x0   << 3  ) /* DIS. When read: Requests are enabled for UARTRX. When written: No effect. Use the DMARMSKCLR register to enable DMA requests. */
#define DMARMSKSET_UARTRX_EN           (0x1   << 3  ) /* EN.  When read: Requests are disabled for UARTRX. When written: Disables peripheral associated with UARTRX from generating DMA requests. */

/* DMARMSKSET[UARTTX] - DMA UART TX. */
#define DMARMSKSET_UARTTX_BBA          (*(volatile unsigned long *) 0x42200408)
#define DMARMSKSET_UARTTX_MSK          (0x1   << 2  )
#define DMARMSKSET_UARTTX              (0x1   << 2  )
#define DMARMSKSET_UARTTX_DIS          (0x0   << 2  ) /* DIS. When read: Requests are enabled for UARTTX. When written: No effect. Use the DMARMSKCLR register to enable DMA requests. */
#define DMARMSKSET_UARTTX_EN           (0x1   << 2  ) /* EN.  When read: Requests are disabled for UARTTX. When written: Disables peripheral associated with UARTTX from generating DMA requests. */

/* DMARMSKSET[SPI1RX] - DMA SPI 1 RX. */
#define DMARMSKSET_SPI1RX_BBA          (*(volatile unsigned long *) 0x42200404)
#define DMARMSKSET_SPI1RX_MSK          (0x1   << 1  )
#define DMARMSKSET_SPI1RX              (0x1   << 1  )
#define DMARMSKSET_SPI1RX_DIS          (0x0   << 1  ) /* DIS. When read: Requests are enabled for SPI1RX. When written: No effect. Use the DMARMSKCLR register to enable DMA requests. */
#define DMARMSKSET_SPI1RX_EN           (0x1   << 1  ) /* EN.  When read: Requests are disabled for SPI1RX. When written: Disables peripheral associated with SPI1RX from generating DMA requests. */

/* DMARMSKSET[SPI1TX] - DMA SPI 1 TX. */
#define DMARMSKSET_SPI1TX_BBA          (*(volatile unsigned long *) 0x42200400)
#define DMARMSKSET_SPI1TX_MSK          (0x1   << 0  )
#define DMARMSKSET_SPI1TX              (0x1   << 0  )
#define DMARMSKSET_SPI1TX_DIS          (0x0   << 0  ) /* DIS. When read: Requests are enabled for SPI1TX. When written: No effect. Use the DMARMSKCLR register to enable DMA requests. */
#define DMARMSKSET_SPI1TX_EN           (0x1   << 0  ) /* EN.  When read: Requests are disabled for SPI1TX When written: Disables peripheral associated with SPI1TX from generating DMA requests. */

/* Reset Value for DMARMSKCLR*/
#define DMARMSKCLR_RVAL                0x0

/* DMARMSKCLR[SPI0RX] - DMA SPI0 RX. */
#define DMARMSKCLR_SPI0RX_BBA          (*(volatile unsigned long *) 0x422004B4)
#define DMARMSKCLR_SPI0RX_MSK          (0x1   << 13 )
#define DMARMSKCLR_SPI0RX              (0x1   << 13 )
#define DMARMSKCLR_SPI0RX_DIS          (0x0   << 13 ) /* DIS. No effect. Use the DMARMSKSET register to disable DMA requests. */
#define DMARMSKCLR_SPI0RX_EN           (0x1   << 13 ) /* EN. Enables peripheral associated with SPI0RX to generate DMA requests. */

/* DMARMSKCLR[SPI0TX] - DMA SPI0 TX. */
#define DMARMSKCLR_SPI0TX_BBA          (*(volatile unsigned long *) 0x422004B0)
#define DMARMSKCLR_SPI0TX_MSK          (0x1   << 12 )
#define DMARMSKCLR_SPI0TX              (0x1   << 12 )
#define DMARMSKCLR_SPI0TX_DIS          (0x0   << 12 ) /* DIS. No effect. Use the DMARMSKSET register to disable DMA requests. */
#define DMARMSKCLR_SPI0TX_EN           (0x1   << 12 ) /* EN. Enables peripheral associated with SPI0TX to generate DMA requests. */

/* DMARMSKCLR[ADC] - DMA ADC. */
#define DMARMSKCLR_ADC_BBA             (*(volatile unsigned long *) 0x422004AC)
#define DMARMSKCLR_ADC_MSK             (0x1   << 11 )
#define DMARMSKCLR_ADC                 (0x1   << 11 )
#define DMARMSKCLR_ADC_DIS             (0x0   << 11 ) /* DIS. No effect. Use the DMARMSKSET register to disable DMA requests. */
#define DMARMSKCLR_ADC_EN              (0x1   << 11 ) /* EN. Enables peripheral associated with ADC to generate DMA requests. */

/* DMARMSKCLR[I2CMRX] - DMA I2C Master RX. */
#define DMARMSKCLR_I2CMRX_BBA          (*(volatile unsigned long *) 0x4220049C)
#define DMARMSKCLR_I2CMRX_MSK          (0x1   << 7  )
#define DMARMSKCLR_I2CMRX              (0x1   << 7  )
#define DMARMSKCLR_I2CMRX_DIS          (0x0   << 7  ) /* DIS. No effect. Use the DMARMSKSET register to disable DMA requests. */
#define DMARMSKCLR_I2CMRX_EN           (0x1   << 7  ) /* EN. Enables peripheral associated with I2CMRX to generate DMA requests. */

/* DMARMSKCLR[I2CMTX] - DMA I2C Master TX. */
#define DMARMSKCLR_I2CMTX_BBA          (*(volatile unsigned long *) 0x42200498)
#define DMARMSKCLR_I2CMTX_MSK          (0x1   << 6  )
#define DMARMSKCLR_I2CMTX              (0x1   << 6  )
#define DMARMSKCLR_I2CMTX_DIS          (0x0   << 6  ) /* DIS. No effect. Use the DMARMSKSET register to disable DMA requests. */
#define DMARMSKCLR_I2CMTX_EN           (0x1   << 6  ) /* EN. Enables peripheral associated with I2CMTX to generate DMA requests. */

/* DMARMSKCLR[I2CSRX] - DMA I2C Slave RX. */
#define DMARMSKCLR_I2CSRX_BBA          (*(volatile unsigned long *) 0x42200494)
#define DMARMSKCLR_I2CSRX_MSK          (0x1   << 5  )
#define DMARMSKCLR_I2CSRX              (0x1   << 5  )
#define DMARMSKCLR_I2CSRX_DIS          (0x0   << 5  ) /* DIS. No effect. Use the DMARMSKSET register to disable DMA requests. */
#define DMARMSKCLR_I2CSRX_EN           (0x1   << 5  ) /* EN. Enables peripheral associated with I2CSRX to generate DMA requests. */

/* DMARMSKCLR[I2CSTX] - DMA I2C Slave TX. */
#define DMARMSKCLR_I2CSTX_BBA          (*(volatile unsigned long *) 0x42200490)
#define DMARMSKCLR_I2CSTX_MSK          (0x1   << 4  )
#define DMARMSKCLR_I2CSTX              (0x1   << 4  )
#define DMARMSKCLR_I2CSTX_DIS          (0x0   << 4  ) /* DIS. No effect. Use the DMARMSKSET register to disable DMA requests. */
#define DMARMSKCLR_I2CSTX_EN           (0x1   << 4  ) /* EN. Enables peripheral associated with I2CSTX to generate DMA requests. */

/* DMARMSKCLR[UARTRX] - DMA UART RX. */
#define DMARMSKCLR_UARTRX_BBA          (*(volatile unsigned long *) 0x4220048C)
#define DMARMSKCLR_UARTRX_MSK          (0x1   << 3  )
#define DMARMSKCLR_UARTRX              (0x1   << 3  )
#define DMARMSKCLR_UARTRX_DIS          (0x0   << 3  ) /* DIS. No effect. Use the DMARMSKSET register to disable DMA requests. */
#define DMARMSKCLR_UARTRX_EN           (0x1   << 3  ) /* EN. Enables peripheral associated with UARTRX to generate DMA requests. */

/* DMARMSKCLR[UARTTX] - DMA UART TX. */
#define DMARMSKCLR_UARTTX_BBA          (*(volatile unsigned long *) 0x42200488)
#define DMARMSKCLR_UARTTX_MSK          (0x1   << 2  )
#define DMARMSKCLR_UARTTX              (0x1   << 2  )
#define DMARMSKCLR_UARTTX_DIS          (0x0   << 2  ) /* DIS. No effect. Use the DMARMSKSET register to disable DMA requests. */
#define DMARMSKCLR_UARTTX_EN           (0x1   << 2  ) /* EN. Enables peripheral associated with UARTTX to generate DMA requests. */

/* DMARMSKCLR[SPI1RX] - DMA SPI 1 RX. */
#define DMARMSKCLR_SPI1RX_BBA          (*(volatile unsigned long *) 0x42200484)
#define DMARMSKCLR_SPI1RX_MSK          (0x1   << 1  )
#define DMARMSKCLR_SPI1RX              (0x1   << 1  )
#define DMARMSKCLR_SPI1RX_DIS          (0x0   << 1  ) /* DIS. No effect. Use the DMARMSKSET register to disable DMA requests. */
#define DMARMSKCLR_SPI1RX_EN           (0x1   << 1  ) /* EN. Enables peripheral associated with SPI1RX to generate DMA requests. */

