contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* DMARMSKCLR[SPI1TX] - DMA SPI 1 TX. */
#define DMARMSKCLR_SPI1TX_BBA          (*(volatile unsigned long *) 0x42200480)
#define DMARMSKCLR_SPI1TX_MSK          (0x1   << 0  )
#define DMARMSKCLR_SPI1TX              (0x1   << 0  )
#define DMARMSKCLR_SPI1TX_DIS          (0x0   << 0  ) /* DIS. No effect. Use the DMARMSKSET register to disable DMA requests. */
#define DMARMSKCLR_SPI1TX_EN           (0x1   << 0  ) /* EN. Enables peripheral associated with SPI1TX to generate DMA requests. */

/* Reset Value for DMAENSET*/
#define DMAENSET_RVAL                  0x0

/* DMAENSET[SPI0RX] - DMA SPI0 RX */
#define DMAENSET_SPI0RX_BBA            (*(volatile unsigned long *) 0x42200534)
#define DMAENSET_SPI0RX_MSK            (0x1   << 13 )
#define DMAENSET_SPI0RX                (0x1   << 13 )
#define DMAENSET_SPI0RX_DIS            (0x0   << 13 ) /* DIS. No effect. Use the DMAENCLR register to disable the channel. */
#define DMAENSET_SPI0RX_EN             (0x1   << 13 ) /* EN. Enables SPI0RX.      */

/* DMAENSET[SPI0TX] - DMA SPI0 TX. */
#define DMAENSET_SPI0TX_BBA            (*(volatile unsigned long *) 0x42200530)
#define DMAENSET_SPI0TX_MSK            (0x1   << 12 )
#define DMAENSET_SPI0TX                (0x1   << 12 )
#define DMAENSET_SPI0TX_DIS            (0x0   << 12 ) /* DIS. No effect. Use the DMAENCLR register to disable the channel. */
#define DMAENSET_SPI0TX_EN             (0x1   << 12 ) /* EN. Enables SPI0TX.      */

/* DMAENSET[ADC] - DMA ADC. */
#define DMAENSET_ADC_BBA               (*(volatile unsigned long *) 0x4220052C)
#define DMAENSET_ADC_MSK               (0x1   << 11 )
#define DMAENSET_ADC                   (0x1   << 11 )
#define DMAENSET_ADC_DIS               (0x0   << 11 ) /* DIS. No effect. Use the DMAENCLR register to disable the channel. */
#define DMAENSET_ADC_EN                (0x1   << 11 ) /* EN. Enables ADC.         */

/* DMAENSET[I2CMRX] - DMA I2C Master RX. */
#define DMAENSET_I2CMRX_BBA            (*(volatile unsigned long *) 0x4220051C)
#define DMAENSET_I2CMRX_MSK            (0x1   << 7  )
#define DMAENSET_I2CMRX                (0x1   << 7  )
#define DMAENSET_I2CMRX_DIS            (0x0   << 7  ) /* DIS. No effect. Use the DMAENCLR register to disable the channel. */
#define DMAENSET_I2CMRX_EN             (0x1   << 7  ) /* EN. . Enables I2CMRX.    */

/* DMAENSET[I2CMTX] - DMA I2C Master TX. */
#define DMAENSET_I2CMTX_BBA            (*(volatile unsigned long *) 0x42200518)
#define DMAENSET_I2CMTX_MSK            (0x1   << 6  )
#define DMAENSET_I2CMTX                (0x1   << 6  )
#define DMAENSET_I2CMTX_DIS            (0x0   << 6  ) /* DIS. No effect. Use the DMAENCLR register to disable the channel. */
#define DMAENSET_I2CMTX_EN             (0x1   << 6  ) /* EN. . Enables I2CMTX.    */

/* DMAENSET[I2CSRX] - DMA I2C Slave RX. */
#define DMAENSET_I2CSRX_BBA            (*(volatile unsigned long *) 0x42200514)
#define DMAENSET_I2CSRX_MSK            (0x1   << 5  )
#define DMAENSET_I2CSRX                (0x1   << 5  )
#define DMAENSET_I2CSRX_DIS            (0x0   << 5  ) /* DIS. No effect. Use the DMAENCLR register to disable the channel. */
#define DMAENSET_I2CSRX_EN             (0x1   << 5  ) /* EN. Enables I2CSRX.      */

/* DMAENSET[I2CSTX] - DMA I2C Slave TX. */
#define DMAENSET_I2CSTX_BBA            (*(volatile unsigned long *) 0x42200510)
#define DMAENSET_I2CSTX_MSK            (0x1   << 4  )
#define DMAENSET_I2CSTX                (0x1   << 4  )
#define DMAENSET_I2CSTX_DIS            (0x0   << 4  ) /* DIS. No effect. Use the DMAENCLR register to disable the channel. */
#define DMAENSET_I2CSTX_EN             (0x1   << 4  ) /* EN. Enables I2CSTX.      */

/* DMAENSET[UARTRX] - DMA UART RX. */
#define DMAENSET_UARTRX_BBA            (*(volatile unsigned long *) 0x4220050C)
#define DMAENSET_UARTRX_MSK            (0x1   << 3  )
#define DMAENSET_UARTRX                (0x1   << 3  )
#define DMAENSET_UARTRX_DIS            (0x0   << 3  ) /* DIS. No effect. Use the DMAENCLR register to disable the channel. */
#define DMAENSET_UARTRX_EN             (0x1   << 3  ) /* EN. Enables UARTRX.      */

/* DMAENSET[UARTTX] - DMA UART TX. */
#define DMAENSET_UARTTX_BBA            (*(volatile unsigned long *) 0x42200508)
#define DMAENSET_UARTTX_MSK            (0x1   << 2  )
#define DMAENSET_UARTTX                (0x1   << 2  )
#define DMAENSET_UARTTX_DIS            (0x0   << 2  ) /* DIS. No effect. Use the DMAENCLR register to disable the channel. */
#define DMAENSET_UARTTX_EN             (0x1   << 2  ) /* EN. Enables UARTTX.      */

/* DMAENSET[SPI1RX] - DMA SPI 1 RX. */
#define DMAENSET_SPI1RX_BBA            (*(volatile unsigned long *) 0x42200504)
#define DMAENSET_SPI1RX_MSK            (0x1   << 1  )
#define DMAENSET_SPI1RX                (0x1   << 1  )
#define DMAENSET_SPI1RX_DIS            (0x0   << 1  ) /* DIS. No effect. Use the DMAENCLR register to disable the channel. */
#define DMAENSET_SPI1RX_EN             (0x1   << 1  ) /* EN. Enables SPI1RX.      */

/* DMAENSET[SPI1TX] - DMA SPI 1 TX. */
#define DMAENSET_SPI1TX_BBA            (*(volatile unsigned long *) 0x42200500)
#define DMAENSET_SPI1TX_MSK            (0x1   << 0  )
#define DMAENSET_SPI1TX                (0x1   << 0  )
#define DMAENSET_SPI1TX_DIS            (0x0   << 0  ) /* DIS. No effect. Use the DMAENCLR register to disable the channel. */
#define DMAENSET_SPI1TX_EN             (0x1   << 0  ) /* EN. Enables SPI1TX.      */

/* Reset Value for DMAENCLR*/
#define DMAENCLR_RVAL                  0x0

/* DMAENCLR[SPI0RX] - DMA SPI0 RX */
#define DMAENCLR_SPI0RX_BBA            (*(volatile unsigned long *) 0x422005B4)
#define DMAENCLR_SPI0RX_MSK            (0x1   << 13 )
#define DMAENCLR_SPI0RX                (0x1   << 13 )
#define DMAENCLR_SPI0RX_DIS            (0x0   << 13 ) /* DIS. No effect. Use the DMAENSET register to enable the channel. */
#define DMAENCLR_SPI0RX_EN             (0x1   << 13 ) /* EN. Disables SPI0RX.     */

/* DMAENCLR[SPI0TX] - DMA SPI0 TX */
#define DMAENCLR_SPI0TX_BBA            (*(volatile unsigned long *) 0x422005B0)
#define DMAENCLR_SPI0TX_MSK            (0x1   << 12 )
#define DMAENCLR_SPI0TX                (0x1   << 12 )
#define DMAENCLR_SPI0TX_DIS            (0x0   << 12 ) /* DIS. No effect. Use the DMAENSET register to enable the channel. */
#define DMAENCLR_SPI0TX_EN             (0x1   << 12 ) /* EN. Disables SPI0TX.     */

/* DMAENCLR[ADC] - DMA ADC. */
#define DMAENCLR_ADC_BBA               (*(volatile unsigned long *) 0x422005AC)
#define DMAENCLR_ADC_MSK               (0x1   << 11 )
#define DMAENCLR_ADC                   (0x1   << 11 )
#define DMAENCLR_ADC_DIS               (0x0   << 11 ) /* DIS. No effect. Use the DMAENSET register to enable the channel. */
#define DMAENCLR_ADC_EN                (0x1   << 11 ) /* EN. Disables ADC.        */

/* DMAENCLR[I2CMRX] - DMA I2C Master RX. */
#define DMAENCLR_I2CMRX_BBA            (*(volatile unsigned long *) 0x4220059C)
#define DMAENCLR_I2CMRX_MSK            (0x1   << 7  )
#define DMAENCLR_I2CMRX                (0x1   << 7  )
#define DMAENCLR_I2CMRX_DIS            (0x0   << 7  ) /* DIS. No effect. Use the DMAENSET register to enable the channel. */
#define DMAENCLR_I2CMRX_EN             (0x1   << 7  ) /* EN. Disables I2CMRX.     */

/* DMAENCLR[I2CMTX] - DMA I2C Master TX. */
#define DMAENCLR_I2CMTX_BBA            (*(volatile unsigned long *) 0x42200598)
#define DMAENCLR_I2CMTX_MSK            (0x1   << 6  )
#define DMAENCLR_I2CMTX                (0x1   << 6  )
#define DMAENCLR_I2CMTX_DIS            (0x0   << 6  ) /* DIS. No effect. Use the DMAENSET register to enable the channel. */
#define DMAENCLR_I2CMTX_EN             (0x1   << 6  ) /* EN. Disables I2CMTX.     */

/* DMAENCLR[I2CSRX] - DMA I2C Slave RX. */
#define DMAENCLR_I2CSRX_BBA            (*(volatile unsigned long *) 0x42200594)
#define DMAENCLR_I2CSRX_MSK            (0x1   << 5  )
#define DMAENCLR_I2CSRX                (0x1   << 5  )
#define DMAENCLR_I2CSRX_DIS            (0x0   << 5  ) /* DIS. No effect. Use the DMAENSET register to enable the channel. */
#define DMAENCLR_I2CSRX_EN             (0x1   << 5  ) /* EN. Disables I2CSRX.     */

/* DMAENCLR[I2CSTX] - DMA I2C Slave TX. */
#define DMAENCLR_I2CSTX_BBA            (*(volatile unsigned long *) 0x42200590)
#define DMAENCLR_I2CSTX_MSK            (0x1   << 4  )
#define DMAENCLR_I2CSTX                (0x1   << 4  )
#define DMAENCLR_I2CSTX_DIS            (0x0   << 4  ) /* DIS. No effect. Use the DMAENSET register to enable the channel. */
#define DMAENCLR_I2CSTX_EN             (0x1   << 4  ) /* EN. Disables I2CSTX.     */

