contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* DMAENCLR[UARTRX] - DMA UART RX. */
#define DMAENCLR_UARTRX_BBA            (*(volatile unsigned long *) 0x4220058C)
#define DMAENCLR_UARTRX_MSK            (0x1   << 3  )
#define DMAENCLR_UARTRX                (0x1   << 3  )
#define DMAENCLR_UARTRX_DIS            (0x0   << 3  ) /* DIS. No effect. Use the DMAENSET register to enable the channel. */
#define DMAENCLR_UARTRX_EN             (0x1   << 3  ) /* EN. Disables UARTRX.     */

/* DMAENCLR[UARTTX] - DMA UART TX. */
#define DMAENCLR_UARTTX_BBA            (*(volatile unsigned long *) 0x42200588)
#define DMAENCLR_UARTTX_MSK            (0x1   << 2  )
#define DMAENCLR_UARTTX                (0x1   << 2  )
#define DMAENCLR_UARTTX_DIS            (0x0   << 2  ) /* DIS. No effect. Use the DMAENSET register to enable the channel. */
#define DMAENCLR_UARTTX_EN             (0x1   << 2  ) /* EN. Disables UARTTX.     */

/* DMAENCLR[SPI1RX] - DMA SPI 1 RX. */
#define DMAENCLR_SPI1RX_BBA            (*(volatile unsigned long *) 0x42200584)
#define DMAENCLR_SPI1RX_MSK            (0x1   << 1  )
#define DMAENCLR_SPI1RX                (0x1   << 1  )
#define DMAENCLR_SPI1RX_DIS            (0x0   << 1  ) /* DIS. No effect. Use the DMAENSET register to enable the channel. */
#define DMAENCLR_SPI1RX_EN             (0x1   << 1  ) /* EN. Disables SPI1RX.     */

/* DMAENCLR[SPI1TX] - DMA SPI 1 TX. */
#define DMAENCLR_SPI1TX_BBA            (*(volatile unsigned long *) 0x42200580)
#define DMAENCLR_SPI1TX_MSK            (0x1   << 0  )
#define DMAENCLR_SPI1TX                (0x1   << 0  )
#define DMAENCLR_SPI1TX_DIS            (0x0   << 0  ) /* DIS. No effect. Use the DMAENSET register to enable the channel. */
#define DMAENCLR_SPI1TX_EN             (0x1   << 0  ) /* EN. Disables SPI1TX.     */

/* Reset Value for DMAALTSET*/
#define DMAALTSET_RVAL                 0x0

/* DMAALTSET[SPI0RX] - DMA SPI0 RX. */
#define DMAALTSET_SPI0RX_BBA           (*(volatile unsigned long *) 0x42200634)
#define DMAALTSET_SPI0RX_MSK           (0x1   << 13 )
#define DMAALTSET_SPI0RX               (0x1   << 13 )
#define DMAALTSET_SPI0RX_DIS           (0x0   << 13 ) /* DIS. When read: DMA SPI0RX is using the primary data structure. When written: No effect. Use the DMAALTCLR register to set SPI0RX to 0. */
#define DMAALTSET_SPI0RX_EN            (0x1   << 13 ) /* EN. When read: DMA SPI0RX is using the alternate data structure. When written: Selects the alternate data structure for SPI0RX. */

/* DMAALTSET[SPI0TX] - DMA SPI0 TX. */
#define DMAALTSET_SPI0TX_BBA           (*(volatile unsigned long *) 0x42200630)
#define DMAALTSET_SPI0TX_MSK           (0x1   << 12 )
#define DMAALTSET_SPI0TX               (0x1   << 12 )
#define DMAALTSET_SPI0TX_DIS           (0x0   << 12 ) /* DIS. When read: DMA SPI0TX is using the primary data structure. When written: No effect. Use the DMAALTCLR register to set SPI0TX to 0. */
#define DMAALTSET_SPI0TX_EN            (0x1   << 12 ) /* EN. When read: DMA SPI0TX is using the alternate data structure. When written: Selects the alternate data structure for SPI0TX. */

/* DMAALTSET[ADC] - DMA ADC. */
#define DMAALTSET_ADC_BBA              (*(volatile unsigned long *) 0x4220062C)
#define DMAALTSET_ADC_MSK              (0x1   << 11 )
#define DMAALTSET_ADC                  (0x1   << 11 )
#define DMAALTSET_ADC_DIS              (0x0   << 11 ) /* DIS. When read: DMA ADC is using the primary data structure. When written: No effect. Use the DMAALTCLR register to set ADC to 0. */
#define DMAALTSET_ADC_EN               (0x1   << 11 ) /* EN. When read: DMA ADC is using the alternate data structure. When written: Selects the alternate data structure for ADC. */

/* DMAALTSET[I2CMRX] - DMA I2C Master RX. */
#define DMAALTSET_I2CMRX_BBA           (*(volatile unsigned long *) 0x4220061C)
#define DMAALTSET_I2CMRX_MSK           (0x1   << 7  )
#define DMAALTSET_I2CMRX               (0x1   << 7  )
#define DMAALTSET_I2CMRX_DIS           (0x0   << 7  ) /* DIS. When read: DMA I2CMRX is using the primary data structure. When written: No effect. Use the DMAALTCLR register to set I2CMRX to 0. */
#define DMAALTSET_I2CMRX_EN            (0x1   << 7  ) /* EN. When read: DMA I2CMRX is using the alternate data structure. When written: Selects the alternate data structure for I2CMRX. */

/* DMAALTSET[I2CMTX] - DMA I2C Master TX. */
#define DMAALTSET_I2CMTX_BBA           (*(volatile unsigned long *) 0x42200618)
#define DMAALTSET_I2CMTX_MSK           (0x1   << 6  )
#define DMAALTSET_I2CMTX               (0x1   << 6  )
#define DMAALTSET_I2CMTX_DIS           (0x0   << 6  ) /* DIS. When read: DMA I2CMTX is using the primary data structure. When written: No effect. Use the DMAALTCLR register to set I2CMTX to 0. */
#define DMAALTSET_I2CMTX_EN            (0x1   << 6  ) /* EN. When read: DMA I2CMTX is using the alternate data structure. When written: Selects the alternate data structure forI2CMTX. */

/* DMAALTSET[I2CSRX] - DMA I2C Slave RX. */
#define DMAALTSET_I2CSRX_BBA           (*(volatile unsigned long *) 0x42200614)
#define DMAALTSET_I2CSRX_MSK           (0x1   << 5  )
#define DMAALTSET_I2CSRX               (0x1   << 5  )
#define DMAALTSET_I2CSRX_DIS           (0x0   << 5  ) /* DIS. When read: DMA I2CSRX is using the primary data structure. When written: No effect. Use the DMAALTCLR register to set I2CSRX to 0. */
#define DMAALTSET_I2CSRX_EN            (0x1   << 5  ) /* EN. When read: DMA I2CSRX is using the alternate data structure. When written: Selects the alternate data structure for I2CSRX. */

/* DMAALTSET[I2CSTX] - DMA I2C Slave TX. */
#define DMAALTSET_I2CSTX_BBA           (*(volatile unsigned long *) 0x42200610)
#define DMAALTSET_I2CSTX_MSK           (0x1   << 4  )
#define DMAALTSET_I2CSTX               (0x1   << 4  )
#define DMAALTSET_I2CSTX_DIS           (0x0   << 4  ) /* DIS. When read: DMA I2CSTX is using the primary data structure. When written: No effect. Use the DMAALTCLR register to set I2CSTX to 0. */
#define DMAALTSET_I2CSTX_EN            (0x1   << 4  ) /* EN. When read: DMA I2CSTX is using the alternate data structure. When written: Selects the alternate data structure for I2CSTX. */

/* DMAALTSET[UARTRX] - DMA UART RX. */
#define DMAALTSET_UARTRX_BBA           (*(volatile unsigned long *) 0x4220060C)
#define DMAALTSET_UARTRX_MSK           (0x1   << 3  )
#define DMAALTSET_UARTRX               (0x1   << 3  )
#define DMAALTSET_UARTRX_DIS           (0x0   << 3  ) /* DIS. When read: DMA UARTRX is using the primary data structure. When written: No effect. Use the DMAALTCLR register to set UARTRX to 0. */
#define DMAALTSET_UARTRX_EN            (0x1   << 3  ) /* EN. When read: DMA UARTRX is using the alternate data structure. When written: Selects the alternate data structure for UARTRX. */

/* DMAALTSET[UARTTX] - DMA UART TX. */
#define DMAALTSET_UARTTX_BBA           (*(volatile unsigned long *) 0x42200608)
#define DMAALTSET_UARTTX_MSK           (0x1   << 2  )
#define DMAALTSET_UARTTX               (0x1   << 2  )
#define DMAALTSET_UARTTX_DIS           (0x0   << 2  ) /* DIS. When read: DMA UARTTX is using the primary data structure. When written: No effect. Use the DMAALTCLR register to set UARTTX to 0. */
#define DMAALTSET_UARTTX_EN            (0x1   << 2  ) /* EN. When read: DMA UARTTX is using the alternate data structure. When written: Selects the alternate data structure for UARTTX. */

/* DMAALTSET[SPI1RX] - DMA SPI 1 RX. */
#define DMAALTSET_SPI1RX_BBA           (*(volatile unsigned long *) 0x42200604)
#define DMAALTSET_SPI1RX_MSK           (0x1   << 1  )
#define DMAALTSET_SPI1RX               (0x1   << 1  )
#define DMAALTSET_SPI1RX_DIS           (0x0   << 1  ) /* DIS. When read: DMA SPI1RX is using the primary data structure. When written: No effect. Use the DMAALTCLR register to set SPI1RX to 0. */
#define DMAALTSET_SPI1RX_EN            (0x1   << 1  ) /* EN. When read: DMA SPI1RX is using the alternate data structure. When written: Selects the alternate data structure for SPI1RX. */

/* DMAALTSET[SPI1TX] - DMA SPI 1 TX. */
#define DMAALTSET_SPI1TX_BBA           (*(volatile unsigned long *) 0x42200600)
#define DMAALTSET_SPI1TX_MSK           (0x1   << 0  )
#define DMAALTSET_SPI1TX               (0x1   << 0  )
#define DMAALTSET_SPI1TX_DIS           (0x0   << 0  ) /* DIS. When read: DMA SPI1TX is using the primary data structure. When written: No effect. Use the DMAALTCLR register to set SPI1TX to 0. */
#define DMAALTSET_SPI1TX_EN            (0x1   << 0  ) /* EN. When read: DMA SPI1TX is using the alternate data structure. When written: Selects the alternate data structure for SPI1TX. */

