contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* Reset Value for DMAALTCLR*/
#define DMAALTCLR_RVAL                 0x0

/* DMAALTCLR[SPI0RX] - DMA SPI0 RX. */
#define DMAALTCLR_SPI0RX_BBA           (*(volatile unsigned long *) 0x422006B4)
#define DMAALTCLR_SPI0RX_MSK           (0x1   << 13 )
#define DMAALTCLR_SPI0RX               (0x1   << 13 )
#define DMAALTCLR_SPI0RX_DIS           (0x0   << 13 ) /* DIS. No effect. Use the DMAALTSET register to select the alternate data structure. */
#define DMAALTCLR_SPI0RX_EN            (0x1   << 13 ) /* EN. Selects the primary data structure for SPI0RX. */

/* DMAALTCLR[SPI0TX] - DMA SPI0 TX. */
#define DMAALTCLR_SPI0TX_BBA           (*(volatile unsigned long *) 0x422006B0)
#define DMAALTCLR_SPI0TX_MSK           (0x1   << 12 )
#define DMAALTCLR_SPI0TX               (0x1   << 12 )
#define DMAALTCLR_SPI0TX_DIS           (0x0   << 12 ) /* DIS. No effect. Use the DMAALTSET register to select the alternate data structure. */
#define DMAALTCLR_SPI0TX_EN            (0x1   << 12 ) /* EN. Selects the primary data structure for SPI0TX. */

/* DMAALTCLR[ADC] - DMA ADC. */
#define DMAALTCLR_ADC_BBA              (*(volatile unsigned long *) 0x422006AC)
#define DMAALTCLR_ADC_MSK              (0x1   << 11 )
#define DMAALTCLR_ADC                  (0x1   << 11 )
#define DMAALTCLR_ADC_DIS              (0x0   << 11 ) /* DIS. No effect. Use the DMAALTSET register to select the alternate data structure. */
#define DMAALTCLR_ADC_EN               (0x1   << 11 ) /* EN. Selects the primary data structure for ADC. */

/* DMAALTCLR[I2CMRX] - DMA I2C Master RX. */
#define DMAALTCLR_I2CMRX_BBA           (*(volatile unsigned long *) 0x4220069C)
#define DMAALTCLR_I2CMRX_MSK           (0x1   << 7  )
#define DMAALTCLR_I2CMRX               (0x1   << 7  )
#define DMAALTCLR_I2CMRX_DIS           (0x0   << 7  ) /* DIS. No effect. Use the DMAALTSET register to select the alternate data structure. */
#define DMAALTCLR_I2CMRX_EN            (0x1   << 7  ) /* EN. Selects the primary data structure for I2CMRX. */

/* DMAALTCLR[I2CMTX] - DMA I2C Master TX. */
#define DMAALTCLR_I2CMTX_BBA           (*(volatile unsigned long *) 0x42200698)
#define DMAALTCLR_I2CMTX_MSK           (0x1   << 6  )
#define DMAALTCLR_I2CMTX               (0x1   << 6  )
#define DMAALTCLR_I2CMTX_DIS           (0x0   << 6  ) /* DIS. No effect. Use the DMAALTSET register to select the alternate data structure. */
#define DMAALTCLR_I2CMTX_EN            (0x1   << 6  ) /* EN. Selects the primary data structure for I2CMTX. */

/* DMAALTCLR[I2CSRX] - DMA I2C Slave RX. */
#define DMAALTCLR_I2CSRX_BBA           (*(volatile unsigned long *) 0x42200694)
#define DMAALTCLR_I2CSRX_MSK           (0x1   << 5  )
#define DMAALTCLR_I2CSRX               (0x1   << 5  )
#define DMAALTCLR_I2CSRX_DIS           (0x0   << 5  ) /* DIS. No effect. Use the DMAALTSET register to select the alternate data structure. */
#define DMAALTCLR_I2CSRX_EN            (0x1   << 5  ) /* EN. Selects the primary data structure for I2CSRX. */

/* DMAALTCLR[I2CSTX] - DMA I2C Slave TX. */
#define DMAALTCLR_I2CSTX_BBA           (*(volatile unsigned long *) 0x42200690)
#define DMAALTCLR_I2CSTX_MSK           (0x1   << 4  )
#define DMAALTCLR_I2CSTX               (0x1   << 4  )
#define DMAALTCLR_I2CSTX_DIS           (0x0   << 4  ) /* DIS. No effect. Use the DMAALTSET register to select the alternate data structure. */
#define DMAALTCLR_I2CSTX_EN            (0x1   << 4  ) /* EN. Selects the primary data structure for I2CSTX. */

/* DMAALTCLR[UARTRX] - DMA UART RX. */
#define DMAALTCLR_UARTRX_BBA           (*(volatile unsigned long *) 0x4220068C)
#define DMAALTCLR_UARTRX_MSK           (0x1   << 3  )
#define DMAALTCLR_UARTRX               (0x1   << 3  )
#define DMAALTCLR_UARTRX_DIS           (0x0   << 3  ) /* DIS. No effect. Use the DMAALTSET register to select the alternate data structure. */
#define DMAALTCLR_UARTRX_EN            (0x1   << 3  ) /* EN. Selects the primary data structure for UARTRX. */

/* DMAALTCLR[UARTTX] - DMA UART TX. */
#define DMAALTCLR_UARTTX_BBA           (*(volatile unsigned long *) 0x42200688)
#define DMAALTCLR_UARTTX_MSK           (0x1   << 2  )
#define DMAALTCLR_UARTTX               (0x1   << 2  )
#define DMAALTCLR_UARTTX_DIS           (0x0   << 2  ) /* DIS. No effect. Use the DMAALTSET register to select the alternate data structure. */
#define DMAALTCLR_UARTTX_EN            (0x1   << 2  ) /* EN. Selects the primary data structure for UARTTX. */

/* DMAALTCLR[SPI1RX] - DMA SPI 1 RX. */
#define DMAALTCLR_SPI1RX_BBA           (*(volatile unsigned long *) 0x42200684)
#define DMAALTCLR_SPI1RX_MSK           (0x1   << 1  )
#define DMAALTCLR_SPI1RX               (0x1   << 1  )
#define DMAALTCLR_SPI1RX_DIS           (0x0   << 1  ) /* DIS. No effect. Use the DMAALTSET register to select the alternate data structure. */
#define DMAALTCLR_SPI1RX_EN            (0x1   << 1  ) /* EN. Selects the primary data structure for SPI1RX. */

/* DMAALTCLR[SPI1TX] - DMA SPI 1 TX. */
#define DMAALTCLR_SPI1TX_BBA           (*(volatile unsigned long *) 0x42200680)
#define DMAALTCLR_SPI1TX_MSK           (0x1   << 0  )
#define DMAALTCLR_SPI1TX               (0x1   << 0  )
#define DMAALTCLR_SPI1TX_DIS           (0x0   << 0  ) /* DIS. No effect. Use the DMAALTSET register to select the alternate data structure. */
#define DMAALTCLR_SPI1TX_EN            (0x1   << 0  ) /* EN. Selects the primary data structure for SPI1TX. */

/* Reset Value for DMAPRISET*/
#define DMAPRISET_RVAL                 0x0

/* DMAPRISET[SPI0RX] - DMA SPI0 RX. */
#define DMAPRISET_SPI0RX_BBA           (*(volatile unsigned long *) 0x42200734)
#define DMAPRISET_SPI0RX_MSK           (0x1   << 13 )
#define DMAPRISET_SPI0RX               (0x1   << 13 )
#define DMAPRISET_SPI0RX_DIS           (0x0   << 13 ) /* DIS. When read: DMA SPI0RX is using the default priority level. When written: No effect. Use the DMAPRICLR register to set SPI0RX to the default priority level. */
#define DMAPRISET_SPI0RX_EN            (0x1   << 13 ) /* EN. When read: DMA SPI0RX is using a high priority level. When written: SPI0RX uses the high priority level. */

/* DMAPRISET[SPI0TX] - DMA SPI0 TX. */
#define DMAPRISET_SPI0TX_BBA           (*(volatile unsigned long *) 0x42200730)
#define DMAPRISET_SPI0TX_MSK           (0x1   << 12 )
#define DMAPRISET_SPI0TX               (0x1   << 12 )
#define DMAPRISET_SPI0TX_DIS           (0x0   << 12 ) /* DIS. When read: DMA SPI0TX is using the default priority level. When written: No effect. Use the DMAPRICLR register to set SPI0TX to the default priority level. */
#define DMAPRISET_SPI0TX_EN            (0x1   << 12 ) /* EN. When read: DMA SPI0TX is using a high priority level. When written: SPI0TX uses the high priority level. */

/* DMAPRISET[ADC] - DMA ADC. */
#define DMAPRISET_ADC_BBA              (*(volatile unsigned long *) 0x4220072C)
#define DMAPRISET_ADC_MSK              (0x1   << 11 )
#define DMAPRISET_ADC                  (0x1   << 11 )
#define DMAPRISET_ADC_DIS              (0x0   << 11 ) /* DIS. When read: DMA ADC is using the default priority level. When written: No effect. Use the DMAPRICLR register to set ADC to the default priority level. */
#define DMAPRISET_ADC_EN               (0x1   << 11 ) /* EN. When read: DMA ADCs using a high priority level. When written: ADC uses the high priority level. */

/* DMAPRISET[I2CMRX] - DMA I2C Master RX. */
#define DMAPRISET_I2CMRX_BBA           (*(volatile unsigned long *) 0x4220071C)
#define DMAPRISET_I2CMRX_MSK           (0x1   << 7  )
#define DMAPRISET_I2CMRX               (0x1   << 7  )
#define DMAPRISET_I2CMRX_DIS           (0x0   << 7  ) /* DIS. When read: DMA I2CMRX is using the default priority level. When written: No effect. Use the DMAPRICLR register to set I2CMRX to the default priority level. */
#define DMAPRISET_I2CMRX_EN            (0x1   << 7  ) /* EN. When read: DMA I2CMRX is using a high priority level. When written: I2CMRX uses the high priority level. */

/* DMAPRISET[I2CMTX] - DMA I2C Master TX. */
#define DMAPRISET_I2CMTX_BBA           (*(volatile unsigned long *) 0x42200718)
#define DMAPRISET_I2CMTX_MSK           (0x1   << 6  )
#define DMAPRISET_I2CMTX               (0x1   << 6  )
#define DMAPRISET_I2CMTX_DIS           (0x0   << 6  ) /* DIS. When read: DMA I2CMTX is using the default priority level. When written: No effect. Use the DMAPRICLR register to set I2CMTX to the default priority level. */
#define DMAPRISET_I2CMTX_EN            (0x1   << 6  ) /* EN. When read: DMA I2CMTX is using a high priority level. When written: I2CMTX uses the high priority level. */

/* DMAPRISET[I2CSRX] - DMA I2C Slave RX. */
#define DMAPRISET_I2CSRX_BBA           (*(volatile unsigned long *) 0x42200714)
#define DMAPRISET_I2CSRX_MSK           (0x1   << 5  )
#define DMAPRISET_I2CSRX               (0x1   << 5  )
#define DMAPRISET_I2CSRX_DIS           (0x0   << 5  ) /* DIS. When read: DMA I2CSRX is using the default priority level. When written: No effect. Use the DMAPRICLR register to set I2CSRX to the default priority level. */
#define DMAPRISET_I2CSRX_EN            (0x1   << 5  ) /* EN. When read: DMA I2CSRX is using a high priority level. When written: I2CSRX uses the high priority level. */

/* DMAPRISET[I2CSTX] - DMA I2C Slave TX. */
#define DMAPRISET_I2CSTX_BBA           (*(volatile unsigned long *) 0x42200710)
#define DMAPRISET_I2CSTX_MSK           (0x1   << 4  )
#define DMAPRISET_I2CSTX               (0x1   << 4  )
#define DMAPRISET_I2CSTX_DIS           (0x0   << 4  ) /* DIS. When read: DMA I2CSTX is using the default priority level. When written: No effect. Use the DMAPRICLR register to set I2CSTX to the default priority level. */
#define DMAPRISET_I2CSTX_EN            (0x1   << 4  ) /* EN. When read: DMA I2CSTX is using a high priority level. When written: I2CSTX uses the high priority level. */

/* DMAPRISET[UARTRX] - DMA UART RX. */
#define DMAPRISET_UARTRX_BBA           (*(volatile unsigned long *) 0x4220070C)
#define DMAPRISET_UARTRX_MSK           (0x1   << 3  )
#define DMAPRISET_UARTRX               (0x1   << 3  )
#define DMAPRISET_UARTRX_DIS           (0x0   << 3  ) /* DIS. When read: DMA UARTRX is using the default priority level. When written: No effect. Use the DMAPRICLR register to set UARTRX to the default priority level. */
#define DMAPRISET_UARTRX_EN            (0x1   << 3  ) /* EN. When read: DMA UARTRX is using a high priority level. When written: UARTRX uses the high priority level. */

