contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* DMAPRISET[UARTTX] - DMA UART TX. */
#define DMAPRISET_UARTTX_BBA           (*(volatile unsigned long *) 0x42200708)
#define DMAPRISET_UARTTX_MSK           (0x1   << 2  )
#define DMAPRISET_UARTTX               (0x1   << 2  )
#define DMAPRISET_UARTTX_DIS           (0x0   << 2  ) /* DIS. When read: DMA UARTTX is using the default priority level. When written: No effect. Use the DMAPRICLR register to set UARTTX to the default priority level. */
#define DMAPRISET_UARTTX_EN            (0x1   << 2  ) /* EN. When read: DMA UARTTX is using a high priority level. When written: UARTTX uses the high priority level. */

/* DMAPRISET[SPI1RX] - DMA SPI 1 RX. */
#define DMAPRISET_SPI1RX_BBA           (*(volatile unsigned long *) 0x42200704)
#define DMAPRISET_SPI1RX_MSK           (0x1   << 1  )
#define DMAPRISET_SPI1RX               (0x1   << 1  )
#define DMAPRISET_SPI1RX_DIS           (0x0   << 1  ) /* DIS. When read: DMA SPI1RX is using the default priority level. When written: No effect. Use the DMAPRICLR register to set SPI1RX to the default priority level. */
#define DMAPRISET_SPI1RX_EN            (0x1   << 1  ) /* EN. When read: DMA SPI1RX is using a high priority level. When written: SPI1RX uses the high priority level. */

/* DMAPRISET[SPI1TX] - DMA SPI 1 TX. */
#define DMAPRISET_SPI1TX_BBA           (*(volatile unsigned long *) 0x42200700)
#define DMAPRISET_SPI1TX_MSK           (0x1   << 0  )
#define DMAPRISET_SPI1TX               (0x1   << 0  )
#define DMAPRISET_SPI1TX_DIS           (0x0   << 0  ) /* DIS. When read: DMA SPI1TX is using the default priority level. When written: No effect. Use the DMAPRICLR register to set SPI1TX to the default priority level. */
#define DMAPRISET_SPI1TX_EN            (0x1   << 0  ) /* EN. When read: DMA SPI1TX is using a high priority level. When written: SPI1TX uses the high priority level. */

/* Reset Value for DMAPRICLR*/
#define DMAPRICLR_RVAL                 0x0

/* DMAPRICLR[SPI0RX] - DMA SPI0 RX. */
#define DMAPRICLR_SPI0RX_BBA           (*(volatile unsigned long *) 0x422007B4)
#define DMAPRICLR_SPI0RX_MSK           (0x1   << 13 )
#define DMAPRICLR_SPI0RX               (0x1   << 13 )
#define DMAPRICLR_SPI0RX_DIS           (0x0   << 13 ) /* DIS. No effect. Use the DMAPRISET register to set SPI0RX to the high priority level. */
#define DMAPRICLR_SPI0RX_EN            (0x1   << 13 ) /* EN. SPI0RX uses the default priority level. */

/* DMAPRICLR[SPI0TX] - DMA SPI0 TX. */
#define DMAPRICLR_SPI0TX_BBA           (*(volatile unsigned long *) 0x422007B0)
#define DMAPRICLR_SPI0TX_MSK           (0x1   << 12 )
#define DMAPRICLR_SPI0TX               (0x1   << 12 )
#define DMAPRICLR_SPI0TX_DIS           (0x0   << 12 ) /* DIS. No effect. Use the DMAPRISET register to set SPI0TX to the high priority level. */
#define DMAPRICLR_SPI0TX_EN            (0x1   << 12 ) /* EN. SPI0TX uses the default priority level. */

/* DMAPRICLR[ADC] - DMA ADC. */
#define DMAPRICLR_ADC_BBA              (*(volatile unsigned long *) 0x422007AC)
#define DMAPRICLR_ADC_MSK              (0x1   << 11 )
#define DMAPRICLR_ADC                  (0x1   << 11 )
#define DMAPRICLR_ADC_DIS              (0x0   << 11 ) /* DIS. No effect. Use the DMAPRISET register to set ADC to the high priority level. */
#define DMAPRICLR_ADC_EN               (0x1   << 11 ) /* EN. ADC uses the default priority level. */

/* DMAPRICLR[I2CMRX] - DMA I2C Master RX. */
#define DMAPRICLR_I2CMRX_BBA           (*(volatile unsigned long *) 0x4220079C)
#define DMAPRICLR_I2CMRX_MSK           (0x1   << 7  )
#define DMAPRICLR_I2CMRX               (0x1   << 7  )
#define DMAPRICLR_I2CMRX_DIS           (0x0   << 7  ) /* DIS. No effect. Use the DMAPRISET register to set I2CMRX to the high priority level. */
#define DMAPRICLR_I2CMRX_EN            (0x1   << 7  ) /* EN. I2CMRX uses the default priority level. */

/* DMAPRICLR[I2CMTX] - DMA I2C Master TX. */
#define DMAPRICLR_I2CMTX_BBA           (*(volatile unsigned long *) 0x42200798)
#define DMAPRICLR_I2CMTX_MSK           (0x1   << 6  )
#define DMAPRICLR_I2CMTX               (0x1   << 6  )
#define DMAPRICLR_I2CMTX_DIS           (0x0   << 6  ) /* DIS. No effect. Use the DMAPRISET register to set I2CMTX to the high priority level. */
#define DMAPRICLR_I2CMTX_EN            (0x1   << 6  ) /* EN. I2CMTX uses the default priority level. */

/* DMAPRICLR[I2CSRX] - DMA I2C Slave RX. */
#define DMAPRICLR_I2CSRX_BBA           (*(volatile unsigned long *) 0x42200794)
#define DMAPRICLR_I2CSRX_MSK           (0x1   << 5  )
#define DMAPRICLR_I2CSRX               (0x1   << 5  )
#define DMAPRICLR_I2CSRX_DIS           (0x0   << 5  ) /* DIS. No effect. Use the DMAPRISET register to set I2CSRX to the high priority level. */
#define DMAPRICLR_I2CSRX_EN            (0x1   << 5  ) /* EN. I2CSRX uses the default priority level. */

/* DMAPRICLR[I2CSTX] - DMA I2C Slave TX. */
#define DMAPRICLR_I2CSTX_BBA           (*(volatile unsigned long *) 0x42200790)
#define DMAPRICLR_I2CSTX_MSK           (0x1   << 4  )
#define DMAPRICLR_I2CSTX               (0x1   << 4  )
#define DMAPRICLR_I2CSTX_DIS           (0x0   << 4  ) /* DIS. No effect. Use the DMAPRISET register to set I2CSTX to the high priority level. */
#define DMAPRICLR_I2CSTX_EN            (0x1   << 4  ) /* EN. I2CSTX uses the default priority level. */

/* DMAPRICLR[UARTRX] - DMA UART RX. */
#define DMAPRICLR_UARTRX_BBA           (*(volatile unsigned long *) 0x4220078C)
#define DMAPRICLR_UARTRX_MSK           (0x1   << 3  )
#define DMAPRICLR_UARTRX               (0x1   << 3  )
#define DMAPRICLR_UARTRX_DIS           (0x0   << 3  ) /* DIS. No effect. Use the DMAPRISET register to set UARTRX to the high priority level. */
#define DMAPRICLR_UARTRX_EN            (0x1   << 3  ) /* EN. UARTRX uses the default priority level. */

/* DMAPRICLR[UARTTX] - DMA UART TX. */
#define DMAPRICLR_UARTTX_BBA           (*(volatile unsigned long *) 0x42200788)
#define DMAPRICLR_UARTTX_MSK           (0x1   << 2  )
#define DMAPRICLR_UARTTX               (0x1   << 2  )
#define DMAPRICLR_UARTTX_DIS           (0x0   << 2  ) /* DIS. No effect. Use the DMAPRISET register to set UARTTX to the high priority level. */
#define DMAPRICLR_UARTTX_EN            (0x1   << 2  ) /* EN. UARTTX uses the default priority level. */

/* DMAPRICLR[SPI1RX] - DMA SPI 1 RX. */
#define DMAPRICLR_SPI1RX_BBA           (*(volatile unsigned long *) 0x42200784)
#define DMAPRICLR_SPI1RX_MSK           (0x1   << 1  )
#define DMAPRICLR_SPI1RX               (0x1   << 1  )
#define DMAPRICLR_SPI1RX_DIS           (0x0   << 1  ) /* DIS. No effect. Use the DMAPRISET register to set SPI1RX to the high priority level. */
#define DMAPRICLR_SPI1RX_EN            (0x1   << 1  ) /* EN. SPI1RX uses the default priority level. */

/* DMAPRICLR[SPI1TX] - DMA SPI 1 TX. */
#define DMAPRICLR_SPI1TX_BBA           (*(volatile unsigned long *) 0x42200780)
#define DMAPRICLR_SPI1TX_MSK           (0x1   << 0  )
#define DMAPRICLR_SPI1TX               (0x1   << 0  )
#define DMAPRICLR_SPI1TX_DIS           (0x0   << 0  ) /* DIS. No effect. Use the DMAPRISET register to set SPI1TX to the high priority level. */
#define DMAPRICLR_SPI1TX_EN            (0x1   << 0  ) /* EN. SPI1TX uses the default priority level. */

