contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* Reset Value for FEEADR0H*/
#define FEEADR0H_RVAL                  0x0

/* FEEADR0H[VALUE] - Used in conjunction with FEEADR0L, to indicate the page to be erased, or the start of a section to be signed. The address of a memory location inside the page should be stored in FEEADR0L/H, bits[15:0] in FEEADR0L, and bits[17:16] in FEEADR0H. */
#define FEEADR0H_VALUE_MSK             (0x3   << 0  )

/* Reset Value for FEEADR1L*/
#define FEEADR1L_RVAL                  0x0

/* FEEADR1L[VALUE] - Used in conjunction with FEEADR1H, to identify the last page used by the Sign command. The address of a memory location inside the page should be stored in FEEADR1L/H, bits[15:0] in FEEADR1L, and bits[17:16] in FEEADR1H. The 9 LSBs of the address are ignored. */
#define FEEADR1L_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for FEEADR1H*/
#define FEEADR1H_RVAL                  0x0

/* FEEADR1H[VALUE] - Used in conjunction with FEEADR1L, to identify the last page used by the Sign command. The address of a memory location inside the page should be stored in FEEADR1L/H, bits[15:0] in FEEADR1L, and bits[17:16] in FEEADR1H. */
#define FEEADR1H_VALUE_MSK             (0x3   << 0  )

/* Reset Value for FEEKEY*/
#define FEEKEY_RVAL                    0x0

/* FEEKEY[VALUE] - Enter 0xF456 followed by 0xF123. Returns 0x0 if read. */
#define FEEKEY_VALUE_MSK               (0xFFFF << 0  )
#define FEEKEY_VALUE_USERKEY1          (0xF456 << 0  ) /* USERKEY1                 */
#define FEEKEY_VALUE_USERKEY2          (0xF123 << 0  ) /* USERKEY2                 */

/* Reset Value for FEEPROL*/
#define FEEPROL_RVAL                   0xFFFF

/* FEEPROL[VALUE] - Lower 16 bits of the write protection. This register is read only if the write protection in flash has been programmed, i.e. FEEPROH/L have previously been configured to protect pages. */
#define FEEPROL_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for FEEPROH*/
#define FEEPROH_RVAL                   0xFFFF

/* FEEPROH[VALUE] - Upper 16 bits of the write protection. This register is read only if the write protection in flash has been programmed, i.e. FEEPROH/L have previously been configured to protect pages. */
#define FEEPROH_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for FEESIGL*/
#define FEESIGL_RVAL                   0xFFFF

/* FEESIGL[VALUE] - Lower 16 bits of the signature. Signature[15:0]. */
#define FEESIGL_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for FEESIGH*/
#define FEESIGH_RVAL                   0xFFFF

/* FEESIGH[VALUE] - Upper eight bits of the signature. Signature[23:16]. */
#define FEESIGH_VALUE_MSK              (0xFF  << 0  )

/* Reset Value for FEECON1*/
#define FEECON1_RVAL                   0x1

/* FEECON1[DBG] - Serial Wire debug enable. */
#define FEECON1_DBG_BBA                (*(volatile unsigned long *) 0x42050700)
#define FEECON1_DBG_MSK                (0x1   << 0  )
#define FEECON1_DBG                    (0x1   << 0  )
#define FEECON1_DBG_DIS                (0x0   << 0  ) /* DIS. Disable access via the serial wire debug interface. */
#define FEECON1_DBG_EN                 (0x1   << 0  ) /* EN. Enable access via the serial wire debug interface. */

/* Reset Value for FEEADRAL*/
#define FEEADRAL_RVAL                  0x800

/* FEEADRAL[VALUE] - Lower 16 bits of the FEEADRA register. If a write is aborted then this will contain the address of the location been written when the write was aborted. */
#define FEEADRAL_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for FEEADRAH*/
#define FEEADRAH_RVAL                  0x2

/* FEEADRAH[VALUE] - Upper 16 bits of the FEEADRA register. */
#define FEEADRAH_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for FEEAEN0*/
#define FEEAEN0_RVAL                   0x0

/* FEEAEN0[FEE] - Flash controller interrupt abort enable bit */
#define FEEAEN0_FEE_BBA                (*(volatile unsigned long *) 0x42050F3C)
#define FEEAEN0_FEE_MSK                (0x1   << 15 )
#define FEEAEN0_FEE                    (0x1   << 15 )
#define FEEAEN0_FEE_DIS                (0x0   << 15 ) /* DIS. Flash controller interrupt abort disabled. */
#define FEEAEN0_FEE_EN                 (0x1   << 15 ) /* EN. Flash controller interrupt abort enabled. */

/* FEEAEN0[ADC] - ADC interrupt abort enable bit */
#define FEEAEN0_ADC_BBA                (*(volatile unsigned long *) 0x42050F38)
#define FEEAEN0_ADC_MSK                (0x1   << 14 )
#define FEEAEN0_ADC                    (0x1   << 14 )
#define FEEAEN0_ADC_DIS                (0x0   << 14 ) /* DIS. ADC interrupt abort disabled. */
#define FEEAEN0_ADC_EN                 (0x1   << 14 ) /* EN. ADC interrupt abort enabled. */

/* FEEAEN0[T1] - Timer1 interrupt abort enable bit */
#define FEEAEN0_T1_BBA                 (*(volatile unsigned long *) 0x42050F34)
#define FEEAEN0_T1_MSK                 (0x1   << 13 )
#define FEEAEN0_T1                     (0x1   << 13 )
#define FEEAEN0_T1_DIS                 (0x0   << 13 ) /* DIS. Timer1 interrupt abort disabled. */
#define FEEAEN0_T1_EN                  (0x1   << 13 ) /* EN. Timer1 interrupt abort enabled. */

/* FEEAEN0[T0] - Timer0 interrupt abort enable bit */
#define FEEAEN0_T0_BBA                 (*(volatile unsigned long *) 0x42050F30)
#define FEEAEN0_T0_MSK                 (0x1   << 12 )
#define FEEAEN0_T0                     (0x1   << 12 )
#define FEEAEN0_T0_DIS                 (0x0   << 12 ) /* DIS. Timer0 interrupt abort disabled. */
#define FEEAEN0_T0_EN                  (0x1   << 12 ) /* EN. Timer0 interrupt abort enabled. */

/* FEEAEN0[T3] - Timer3 interrupt abort enable bit */
#define FEEAEN0_T3_BBA                 (*(volatile unsigned long *) 0x42050F28)
#define FEEAEN0_T3_MSK                 (0x1   << 10 )
#define FEEAEN0_T3                     (0x1   << 10 )
#define FEEAEN0_T3_DIS                 (0x0   << 10 ) /* DIS. Timer3 interrupt abort disabled. */
#define FEEAEN0_T3_EN                  (0x1   << 10 ) /* EN. Timer3 interrupt abort enabled. */

/* FEEAEN0[EXTINT8] - External interrupt 8 abort enable bit */
#define FEEAEN0_EXTINT8_BBA            (*(volatile unsigned long *) 0x42050F24)
#define FEEAEN0_EXTINT8_MSK            (0x1   << 9  )
#define FEEAEN0_EXTINT8                (0x1   << 9  )
#define FEEAEN0_EXTINT8_DIS            (0x0   << 9  ) /* DIS. External interrupt 8 abort disabled. */
#define FEEAEN0_EXTINT8_EN             (0x1   << 9  ) /* EN. External interrupt 8 abort enabled. */

/* FEEAEN0[EXTINT7] - External interrupt 7 abort enable bit */
#define FEEAEN0_EXTINT7_BBA            (*(volatile unsigned long *) 0x42050F20)
#define FEEAEN0_EXTINT7_MSK            (0x1   << 8  )
#define FEEAEN0_EXTINT7                (0x1   << 8  )
#define FEEAEN0_EXTINT7_DIS            (0x0   << 8  ) /* DIS. External interrupt 7 abort disabled. */
#define FEEAEN0_EXTINT7_EN             (0x1   << 8  ) /* EN. External interrupt 7 abort enabled. */

