contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* FEEAEN0[EXTINT6] - External interrupt 6 abort enable bit */
#define FEEAEN0_EXTINT6_BBA            (*(volatile unsigned long *) 0x42050F1C)
#define FEEAEN0_EXTINT6_MSK            (0x1   << 7  )
#define FEEAEN0_EXTINT6                (0x1   << 7  )
#define FEEAEN0_EXTINT6_DIS            (0x0   << 7  ) /* DIS. External interrupt 6 abort disabled. */
#define FEEAEN0_EXTINT6_EN             (0x1   << 7  ) /* EN. External interrupt 6 abort enabled. */

/* FEEAEN0[EXTINT5] - External interrupt 5 abort enable bit */
#define FEEAEN0_EXTINT5_BBA            (*(volatile unsigned long *) 0x42050F18)
#define FEEAEN0_EXTINT5_MSK            (0x1   << 6  )
#define FEEAEN0_EXTINT5                (0x1   << 6  )
#define FEEAEN0_EXTINT5_DIS            (0x0   << 6  ) /* DIS. External interrupt 5 abort disabled. */
#define FEEAEN0_EXTINT5_EN             (0x1   << 6  ) /* EN. External interrupt 5 abort enabled. */

/* FEEAEN0[EXTINT4] - External interrupt 4 abort enable bit */
#define FEEAEN0_EXTINT4_BBA            (*(volatile unsigned long *) 0x42050F14)
#define FEEAEN0_EXTINT4_MSK            (0x1   << 5  )
#define FEEAEN0_EXTINT4                (0x1   << 5  )
#define FEEAEN0_EXTINT4_DIS            (0x0   << 5  ) /* DIS. External interrupt 4 abort disabled. */
#define FEEAEN0_EXTINT4_EN             (0x1   << 5  ) /* EN. External interrupt 4 abort enabled. */

/* FEEAEN0[EXTINT3] - External interrupt 3 abort enable bit */
#define FEEAEN0_EXTINT3_BBA            (*(volatile unsigned long *) 0x42050F10)
#define FEEAEN0_EXTINT3_MSK            (0x1   << 4  )
#define FEEAEN0_EXTINT3                (0x1   << 4  )
#define FEEAEN0_EXTINT3_DIS            (0x0   << 4  ) /* DIS. External interrupt 3 abort disabled. */
#define FEEAEN0_EXTINT3_EN             (0x1   << 4  ) /* EN. External interrupt 3 abort enabled. */

/* FEEAEN0[EXTINT2] - External interrupt 2 abort enable bit */
#define FEEAEN0_EXTINT2_BBA            (*(volatile unsigned long *) 0x42050F0C)
#define FEEAEN0_EXTINT2_MSK            (0x1   << 3  )
#define FEEAEN0_EXTINT2                (0x1   << 3  )
#define FEEAEN0_EXTINT2_DIS            (0x0   << 3  ) /* DIS. External interrupt 2 abort disabled. */
#define FEEAEN0_EXTINT2_EN             (0x1   << 3  ) /* EN. External interrupt 2 abort enabled. */

/* FEEAEN0[EXTINT1] - External interrupt 1 abort enable bit */
#define FEEAEN0_EXTINT1_BBA            (*(volatile unsigned long *) 0x42050F08)
#define FEEAEN0_EXTINT1_MSK            (0x1   << 2  )
#define FEEAEN0_EXTINT1                (0x1   << 2  )
#define FEEAEN0_EXTINT1_DIS            (0x0   << 2  ) /* DIS. External interrupt 1 abort disabled. */
#define FEEAEN0_EXTINT1_EN             (0x1   << 2  ) /* EN. External interrupt 1 abort enabled. */

/* FEEAEN0[EXTINT0] - External interrupt 0 abort enable bit */
#define FEEAEN0_EXTINT0_BBA            (*(volatile unsigned long *) 0x42050F04)
#define FEEAEN0_EXTINT0_MSK            (0x1   << 1  )
#define FEEAEN0_EXTINT0                (0x1   << 1  )
#define FEEAEN0_EXTINT0_DIS            (0x0   << 1  ) /* DIS. External interrupt 0 abort disabled. */
#define FEEAEN0_EXTINT0_EN             (0x1   << 1  ) /* EN. External interrupt 0 abort enabled. */

/* FEEAEN0[T2] - Timer2 interrupt abort enable bit */
#define FEEAEN0_T2_BBA                 (*(volatile unsigned long *) 0x42050F00)
#define FEEAEN0_T2_MSK                 (0x1   << 0  )
#define FEEAEN0_T2                     (0x1   << 0  )
#define FEEAEN0_T2_DIS                 (0x0   << 0  ) /* DIS. Timer2 interrupt abort disabled. */
#define FEEAEN0_T2_EN                  (0x1   << 0  ) /* EN. Timer2 interrupt abort enabled */

/* Reset Value for FEEAEN1*/
#define FEEAEN1_RVAL                   0x0

/* FEEAEN1[DMAI2CMRX] - I2C master RX DMA interrupt abort enable bit */
#define FEEAEN1_DMAI2CMRX_BBA          (*(volatile unsigned long *) 0x42050FBC)
#define FEEAEN1_DMAI2CMRX_MSK          (0x1   << 15 )
#define FEEAEN1_DMAI2CMRX              (0x1   << 15 )
#define FEEAEN1_DMAI2CMRX_DIS          (0x0   << 15 ) /* DIS. I2C master RX DMA interrupt abort disabled. */
#define FEEAEN1_DMAI2CMRX_EN           (0x1   << 15 ) /* EN. I2C master RX DMA interrupt abort enabled. */

/* FEEAEN1[DMAI2CMTX] - I2C master TX DMA interrupt abort enable bit */
#define FEEAEN1_DMAI2CMTX_BBA          (*(volatile unsigned long *) 0x42050FB8)
#define FEEAEN1_DMAI2CMTX_MSK          (0x1   << 14 )
#define FEEAEN1_DMAI2CMTX              (0x1   << 14 )
#define FEEAEN1_DMAI2CMTX_DIS          (0x0   << 14 ) /* DIS. I2C master TX DMA interrupt abort disabled. */
#define FEEAEN1_DMAI2CMTX_EN           (0x1   << 14 ) /* EN. I2C master TX DMA interrupt abort enabled. */

/* FEEAEN1[DMAI2CSRX] - I2C slave RX DMA interrupt abort enable bit */
#define FEEAEN1_DMAI2CSRX_BBA          (*(volatile unsigned long *) 0x42050FB4)
#define FEEAEN1_DMAI2CSRX_MSK          (0x1   << 13 )
#define FEEAEN1_DMAI2CSRX              (0x1   << 13 )
#define FEEAEN1_DMAI2CSRX_DIS          (0x0   << 13 ) /* DIS. I2C slave RX DMA interrupt abort disabled. */
#define FEEAEN1_DMAI2CSRX_EN           (0x1   << 13 ) /* EN. I2C slave RX DMA interrupt abort enabled. */

/* FEEAEN1[DMAI2CSTX] - I2C slave TX DMA interrupt abort enable bit */
#define FEEAEN1_DMAI2CSTX_BBA          (*(volatile unsigned long *) 0x42050FB0)
#define FEEAEN1_DMAI2CSTX_MSK          (0x1   << 12 )
#define FEEAEN1_DMAI2CSTX              (0x1   << 12 )
#define FEEAEN1_DMAI2CSTX_DIS          (0x0   << 12 ) /* DIS. I2C slave TX DMA interrupt abort disabled. */
#define FEEAEN1_DMAI2CSTX_EN           (0x1   << 12 ) /* EN. I2C slave TX DMA interrupt abort enabled. */

/* FEEAEN1[DMAUARTRX] - UARTRX DMA interrupt abort enable bit */
#define FEEAEN1_DMAUARTRX_BBA          (*(volatile unsigned long *) 0x42050FAC)
#define FEEAEN1_DMAUARTRX_MSK          (0x1   << 11 )
#define FEEAEN1_DMAUARTRX              (0x1   << 11 )
#define FEEAEN1_DMAUARTRX_DIS          (0x0   << 11 ) /* DIS. UARTRX DMA interrupt abort disabled. */
#define FEEAEN1_DMAUARTRX_EN           (0x1   << 11 ) /* EN. UARTRX DMA interrupt abort enabled. */

/* FEEAEN1[DMAUARTTX] - UARTTX DMA interrupt abort enable bit */
#define FEEAEN1_DMAUARTTX_BBA          (*(volatile unsigned long *) 0x42050FA8)
#define FEEAEN1_DMAUARTTX_MSK          (0x1   << 10 )
#define FEEAEN1_DMAUARTTX              (0x1   << 10 )
#define FEEAEN1_DMAUARTTX_DIS          (0x0   << 10 ) /* DIS. UARTTX DMA interrupt abort disabled. */
#define FEEAEN1_DMAUARTTX_EN           (0x1   << 10 ) /* EN. UARTTX DMA interrupt abort enabled. */

/* FEEAEN1[DMASPI1RX] - SPI1RX DMA interrupt abort enable bit */
#define FEEAEN1_DMASPI1RX_BBA          (*(volatile unsigned long *) 0x42050FA4)
#define FEEAEN1_DMASPI1RX_MSK          (0x1   << 9  )
#define FEEAEN1_DMASPI1RX              (0x1   << 9  )
#define FEEAEN1_DMASPI1RX_DIS          (0x0   << 9  ) /* DIS. SPI1RX DMA interrupt abort disabled. */
#define FEEAEN1_DMASPI1RX_EN           (0x1   << 9  ) /* EN. SPI1RX DMA interrupt abort enabled. */

/* FEEAEN1[DMASPI1TX] - SPI1TX DMA interrupt abort enable bit */
#define FEEAEN1_DMASPI1TX_BBA          (*(volatile unsigned long *) 0x42050FA0)
#define FEEAEN1_DMASPI1TX_MSK          (0x1   << 8  )
#define FEEAEN1_DMASPI1TX              (0x1   << 8  )
#define FEEAEN1_DMASPI1TX_DIS          (0x0   << 8  ) /* DIS. SPI1TX DMA interrupt abort disabled. */
#define FEEAEN1_DMASPI1TX_EN           (0x1   << 8  ) /* EN. SPI1TX DMA interrupt abort enabled. */

