contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* FEEAEN1[DMAERROR] - DMA error interrupt abort enable bit */
#define FEEAEN1_DMAERROR_BBA           (*(volatile unsigned long *) 0x42050F9C)
#define FEEAEN1_DMAERROR_MSK           (0x1   << 7  )
#define FEEAEN1_DMAERROR               (0x1   << 7  )
#define FEEAEN1_DMAERROR_DIS           (0x0   << 7  ) /* DIS. DMA error interrupt abort disabled. */
#define FEEAEN1_DMAERROR_EN            (0x1   << 7  ) /* EN. DMA error interrupt abort enabled. */

/* FEEAEN1[I2CM] - I2C master interrupt abort enable bit */
#define FEEAEN1_I2CM_BBA               (*(volatile unsigned long *) 0x42050F90)
#define FEEAEN1_I2CM_MSK               (0x1   << 4  )
#define FEEAEN1_I2CM                   (0x1   << 4  )
#define FEEAEN1_I2CM_DIS               (0x0   << 4  ) /* DIS. I2C slave interrupt abort disabled. */
#define FEEAEN1_I2CM_EN                (0x1   << 4  ) /* EN. I2C master interrupt abort enabled. */

/* FEEAEN1[I2CS] - I2C slave interrupt abort enable bit */
#define FEEAEN1_I2CS_BBA               (*(volatile unsigned long *) 0x42050F8C)
#define FEEAEN1_I2CS_MSK               (0x1   << 3  )
#define FEEAEN1_I2CS                   (0x1   << 3  )
#define FEEAEN1_I2CS_DIS               (0x0   << 3  ) /* DIS. I2C slave interrupt abort disabled. */
#define FEEAEN1_I2CS_EN                (0x1   << 3  ) /* EN. I2C slave interrupt abort enabled. */

/* FEEAEN1[SPI1] - SPI1 interrupt abort enable bit */
#define FEEAEN1_SPI1_BBA               (*(volatile unsigned long *) 0x42050F88)
#define FEEAEN1_SPI1_MSK               (0x1   << 2  )
#define FEEAEN1_SPI1                   (0x1   << 2  )
#define FEEAEN1_SPI1_DIS               (0x0   << 2  ) /* DIS. SPI1 interrupt abort disabled. */
#define FEEAEN1_SPI1_EN                (0x1   << 2  ) /* EN. SPI1 interrupt abort enabled. */

/* FEEAEN1[SPI0] - SPI0 interrupt abort enable bit */
#define FEEAEN1_SPI0_BBA               (*(volatile unsigned long *) 0x42050F84)
#define FEEAEN1_SPI0_MSK               (0x1   << 1  )
#define FEEAEN1_SPI0                   (0x1   << 1  )
#define FEEAEN1_SPI0_DIS               (0x0   << 1  ) /* DIS. SPI0 interrupt abort disabled. */
#define FEEAEN1_SPI0_EN                (0x1   << 1  ) /* EN. SPI0 interrupt abort enabled. */

/* FEEAEN1[UART] - UART interrupt abort enable bit */
#define FEEAEN1_UART_BBA               (*(volatile unsigned long *) 0x42050F80)
#define FEEAEN1_UART_MSK               (0x1   << 0  )
#define FEEAEN1_UART                   (0x1   << 0  )
#define FEEAEN1_UART_DIS               (0x0   << 0  ) /* DIS. UART interrupt abort disabled. */
#define FEEAEN1_UART_EN                (0x1   << 0  ) /* EN. UART interrupt abort enabled. */

/* Reset Value for FEEAEN2*/
#define FEEAEN2_RVAL                   0x0

/* FEEAEN2[PWM3] - PWM3 interrupt abort enable bit */
#define FEEAEN2_PWM3_BBA               (*(volatile unsigned long *) 0x42051028)
#define FEEAEN2_PWM3_MSK               (0x1   << 10 )
#define FEEAEN2_PWM3                   (0x1   << 10 )
#define FEEAEN2_PWM3_DIS               (0x0   << 10 ) /* DIS.  PWM3 interrupt abort disabled. */
#define FEEAEN2_PWM3_EN                (0x1   << 10 ) /* EN. PWM3 interrupt abort enabled. */

/* FEEAEN2[PWM2] - PWM2 interrupt abort enable bit */
#define FEEAEN2_PWM2_BBA               (*(volatile unsigned long *) 0x42051024)
#define FEEAEN2_PWM2_MSK               (0x1   << 9  )
#define FEEAEN2_PWM2                   (0x1   << 9  )
#define FEEAEN2_PWM2_DIS               (0x0   << 9  ) /* DIS.  PWM2 interrupt abort disabled. */
#define FEEAEN2_PWM2_EN                (0x1   << 9  ) /* EN. PWM2 interrupt abort enabled. */

/* FEEAEN2[PWM1] - PWM1 interrupt abort enable bit */
#define FEEAEN2_PWM1_BBA               (*(volatile unsigned long *) 0x42051020)
#define FEEAEN2_PWM1_MSK               (0x1   << 8  )
#define FEEAEN2_PWM1                   (0x1   << 8  )
#define FEEAEN2_PWM1_DIS               (0x0   << 8  ) /* DIS.  PWM1 interrupt abort disabled. */
#define FEEAEN2_PWM1_EN                (0x1   << 8  ) /* EN. PWM1 interrupt abort enabled. */

/* FEEAEN2[PWM0] - PWM0 interrupt abort enable bit */
#define FEEAEN2_PWM0_BBA               (*(volatile unsigned long *) 0x4205101C)
#define FEEAEN2_PWM0_MSK               (0x1   << 7  )
#define FEEAEN2_PWM0                   (0x1   << 7  )
#define FEEAEN2_PWM0_DIS               (0x0   << 7  ) /* DIS.  PWM0 interrupt abort disabled. */
#define FEEAEN2_PWM0_EN                (0x1   << 7  ) /* EN. PWM0 interrupt abort enabled. */

/* FEEAEN2[PWMTRIP] - PWMTRIP interrupt abort enable bit */
#define FEEAEN2_PWMTRIP_BBA            (*(volatile unsigned long *) 0x42051018)
#define FEEAEN2_PWMTRIP_MSK            (0x1   << 6  )
#define FEEAEN2_PWMTRIP                (0x1   << 6  )
#define FEEAEN2_PWMTRIP_DIS            (0x0   << 6  ) /* DIS. PWMTRIP interrupt abort disabled. */
#define FEEAEN2_PWMTRIP_EN             (0x1   << 6  ) /* EN. PWMTRIP interrupt abort enabled. */

/* FEEAEN2[DMASPI0RX] - SPI0RX DMA interrupt abort enable bit */
#define FEEAEN2_DMASPI0RX_BBA          (*(volatile unsigned long *) 0x42051014)
#define FEEAEN2_DMASPI0RX_MSK          (0x1   << 5  )
#define FEEAEN2_DMASPI0RX              (0x1   << 5  )
#define FEEAEN2_DMASPI0RX_DIS          (0x0   << 5  ) /* DIS. SPI0RX DMA interrupt abort disabled. */
#define FEEAEN2_DMASPI0RX_EN           (0x1   << 5  ) /* EN. SPI0RX DMA interrupt abort enabled. */

/* FEEAEN2[DMASPI0TX] - SPI0TX DMA interrupt abort enable bit */
#define FEEAEN2_DMASPI0TX_BBA          (*(volatile unsigned long *) 0x42051010)
#define FEEAEN2_DMASPI0TX_MSK          (0x1   << 4  )
#define FEEAEN2_DMASPI0TX              (0x1   << 4  )
#define FEEAEN2_DMASPI0TX_DIS          (0x0   << 4  ) /* DIS. SPI0TX DMA interrupt abort disabled. */
#define FEEAEN2_DMASPI0TX_EN           (0x1   << 4  ) /* EN. SPI0TX DMA interrupt abort enabled. */

/* FEEAEN2[DMAADC] - ADC DMA interrupt abort enable bit */
#define FEEAEN2_DMAADC_BBA             (*(volatile unsigned long *) 0x4205100C)
#define FEEAEN2_DMAADC_MSK             (0x1   << 3  )
#define FEEAEN2_DMAADC                 (0x1   << 3  )
#define FEEAEN2_DMAADC_DIS             (0x0   << 3  ) /* DIS. ADC DMA interrupt abort disabled. */
#define FEEAEN2_DMAADC_EN              (0x1   << 3  ) /* EN. ADC DMA interrupt abort enabled. */
// ------------------------------------------------------------------------------------------------
// -----                                        GPIO0                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief General Purpose Input Output (pADI_GP0)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_GP0 Structure                     */
  __IO uint16_t  GPCON;                     /*!< GPIO Port 0 Configuration             */
  __I  uint16_t  RESERVED0;
  __IO uint8_t   GPOEN;                     /*!< GPIO Port 0 Output Enable             */
  __I  uint8_t   RESERVED1[3];
  __IO uint8_t   GPPUL;                     /*!< GPIO Port 0 Pull Up Enable            */
  __I  uint8_t   RESERVED2[3];
  __IO uint8_t   GPOCE;                     /*!< GPIO Port 0 Tri State                 */
  __I  uint8_t   RESERVED3[7];
  __IO uint8_t   GPIN;                      /*!< GPIO Port 0 Data Input                */
  __I  uint8_t   RESERVED4[3];
  __IO uint8_t   GPOUT;                     /*!< GPIO Port 0 Data Out                  */
  __I  uint8_t   RESERVED5[3];
  __IO uint8_t   GPSET;                     /*!< GPIO Port 0 Data Out Set              */
  __I  uint8_t   RESERVED6[3];
  __IO uint8_t   GPCLR;                     /*!< GPIO Port 0 Data Out Clear            */
  __I  uint8_t   RESERVED7[3];
  __IO uint8_t   GPTGL;                     /*!< GPIO Port 0 Pin Toggle                */
} ADI_GPIO_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          GP0CON                                     (*(volatile unsigned short int *) 0x40006000)
#define          GP0OEN                                     (*(volatile unsigned char      *) 0x40006004)
#define          GP0PUL                                     (*(volatile unsigned char      *) 0x40006008)
#define          GP0OCE                                     (*(volatile unsigned char      *) 0x4000600C)
#define          GP0IN                                      (*(volatile unsigned char      *) 0x40006014)
#define          GP0OUT                                     (*(volatile unsigned char      *) 0x40006018)
#define          GP0SET                                     (*(volatile unsigned char      *) 0x4000601C)
#define          GP0CLR                                     (*(volatile unsigned char      *) 0x40006020)
#define          GP0TGL                                     (*(volatile unsigned char      *) 0x40006024)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for GP0CON*/
#define GP0CON_RVAL                    0x0

/* GP0CON[CON7] - Configuration bits for Px.7 (not available for port 1). */
#define GP0CON_CON7_MSK                (0x3   << 14 )
#define GP0CON_CON7_GPIOIRQ3           (0x0   << 14 ) /* GPIOIRQ3. GPIO/IRQ3.     */
#define GP0CON_CON7_SPI1CS4            (0x1   << 14 ) /* SPI1CS4. SPI1 CS4 (SPI1). */
#define GP0CON_CON7_UARTCTS            (0x2   << 14 ) /* UARTCTS. UART CTS.       */

