contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GP0CON[CON6] - Configuration bits for Px.6 (not available for port 1). */
#define GP0CON_CON6_MSK                (0x3   << 12 )
#define GP0CON_CON6_GPIOIRQ2           (0x0   << 12 ) /* GPIOIRQ2. GPIO/IRQ2.     */
#define GP0CON_CON6_SPI1CS3            (0x1   << 12 ) /* SPI1CS3. SPI1 CS3 (SPI1). */
#define GP0CON_CON6_UARTRTS            (0x2   << 12 ) /* UARTRTS. UART RTS.       */
#define GP0CON_CON6_PWM0               (0x3   << 12 ) /* PWM0. PWM0.              */

/* GP0CON[CON5] - Configuration bits for Px.5. */
#define GP0CON_CON5_MSK                (0x3   << 10 )
#define GP0CON_CON5_GPIO               (0x0   << 10 ) /* GPIO. GPIO.              */
#define GP0CON_CON5_SPI1CS2            (0x1   << 10 ) /* SPI1CS2. SPI1 CS2 (SPI1). */
#define GP0CON_CON5_ECLKIN             (0x2   << 10 ) /* ECLKIN. ECLKIN.          */

/* GP0CON[CON4] - Configuration bits for Px.4. */
#define GP0CON_CON4_MSK                (0x3   << 8  )
#define GP0CON_CON4_GPIO               (0x0   << 8  ) /* GPIO. GPIO               */
#define GP0CON_CON4_SPI1CS1            (0x1   << 8  ) /* SPI1CS1. SPI1 CS1 (SPI1). */
#define GP0CON_CON4_ECLKOUT            (0x2   << 8  ) /* ECLKOUT. ECLK OUT.       */

/* GP0CON[CON3] - Configuration bits for Px.3. */
#define GP0CON_CON3_MSK                (0x3   << 6  )
#define GP0CON_CON3_GPIOIRQ1           (0x0   << 6  ) /* GPIOIRQ1. GPIO/IRQ1.     */
#define GP0CON_CON3_SPI1CS0            (0x1   << 6  ) /* SPI1CS0. SPI1 CS0  (SPI1). */
#define GP0CON_CON3_ADCCONVST          (0x2   << 6  ) /* ADCCONVST. ADCCONVST.    */
#define GP0CON_CON3_PWM1               (0x3   << 6  ) /* PWM1. PWM1.              */

/* GP0CON[CON2] - Configuration bits for Px.2. */
#define GP0CON_CON2_MSK                (0x3   << 4  )
#define GP0CON_CON2_GPIO               (0x0   << 4  ) /* GPIO. GPIO               */
#define GP0CON_CON2_SPI1MOSI           (0x1   << 4  ) /* SPI1MOSI. SPI MOSI (SPI1). */
#define GP0CON_CON2_PWM0               (0x3   << 4  ) /* PWM0. PWM0               */

/* GP0CON[CON1] - Configuration bits for Px.1. */
#define GP0CON_CON1_MSK                (0x3   << 2  )
#define GP0CON_CON1_GPIO               (0x0   << 2  ) /* GPIO. GPIO.              */
#define GP0CON_CON1_SPI1SCLK           (0x1   << 2  ) /* SPI1SCLK. SPI SCLK (SPI1). */

/* GP0CON[CON0] - Configuration bits for Px.0. */
#define GP0CON_CON0_MSK                (0x3   << 0  )
#define GP0CON_CON0_GPIO               (0x0   << 0  ) /* GPIO. GPIO               */
#define GP0CON_CON0_SPI1MISO           (0x1   << 0  ) /* SPI1MISO. SPI MISO (SPI1) */

/* Reset Value for GP0OEN*/
#define GP0OEN_RVAL                    0x0

/* GP0OEN[OEN7] - Port pin direction. */
#define GP0OEN_OEN7_BBA                (*(volatile unsigned long *) 0x420C009C)
#define GP0OEN_OEN7_MSK                (0x1   << 7  )
#define GP0OEN_OEN7                    (0x1   << 7  )
#define GP0OEN_OEN7_IN                 (0x0   << 7  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP0OEN_OEN7_OUT                (0x1   << 7  ) /* OUT. Enables the output on corresponding port pin. */

/* GP0OEN[OEN6] - Port pin direction. */
#define GP0OEN_OEN6_BBA                (*(volatile unsigned long *) 0x420C0098)
#define GP0OEN_OEN6_MSK                (0x1   << 6  )
#define GP0OEN_OEN6                    (0x1   << 6  )
#define GP0OEN_OEN6_IN                 (0x0   << 6  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP0OEN_OEN6_OUT                (0x1   << 6  ) /* OUT. Enables the output on corresponding port pin. */

/* GP0OEN[OEN5] - Port pin direction. */
#define GP0OEN_OEN5_BBA                (*(volatile unsigned long *) 0x420C0094)
#define GP0OEN_OEN5_MSK                (0x1   << 5  )
#define GP0OEN_OEN5                    (0x1   << 5  )
#define GP0OEN_OEN5_IN                 (0x0   << 5  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP0OEN_OEN5_OUT                (0x1   << 5  ) /* OUT. Enables the output on corresponding port pin. */

/* GP0OEN[OEN4] - Port pin direction. */
#define GP0OEN_OEN4_BBA                (*(volatile unsigned long *) 0x420C0090)
#define GP0OEN_OEN4_MSK                (0x1   << 4  )
#define GP0OEN_OEN4                    (0x1   << 4  )
#define GP0OEN_OEN4_IN                 (0x0   << 4  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP0OEN_OEN4_OUT                (0x1   << 4  ) /* OUT. Enables the output on corresponding port pin. */

/* GP0OEN[OEN3] - Port pin direction. */
#define GP0OEN_OEN3_BBA                (*(volatile unsigned long *) 0x420C008C)
#define GP0OEN_OEN3_MSK                (0x1   << 3  )
#define GP0OEN_OEN3                    (0x1   << 3  )
#define GP0OEN_OEN3_IN                 (0x0   << 3  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP0OEN_OEN3_OUT                (0x1   << 3  ) /* OUT. Enables the output on corresponding port pin. */

/* GP0OEN[OEN2] - Port pin direction. */
#define GP0OEN_OEN2_BBA                (*(volatile unsigned long *) 0x420C0088)
#define GP0OEN_OEN2_MSK                (0x1   << 2  )
#define GP0OEN_OEN2                    (0x1   << 2  )
#define GP0OEN_OEN2_IN                 (0x0   << 2  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP0OEN_OEN2_OUT                (0x1   << 2  ) /* OUT. Enables the output on corresponding port pin. */

/* GP0OEN[OEN1] - Port pin direction. */
#define GP0OEN_OEN1_BBA                (*(volatile unsigned long *) 0x420C0084)
#define GP0OEN_OEN1_MSK                (0x1   << 1  )
#define GP0OEN_OEN1                    (0x1   << 1  )
#define GP0OEN_OEN1_IN                 (0x0   << 1  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP0OEN_OEN1_OUT                (0x1   << 1  ) /* OUT. Enables the output on corresponding port pin. */

/* GP0OEN[OEN0] - Port pin direction. */
#define GP0OEN_OEN0_BBA                (*(volatile unsigned long *) 0x420C0080)
#define GP0OEN_OEN0_MSK                (0x1   << 0  )
#define GP0OEN_OEN0                    (0x1   << 0  )
#define GP0OEN_OEN0_IN                 (0x0   << 0  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP0OEN_OEN0_OUT                (0x1   << 0  ) /* OUT. Enables the output on corresponding port pin.. */

/* Reset Value for GP0PUL*/
#define GP0PUL_RVAL                    0xFF

/* GP0PUL[PUL7] - Pull Up Enable for port pin. */
#define GP0PUL_PUL7_BBA                (*(volatile unsigned long *) 0x420C011C)
#define GP0PUL_PUL7_MSK                (0x1   << 7  )
#define GP0PUL_PUL7                    (0x1   << 7  )
#define GP0PUL_PUL7_DIS                (0x0   << 7  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP0PUL_PUL7_EN                 (0x1   << 7  ) /* EN. Enables the internal pull up on corresponding port pin. */

