contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GP0TGL[TGL5] - Toggle for corresponding port pin. */
#define GP0TGL_TGL5_BBA                (*(volatile unsigned long *) 0x420C0494)
#define GP0TGL_TGL5_MSK                (0x1   << 5  )
#define GP0TGL_TGL5                    (0x1   << 5  )
#define GP0TGL_TGL5_TGL                (0x1   << 5  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP0TGL[TGL4] - Toggle for corresponding port pin. */
#define GP0TGL_TGL4_BBA                (*(volatile unsigned long *) 0x420C0490)
#define GP0TGL_TGL4_MSK                (0x1   << 4  )
#define GP0TGL_TGL4                    (0x1   << 4  )
#define GP0TGL_TGL4_TGL                (0x1   << 4  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP0TGL[TGL3] - Toggle for corresponding port pin. */
#define GP0TGL_TGL3_BBA                (*(volatile unsigned long *) 0x420C048C)
#define GP0TGL_TGL3_MSK                (0x1   << 3  )
#define GP0TGL_TGL3                    (0x1   << 3  )
#define GP0TGL_TGL3_TGL                (0x1   << 3  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP0TGL[TGL2] - Toggle for corresponding port pin. */
#define GP0TGL_TGL2_BBA                (*(volatile unsigned long *) 0x420C0488)
#define GP0TGL_TGL2_MSK                (0x1   << 2  )
#define GP0TGL_TGL2                    (0x1   << 2  )
#define GP0TGL_TGL2_TGL                (0x1   << 2  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP0TGL[TGL1] - Toggle for corresponding port pin. */
#define GP0TGL_TGL1_BBA                (*(volatile unsigned long *) 0x420C0484)
#define GP0TGL_TGL1_MSK                (0x1   << 1  )
#define GP0TGL_TGL1                    (0x1   << 1  )
#define GP0TGL_TGL1_TGL                (0x1   << 1  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP0TGL[TGL0] - Toggle for corresponding port pin. */
#define GP0TGL_TGL0_BBA                (*(volatile unsigned long *) 0x420C0480)
#define GP0TGL_TGL0_MSK                (0x1   << 0  )
#define GP0TGL_TGL0                    (0x1   << 0  )
#define GP0TGL_TGL0_TGL                (0x1   << 0  ) /* TGL. Set by user code to invert the corresponding GPIO. */
#if (__NO_MMR_STRUCTS__==1)

#define          GP1CON                                     (*(volatile unsigned short int *) 0x40006030)
#define          GP1OEN                                     (*(volatile unsigned char      *) 0x40006034)
#define          GP1PUL                                     (*(volatile unsigned char      *) 0x40006038)
#define          GP1OCE                                     (*(volatile unsigned char      *) 0x4000603C)
#define          GP1IN                                      (*(volatile unsigned char      *) 0x40006044)
#define          GP1OUT                                     (*(volatile unsigned char      *) 0x40006048)
#define          GP1SET                                     (*(volatile unsigned char      *) 0x4000604C)
#define          GP1CLR                                     (*(volatile unsigned char      *) 0x40006050)
#define          GP1TGL                                     (*(volatile unsigned char      *) 0x40006054)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for GP1CON*/
#define GP1CON_RVAL                    0x0

/* GP1CON[CON6] - Configuration bits for P1.6 */
#define GP1CON_CON6_MSK                (0x3   << 12 )
#define GP1CON_CON6_GPIO               (0x0   << 12 ) /* GPIO                     */
#define GP1CON_CON6_ADCCONVST          (0x1   << 12 ) /* ADCCONVST                */
#define GP1CON_CON6_PWMSYNC            (0x3   << 12 ) /* PWMSYNC                  */

/* GP1CON[CON5] - Configuration bits for P1.5 */
#define GP1CON_CON5_MSK                (0x3   << 10 )
#define GP1CON_CON5_GPIOIRQ6           (0x0   << 10 ) /* GPIOIRQ6                 */
#define GP1CON_CON5_I2C0SDA            (0x1   << 10 ) /* I2C0SDA                  */
#define GP1CON_CON5_PWM7               (0x2   << 10 ) /* PWM7                     */

/* GP1CON[CON4] - Configuration bits for P1.4 */
#define GP1CON_CON4_MSK                (0x3   << 8  )
#define GP1CON_CON4_GPIOIRQ5           (0x0   << 8  ) /* GPIOIRQ5                 */
#define GP1CON_CON4_I2C0SCL            (0x1   << 8  ) /* I2C0SCL                  */
#define GP1CON_CON4_PWM6               (0x2   << 8  ) /* PWM6                     */

/* GP1CON[CON3] - Configuration bits for P1.3 */
#define GP1CON_CON3_MSK                (0x3   << 6  )
#define GP1CON_CON3_GPIO               (0x1   << 6  ) /* GPIO                     */
#define GP1CON_CON3_PWM5               (0x3   << 6  ) /* PWM5                     */

/* GP1CON[CON2] - Configuration bits for P1.2 */
#define GP1CON_CON2_MSK                (0x3   << 4  )
#define GP1CON_CON2_GPIO               (0x1   << 4  ) /* GPIO                     */
#define GP1CON_CON2_PWM4               (0x3   << 4  ) /* PWM4                     */

/* GP1CON[CON1] - Configuration bits for P1.1 */
#define GP1CON_CON1_MSK                (0x3   << 2  )
#define GP1CON_CON1_PORB               (0x0   << 2  ) /* PORB                     */
#define GP1CON_CON1_GPIO               (0x1   << 2  ) /* GPIO                     */
#define GP1CON_CON1_UART0TXD           (0x2   << 2  ) /* UART0TXD                 */
#define GP1CON_CON1_PWM3               (0x3   << 2  ) /* PWM3                     */

/* GP1CON[CON0] - Configuration bits for P1.0 */
#define GP1CON_CON0_MSK                (0x3   << 0  )
#define GP1CON_CON0_GPIOIRQ4           (0x0   << 0  ) /* GPIOIRQ4                 */
#define GP1CON_CON0_UART0RXD           (0x1   << 0  ) /* UART0RXD                 */
#define GP1CON_CON0_SPI1MOSI           (0x2   << 0  ) /* SPI1MOSI                 */
#define GP1CON_CON0_PWM2               (0x3   << 0  ) /* PWM2                     */

/* Reset Value for GP1OEN*/
#define GP1OEN_RVAL                    0x0

/* GP1OEN[OEN6] - Port pin direction. */
#define GP1OEN_OEN6_BBA                (*(volatile unsigned long *) 0x420C0698)
#define GP1OEN_OEN6_MSK                (0x1   << 6  )
#define GP1OEN_OEN6                    (0x1   << 6  )
#define GP1OEN_OEN6_IN                 (0x0   << 6  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP1OEN_OEN6_OUT                (0x1   << 6  ) /* OUT. Enables the output on corresponding port pin. */

/* GP1OEN[OEN5] - Port pin direction. */
#define GP1OEN_OEN5_BBA                (*(volatile unsigned long *) 0x420C0694)
#define GP1OEN_OEN5_MSK                (0x1   << 5  )
#define GP1OEN_OEN5                    (0x1   << 5  )
#define GP1OEN_OEN5_IN                 (0x0   << 5  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP1OEN_OEN5_OUT                (0x1   << 5  ) /* OUT. Enables the output on corresponding port pin. */

/* GP1OEN[OEN4] - Port pin direction. */
#define GP1OEN_OEN4_BBA                (*(volatile unsigned long *) 0x420C0690)
#define GP1OEN_OEN4_MSK                (0x1   << 4  )
#define GP1OEN_OEN4                    (0x1   << 4  )
#define GP1OEN_OEN4_IN                 (0x0   << 4  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP1OEN_OEN4_OUT                (0x1   << 4  ) /* OUT. Enables the output on corresponding port pin. */

/* GP1OEN[OEN3] - Port pin direction. */
#define GP1OEN_OEN3_BBA                (*(volatile unsigned long *) 0x420C068C)
#define GP1OEN_OEN3_MSK                (0x1   << 3  )
#define GP1OEN_OEN3                    (0x1   << 3  )
#define GP1OEN_OEN3_IN                 (0x0   << 3  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP1OEN_OEN3_OUT                (0x1   << 3  ) /* OUT. Enables the output on corresponding port pin. */

