contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GP2OUT[OUT2] - Output for port pin. */
#define GP2OUT_OUT2_BBA                (*(volatile unsigned long *) 0x420C0F08)
#define GP2OUT_OUT2_MSK                (0x1   << 2  )
#define GP2OUT_OUT2                    (0x1   << 2  )
#define GP2OUT_OUT2_LOW                (0x0   << 2  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP2OUT_OUT2_HIGH               (0x1   << 2  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP2OUT[OUT1] - Output for port pin. */
#define GP2OUT_OUT1_BBA                (*(volatile unsigned long *) 0x420C0F04)
#define GP2OUT_OUT1_MSK                (0x1   << 1  )
#define GP2OUT_OUT1                    (0x1   << 1  )
#define GP2OUT_OUT1_LOW                (0x0   << 1  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP2OUT_OUT1_HIGH               (0x1   << 1  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP2OUT[OUT0] - Output for port pin. */
#define GP2OUT_OUT0_BBA                (*(volatile unsigned long *) 0x420C0F00)
#define GP2OUT_OUT0_MSK                (0x1   << 0  )
#define GP2OUT_OUT0                    (0x1   << 0  )
#define GP2OUT_OUT0_LOW                (0x0   << 0  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP2OUT_OUT0_HIGH               (0x1   << 0  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* Reset Value for GP2SET*/
#define GP2SET_RVAL                    0x0

/* GP2SET[SET7] - Set output high for corresponding port pin. */
#define GP2SET_SET7_BBA                (*(volatile unsigned long *) 0x420C0F9C)
#define GP2SET_SET7_MSK                (0x1   << 7  )
#define GP2SET_SET7                    (0x1   << 7  )
#define GP2SET_SET7_SET                (0x1   << 7  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP2SET[SET6] - Set output high for corresponding port pin. */
#define GP2SET_SET6_BBA                (*(volatile unsigned long *) 0x420C0F98)
#define GP2SET_SET6_MSK                (0x1   << 6  )
#define GP2SET_SET6                    (0x1   << 6  )
#define GP2SET_SET6_SET                (0x1   << 6  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP2SET[SET5] - Set output high for corresponding port pin. */
#define GP2SET_SET5_BBA                (*(volatile unsigned long *) 0x420C0F94)
#define GP2SET_SET5_MSK                (0x1   << 5  )
#define GP2SET_SET5                    (0x1   << 5  )
#define GP2SET_SET5_SET                (0x1   << 5  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP2SET[SET4] - Set output high for corresponding port pin. */
#define GP2SET_SET4_BBA                (*(volatile unsigned long *) 0x420C0F90)
#define GP2SET_SET4_MSK                (0x1   << 4  )
#define GP2SET_SET4                    (0x1   << 4  )
#define GP2SET_SET4_SET                (0x1   << 4  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP2SET[SET3] - Set output high for corresponding port pin. */
#define GP2SET_SET3_BBA                (*(volatile unsigned long *) 0x420C0F8C)
#define GP2SET_SET3_MSK                (0x1   << 3  )
#define GP2SET_SET3                    (0x1   << 3  )
#define GP2SET_SET3_SET                (0x1   << 3  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP2SET[SET2] - Set output high for corresponding port pin. */
#define GP2SET_SET2_BBA                (*(volatile unsigned long *) 0x420C0F88)
#define GP2SET_SET2_MSK                (0x1   << 2  )
#define GP2SET_SET2                    (0x1   << 2  )
#define GP2SET_SET2_SET                (0x1   << 2  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP2SET[SET1] - Set output high for corresponding port pin. */
#define GP2SET_SET1_BBA                (*(volatile unsigned long *) 0x420C0F84)
#define GP2SET_SET1_MSK                (0x1   << 1  )
#define GP2SET_SET1                    (0x1   << 1  )
#define GP2SET_SET1_SET                (0x1   << 1  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP2SET[SET0] - Set output high for corresponding port pin. */
#define GP2SET_SET0_BBA                (*(volatile unsigned long *) 0x420C0F80)
#define GP2SET_SET0_MSK                (0x1   << 0  )
#define GP2SET_SET0                    (0x1   << 0  )
#define GP2SET_SET0_SET                (0x1   << 0  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* Reset Value for GP2CLR*/
#define GP2CLR_RVAL                    0x0

/* GP2CLR[CLR7] - Set by user code to drive the corresponding GPIO low. */
#define GP2CLR_CLR7_BBA                (*(volatile unsigned long *) 0x420C101C)
#define GP2CLR_CLR7_MSK                (0x1   << 7  )
#define GP2CLR_CLR7                    (0x1   << 7  )
#define GP2CLR_CLR7_CLR                (0x1   << 7  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP2CLR[CLR6] - Set by user code to drive the corresponding GPIO low. */
#define GP2CLR_CLR6_BBA                (*(volatile unsigned long *) 0x420C1018)
#define GP2CLR_CLR6_MSK                (0x1   << 6  )
#define GP2CLR_CLR6                    (0x1   << 6  )
#define GP2CLR_CLR6_CLR                (0x1   << 6  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP2CLR[CLR5] - Set by user code to drive the corresponding GPIO low. */
#define GP2CLR_CLR5_BBA                (*(volatile unsigned long *) 0x420C1014)
#define GP2CLR_CLR5_MSK                (0x1   << 5  )
#define GP2CLR_CLR5                    (0x1   << 5  )
#define GP2CLR_CLR5_CLR                (0x1   << 5  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP2CLR[CLR4] - Set by user code to drive the corresponding GPIO low. */
#define GP2CLR_CLR4_BBA                (*(volatile unsigned long *) 0x420C1010)
#define GP2CLR_CLR4_MSK                (0x1   << 4  )
#define GP2CLR_CLR4                    (0x1   << 4  )
#define GP2CLR_CLR4_CLR                (0x1   << 4  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP2CLR[CLR3] - Set by user code to drive the corresponding GPIO low. */
#define GP2CLR_CLR3_BBA                (*(volatile unsigned long *) 0x420C100C)
#define GP2CLR_CLR3_MSK                (0x1   << 3  )
#define GP2CLR_CLR3                    (0x1   << 3  )
#define GP2CLR_CLR3_CLR                (0x1   << 3  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP2CLR[CLR2] - Set by user code to drive the corresponding GPIO low. */
#define GP2CLR_CLR2_BBA                (*(volatile unsigned long *) 0x420C1008)
#define GP2CLR_CLR2_MSK                (0x1   << 2  )
#define GP2CLR_CLR2                    (0x1   << 2  )
#define GP2CLR_CLR2_CLR                (0x1   << 2  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP2CLR[CLR1] - Set by user code to drive the corresponding GPIO low. */
#define GP2CLR_CLR1_BBA                (*(volatile unsigned long *) 0x420C1004)
#define GP2CLR_CLR1_MSK                (0x1   << 1  )
#define GP2CLR_CLR1                    (0x1   << 1  )
#define GP2CLR_CLR1_CLR                (0x1   << 1  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

