contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GP2CLR[CLR0] - Set by user code to drive the corresponding GPIO low. */
#define GP2CLR_CLR0_BBA                (*(volatile unsigned long *) 0x420C1000)
#define GP2CLR_CLR0_MSK                (0x1   << 0  )
#define GP2CLR_CLR0                    (0x1   << 0  )
#define GP2CLR_CLR0_CLR                (0x1   << 0  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* Reset Value for GP2TGL*/
#define GP2TGL_RVAL                    0x0

/* GP2TGL[TGL7] - Toggle for corresponding port pin. */
#define GP2TGL_TGL7_BBA                (*(volatile unsigned long *) 0x420C109C)
#define GP2TGL_TGL7_MSK                (0x1   << 7  )
#define GP2TGL_TGL7                    (0x1   << 7  )
#define GP2TGL_TGL7_TGL                (0x1   << 7  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP2TGL[TGL6] - Toggle for corresponding port pin. */
#define GP2TGL_TGL6_BBA                (*(volatile unsigned long *) 0x420C1098)
#define GP2TGL_TGL6_MSK                (0x1   << 6  )
#define GP2TGL_TGL6                    (0x1   << 6  )
#define GP2TGL_TGL6_TGL                (0x1   << 6  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP2TGL[TGL5] - Toggle for corresponding port pin. */
#define GP2TGL_TGL5_BBA                (*(volatile unsigned long *) 0x420C1094)
#define GP2TGL_TGL5_MSK                (0x1   << 5  )
#define GP2TGL_TGL5                    (0x1   << 5  )
#define GP2TGL_TGL5_TGL                (0x1   << 5  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP2TGL[TGL4] - Toggle for corresponding port pin. */
#define GP2TGL_TGL4_BBA                (*(volatile unsigned long *) 0x420C1090)
#define GP2TGL_TGL4_MSK                (0x1   << 4  )
#define GP2TGL_TGL4                    (0x1   << 4  )
#define GP2TGL_TGL4_TGL                (0x1   << 4  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP2TGL[TGL3] - Toggle for corresponding port pin. */
#define GP2TGL_TGL3_BBA                (*(volatile unsigned long *) 0x420C108C)
#define GP2TGL_TGL3_MSK                (0x1   << 3  )
#define GP2TGL_TGL3                    (0x1   << 3  )
#define GP2TGL_TGL3_TGL                (0x1   << 3  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP2TGL[TGL2] - Toggle for corresponding port pin. */
#define GP2TGL_TGL2_BBA                (*(volatile unsigned long *) 0x420C1088)
#define GP2TGL_TGL2_MSK                (0x1   << 2  )
#define GP2TGL_TGL2                    (0x1   << 2  )
#define GP2TGL_TGL2_TGL                (0x1   << 2  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP2TGL[TGL1] - Toggle for corresponding port pin. */
#define GP2TGL_TGL1_BBA                (*(volatile unsigned long *) 0x420C1084)
#define GP2TGL_TGL1_MSK                (0x1   << 1  )
#define GP2TGL_TGL1                    (0x1   << 1  )
#define GP2TGL_TGL1_TGL                (0x1   << 1  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP2TGL[TGL0] - Toggle for corresponding port pin. */
#define GP2TGL_TGL0_BBA                (*(volatile unsigned long *) 0x420C1080)
#define GP2TGL_TGL0_MSK                (0x1   << 0  )
#define GP2TGL_TGL0                    (0x1   << 0  )
#define GP2TGL_TGL0_TGL                (0x1   << 0  ) /* TGL. Set by user code to invert the corresponding GPIO. */
#if (__NO_MMR_STRUCTS__==1)

#define          GP3CON                                     (*(volatile unsigned short int *) 0x40006090)
#define          GP3OEN                                     (*(volatile unsigned char      *) 0x40006094)
#define          GP3PUL                                     (*(volatile unsigned char      *) 0x40006098)
#define          GP3OCE                                     (*(volatile unsigned char      *) 0x4000609C)
#define          GP3IN                                      (*(volatile unsigned char      *) 0x400060A4)
#define          GP3OUT                                     (*(volatile unsigned char      *) 0x400060A8)
#define          GP3SET                                     (*(volatile unsigned char      *) 0x400060AC)
#define          GP3CLR                                     (*(volatile unsigned char      *) 0x400060B0)
#define          GP3TGL                                     (*(volatile unsigned char      *) 0x400060B4)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for GP3CON*/
#define GP3CON_RVAL                    0x0

/* GP3CON[CON7] - Configuration bits for P3.7 */
#define GP3CON_CON7_MSK                (0x3   << 14 )
#define GP3CON_CON7_GPIOIRQ0           (0x1   << 14 ) /* GPIOIRQ0                 */

/* GP3CON[CON6] - Configuration bits for P3.6 */
#define GP3CON_CON6_MSK                (0x3   << 12 )
#define GP3CON_CON6_GPIO               (0x1   << 12 ) /* GPIO                     */

/* GP3CON[CON5] - Configuration bits for P3.5 */
#define GP3CON_CON5_MSK                (0x3   << 10 )
#define GP3CON_CON5_GPIO               (0x1   << 10 ) /* GPIO                     */
#define GP3CON_CON5_SPI0MOSI           (0x3   << 10 ) /* SPI0MOSI                 */

/* GP3CON[CON4] - Configuration bits for P3.4 */
#define GP3CON_CON4_MSK                (0x3   << 8  )
#define GP3CON_CON4_GPIO               (0x1   << 8  ) /* GPIO                     */

/* GP3CON[CON3] - Configuration bits for P3.3 */
#define GP3CON_CON3_MSK                (0x3   << 6  )
#define GP3CON_CON3_GPIO               (0x1   << 6  ) /* GPIO                     */
#define GP3CON_CON3_PWMTRIP            (0x2   << 6  ) /* PWMTRIP                  */
#define GP3CON_CON3_SPI0SCLK           (0x3   << 6  ) /* SPI0SCLK                 */

/* GP3CON[CON2] - Configuration bits for P3.2 */
#define GP3CON_CON2_MSK                (0x3   << 4  )
#define GP3CON_CON2_GPIO               (0x1   << 4  ) /* GPIO                     */
#define GP3CON_CON2_PWMSYNC            (0x2   << 4  ) /* PWMSYNC                  */
#define GP3CON_CON2_SPI0MISO           (0x3   << 4  ) /* SPI0MISO                 */

/* GP3CON[CON1] - Configuration bits for P3.1 */
#define GP3CON_CON1_MSK                (0x3   << 2  )
#define GP3CON_CON1_GPIO               (0x0   << 2  ) /* GPIO                     */

/* GP3CON[CON0] - Configuration bits for P3.0 */
#define GP3CON_CON0_MSK                (0x3   << 0  )
#define GP3CON_CON0_GPIO               (0x0   << 0  ) /* GPIO                     */
#define GP3CON_CON0_PWMTRIP            (0x3   << 0  ) /* PWMTRIP                  */

/* Reset Value for GP3OEN*/
#define GP3OEN_RVAL                    0x0

/* GP3OEN[OEN7] - Port pin direction. */
#define GP3OEN_OEN7_BBA                (*(volatile unsigned long *) 0x420C129C)
#define GP3OEN_OEN7_MSK                (0x1   << 7  )
#define GP3OEN_OEN7                    (0x1   << 7  )
#define GP3OEN_OEN7_IN                 (0x0   << 7  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP3OEN_OEN7_OUT                (0x1   << 7  ) /* OUT. Enables the output on corresponding port pin. */

