contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GP3OEN[OEN6] - Port pin direction. */
#define GP3OEN_OEN6_BBA                (*(volatile unsigned long *) 0x420C1298)
#define GP3OEN_OEN6_MSK                (0x1   << 6  )
#define GP3OEN_OEN6                    (0x1   << 6  )
#define GP3OEN_OEN6_IN                 (0x0   << 6  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP3OEN_OEN6_OUT                (0x1   << 6  ) /* OUT. Enables the output on corresponding port pin. */

/* GP3OEN[OEN5] - Port pin direction. */
#define GP3OEN_OEN5_BBA                (*(volatile unsigned long *) 0x420C1294)
#define GP3OEN_OEN5_MSK                (0x1   << 5  )
#define GP3OEN_OEN5                    (0x1   << 5  )
#define GP3OEN_OEN5_IN                 (0x0   << 5  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP3OEN_OEN5_OUT                (0x1   << 5  ) /* OUT. Enables the output on corresponding port pin. */

/* GP3OEN[OEN4] - Port pin direction. */
#define GP3OEN_OEN4_BBA                (*(volatile unsigned long *) 0x420C1290)
#define GP3OEN_OEN4_MSK                (0x1   << 4  )
#define GP3OEN_OEN4                    (0x1   << 4  )
#define GP3OEN_OEN4_IN                 (0x0   << 4  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP3OEN_OEN4_OUT                (0x1   << 4  ) /* OUT. Enables the output on corresponding port pin. */

/* GP3OEN[OEN3] - Port pin direction. */
#define GP3OEN_OEN3_BBA                (*(volatile unsigned long *) 0x420C128C)
#define GP3OEN_OEN3_MSK                (0x1   << 3  )
#define GP3OEN_OEN3                    (0x1   << 3  )
#define GP3OEN_OEN3_IN                 (0x0   << 3  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP3OEN_OEN3_OUT                (0x1   << 3  ) /* OUT. Enables the output on corresponding port pin. */

/* GP3OEN[OEN2] - Port pin direction. */
#define GP3OEN_OEN2_BBA                (*(volatile unsigned long *) 0x420C1288)
#define GP3OEN_OEN2_MSK                (0x1   << 2  )
#define GP3OEN_OEN2                    (0x1   << 2  )
#define GP3OEN_OEN2_IN                 (0x0   << 2  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP3OEN_OEN2_OUT                (0x1   << 2  ) /* OUT. Enables the output on corresponding port pin. */

/* GP3OEN[OEN1] - Port pin direction. */
#define GP3OEN_OEN1_BBA                (*(volatile unsigned long *) 0x420C1284)
#define GP3OEN_OEN1_MSK                (0x1   << 1  )
#define GP3OEN_OEN1                    (0x1   << 1  )
#define GP3OEN_OEN1_IN                 (0x0   << 1  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP3OEN_OEN1_OUT                (0x1   << 1  ) /* OUT. Enables the output on corresponding port pin. */

/* GP3OEN[OEN0] - Port pin direction. */
#define GP3OEN_OEN0_BBA                (*(volatile unsigned long *) 0x420C1280)
#define GP3OEN_OEN0_MSK                (0x1   << 0  )
#define GP3OEN_OEN0                    (0x1   << 0  )
#define GP3OEN_OEN0_IN                 (0x0   << 0  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP3OEN_OEN0_OUT                (0x1   << 0  ) /* OUT. Enables the output on corresponding port pin. */

/* Reset Value for GP3PUL*/
#define GP3PUL_RVAL                    0xFF

/* GP3PUL[PUL7] - Pull Up Enable for port pin. */
#define GP3PUL_PUL7_BBA                (*(volatile unsigned long *) 0x420C131C)
#define GP3PUL_PUL7_MSK                (0x1   << 7  )
#define GP3PUL_PUL7                    (0x1   << 7  )
#define GP3PUL_PUL7_DIS                (0x0   << 7  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP3PUL_PUL7_EN                 (0x1   << 7  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP3PUL[PUL6] - Pull Up Enable for port pin. */
#define GP3PUL_PUL6_BBA                (*(volatile unsigned long *) 0x420C1318)
#define GP3PUL_PUL6_MSK                (0x1   << 6  )
#define GP3PUL_PUL6                    (0x1   << 6  )
#define GP3PUL_PUL6_DIS                (0x0   << 6  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP3PUL_PUL6_EN                 (0x1   << 6  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP3PUL[PUL5] - Pull Up Enable for port pin. */
#define GP3PUL_PUL5_BBA                (*(volatile unsigned long *) 0x420C1314)
#define GP3PUL_PUL5_MSK                (0x1   << 5  )
#define GP3PUL_PUL5                    (0x1   << 5  )
#define GP3PUL_PUL5_DIS                (0x0   << 5  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP3PUL_PUL5_EN                 (0x1   << 5  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP3PUL[PUL4] - Pull Up Enable for port pin. */
#define GP3PUL_PUL4_BBA                (*(volatile unsigned long *) 0x420C1310)
#define GP3PUL_PUL4_MSK                (0x1   << 4  )
#define GP3PUL_PUL4                    (0x1   << 4  )
#define GP3PUL_PUL4_DIS                (0x0   << 4  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP3PUL_PUL4_EN                 (0x1   << 4  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP3PUL[PUL3] - Pull Up Enable for port pin. */
#define GP3PUL_PUL3_BBA                (*(volatile unsigned long *) 0x420C130C)
#define GP3PUL_PUL3_MSK                (0x1   << 3  )
#define GP3PUL_PUL3                    (0x1   << 3  )
#define GP3PUL_PUL3_DIS                (0x0   << 3  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP3PUL_PUL3_EN                 (0x1   << 3  ) /* EN. Enables the internal pull up oncorresponding port pin. */

/* GP3PUL[PUL2] - Pull Up Enable for port pin. */
#define GP3PUL_PUL2_BBA                (*(volatile unsigned long *) 0x420C1308)
#define GP3PUL_PUL2_MSK                (0x1   << 2  )
#define GP3PUL_PUL2                    (0x1   << 2  )
#define GP3PUL_PUL2_DIS                (0x0   << 2  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP3PUL_PUL2_EN                 (0x1   << 2  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP3PUL[PUL1] - Pull Up Enable for port pin. */
#define GP3PUL_PUL1_BBA                (*(volatile unsigned long *) 0x420C1304)
#define GP3PUL_PUL1_MSK                (0x1   << 1  )
#define GP3PUL_PUL1                    (0x1   << 1  )
#define GP3PUL_PUL1_DIS                (0x0   << 1  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP3PUL_PUL1_EN                 (0x1   << 1  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP3PUL[PUL0] - Pull Up Enable for port pin. */
#define GP3PUL_PUL0_BBA                (*(volatile unsigned long *) 0x420C1300)
#define GP3PUL_PUL0_MSK                (0x1   << 0  )
#define GP3PUL_PUL0                    (0x1   << 0  )
#define GP3PUL_PUL0_DIS                (0x0   << 0  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP3PUL_PUL0_EN                 (0x1   << 0  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* Reset Value for GP3OCE*/
#define GP3OCE_RVAL                    0x0

