contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GP3OCE[OCE7] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP3OCE_OCE7_BBA                (*(volatile unsigned long *) 0x420C139C)
#define GP3OCE_OCE7_MSK                (0x1   << 7  )
#define GP3OCE_OCE7                    (0x1   << 7  )
#define GP3OCE_OCE7_DIS                (0x0   << 7  ) /* DIS                      */
#define GP3OCE_OCE7_EN                 (0x1   << 7  ) /* EN                       */

/* GP3OCE[OCE6] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP3OCE_OCE6_BBA                (*(volatile unsigned long *) 0x420C1398)
#define GP3OCE_OCE6_MSK                (0x1   << 6  )
#define GP3OCE_OCE6                    (0x1   << 6  )
#define GP3OCE_OCE6_DIS                (0x0   << 6  ) /* DIS                      */
#define GP3OCE_OCE6_EN                 (0x1   << 6  ) /* EN                       */

/* GP3OCE[OCE5] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP3OCE_OCE5_BBA                (*(volatile unsigned long *) 0x420C1394)
#define GP3OCE_OCE5_MSK                (0x1   << 5  )
#define GP3OCE_OCE5                    (0x1   << 5  )
#define GP3OCE_OCE5_DIS                (0x0   << 5  ) /* DIS                      */
#define GP3OCE_OCE5_EN                 (0x1   << 5  ) /* EN                       */

/* GP3OCE[OCE4] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP3OCE_OCE4_BBA                (*(volatile unsigned long *) 0x420C1390)
#define GP3OCE_OCE4_MSK                (0x1   << 4  )
#define GP3OCE_OCE4                    (0x1   << 4  )
#define GP3OCE_OCE4_DIS                (0x0   << 4  ) /* DIS                      */
#define GP3OCE_OCE4_EN                 (0x1   << 4  ) /* EN                       */

/* GP3OCE[OCE3] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP3OCE_OCE3_BBA                (*(volatile unsigned long *) 0x420C138C)
#define GP3OCE_OCE3_MSK                (0x1   << 3  )
#define GP3OCE_OCE3                    (0x1   << 3  )
#define GP3OCE_OCE3_DIS                (0x0   << 3  ) /* DIS                      */
#define GP3OCE_OCE3_EN                 (0x1   << 3  ) /* EN                       */

/* GP3OCE[OCE2] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP3OCE_OCE2_BBA                (*(volatile unsigned long *) 0x420C1388)
#define GP3OCE_OCE2_MSK                (0x1   << 2  )
#define GP3OCE_OCE2                    (0x1   << 2  )
#define GP3OCE_OCE2_DIS                (0x0   << 2  ) /* DIS                      */
#define GP3OCE_OCE2_EN                 (0x1   << 2  ) /* EN                       */

/* GP3OCE[OCE1] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP3OCE_OCE1_BBA                (*(volatile unsigned long *) 0x420C1384)
#define GP3OCE_OCE1_MSK                (0x1   << 1  )
#define GP3OCE_OCE1                    (0x1   << 1  )
#define GP3OCE_OCE1_DIS                (0x0   << 1  ) /* DIS                      */
#define GP3OCE_OCE1_EN                 (0x1   << 1  ) /* EN                       */

/* GP3OCE[OCE0] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP3OCE_OCE0_BBA                (*(volatile unsigned long *) 0x420C1380)
#define GP3OCE_OCE0_MSK                (0x1   << 0  )
#define GP3OCE_OCE0                    (0x1   << 0  )
#define GP3OCE_OCE0_DIS                (0x0   << 0  ) /* DIS                      */
#define GP3OCE_OCE0_EN                 (0x1   << 0  ) /* EN                       */

/* Reset Value for GP3IN*/
#define GP3IN_RVAL                     0xFF

/* GP3IN[IN7] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP3IN_IN7_BBA                  (*(volatile unsigned long *) 0x420C149C)
#define GP3IN_IN7_MSK                  (0x1   << 7  )
#define GP3IN_IN7                      (0x1   << 7  )
#define GP3IN_IN7_LOW                  (0x0   << 7  ) /* LOW                      */
#define GP3IN_IN7_HIGH                 (0x1   << 7  ) /* HIGH                     */

/* GP3IN[IN6] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP3IN_IN6_BBA                  (*(volatile unsigned long *) 0x420C1498)
#define GP3IN_IN6_MSK                  (0x1   << 6  )
#define GP3IN_IN6                      (0x1   << 6  )
#define GP3IN_IN6_LOW                  (0x0   << 6  ) /* LOW                      */
#define GP3IN_IN6_HIGH                 (0x1   << 6  ) /* HIGH                     */

/* GP3IN[IN5] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP3IN_IN5_BBA                  (*(volatile unsigned long *) 0x420C1494)
#define GP3IN_IN5_MSK                  (0x1   << 5  )
#define GP3IN_IN5                      (0x1   << 5  )
#define GP3IN_IN5_LOW                  (0x0   << 5  ) /* LOW                      */
#define GP3IN_IN5_HIGH                 (0x1   << 5  ) /* HIGH                     */

/* GP3IN[IN4] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP3IN_IN4_BBA                  (*(volatile unsigned long *) 0x420C1490)
#define GP3IN_IN4_MSK                  (0x1   << 4  )
#define GP3IN_IN4                      (0x1   << 4  )
#define GP3IN_IN4_LOW                  (0x0   << 4  ) /* LOW                      */
#define GP3IN_IN4_HIGH                 (0x1   << 4  ) /* HIGH                     */

/* GP3IN[IN3] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP3IN_IN3_BBA                  (*(volatile unsigned long *) 0x420C148C)
#define GP3IN_IN3_MSK                  (0x1   << 3  )
#define GP3IN_IN3                      (0x1   << 3  )
#define GP3IN_IN3_LOW                  (0x0   << 3  ) /* LOW                      */
#define GP3IN_IN3_HIGH                 (0x1   << 3  ) /* HIGH                     */

/* GP3IN[IN2] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP3IN_IN2_BBA                  (*(volatile unsigned long *) 0x420C1488)
#define GP3IN_IN2_MSK                  (0x1   << 2  )
#define GP3IN_IN2                      (0x1   << 2  )
#define GP3IN_IN2_LOW                  (0x0   << 2  ) /* LOW                      */
#define GP3IN_IN2_HIGH                 (0x1   << 2  ) /* HIGH                     */

/* GP3IN[IN1] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP3IN_IN1_BBA                  (*(volatile unsigned long *) 0x420C1484)
#define GP3IN_IN1_MSK                  (0x1   << 1  )
#define GP3IN_IN1                      (0x1   << 1  )
#define GP3IN_IN1_LOW                  (0x0   << 1  ) /* LOW                      */
#define GP3IN_IN1_HIGH                 (0x1   << 1  ) /* HIGH                     */

/* GP3IN[IN0] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP3IN_IN0_BBA                  (*(volatile unsigned long *) 0x420C1480)
#define GP3IN_IN0_MSK                  (0x1   << 0  )
#define GP3IN_IN0                      (0x1   << 0  )
#define GP3IN_IN0_LOW                  (0x0   << 0  ) /* LOW                      */
#define GP3IN_IN0_HIGH                 (0x1   << 0  ) /* HIGH                     */

/* Reset Value for GP3OUT*/
#define GP3OUT_RVAL                    0x0

