contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GP3OUT[OUT7] - Output for port pin. */
#define GP3OUT_OUT7_BBA                (*(volatile unsigned long *) 0x420C151C)
#define GP3OUT_OUT7_MSK                (0x1   << 7  )
#define GP3OUT_OUT7                    (0x1   << 7  )
#define GP3OUT_OUT7_LOW                (0x0   << 7  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP3OUT_OUT7_HIGH               (0x1   << 7  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP3OUT[OUT6] - Output for port pin. */
#define GP3OUT_OUT6_BBA                (*(volatile unsigned long *) 0x420C1518)
#define GP3OUT_OUT6_MSK                (0x1   << 6  )
#define GP3OUT_OUT6                    (0x1   << 6  )
#define GP3OUT_OUT6_LOW                (0x0   << 6  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP3OUT_OUT6_HIGH               (0x1   << 6  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP3OUT[OUT5] - Output for port pin. */
#define GP3OUT_OUT5_BBA                (*(volatile unsigned long *) 0x420C1514)
#define GP3OUT_OUT5_MSK                (0x1   << 5  )
#define GP3OUT_OUT5                    (0x1   << 5  )
#define GP3OUT_OUT5_LOW                (0x0   << 5  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP3OUT_OUT5_HIGH               (0x1   << 5  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP3OUT[OUT4] - Output for port pin. */
#define GP3OUT_OUT4_BBA                (*(volatile unsigned long *) 0x420C1510)
#define GP3OUT_OUT4_MSK                (0x1   << 4  )
#define GP3OUT_OUT4                    (0x1   << 4  )
#define GP3OUT_OUT4_LOW                (0x0   << 4  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP3OUT_OUT4_HIGH               (0x1   << 4  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP3OUT[OUT3] - Output for port pin. */
#define GP3OUT_OUT3_BBA                (*(volatile unsigned long *) 0x420C150C)
#define GP3OUT_OUT3_MSK                (0x1   << 3  )
#define GP3OUT_OUT3                    (0x1   << 3  )
#define GP3OUT_OUT3_LOW                (0x0   << 3  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP3OUT_OUT3_HIGH               (0x1   << 3  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP3OUT[OUT2] - Output for port pin. */
#define GP3OUT_OUT2_BBA                (*(volatile unsigned long *) 0x420C1508)
#define GP3OUT_OUT2_MSK                (0x1   << 2  )
#define GP3OUT_OUT2                    (0x1   << 2  )
#define GP3OUT_OUT2_LOW                (0x0   << 2  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP3OUT_OUT2_HIGH               (0x1   << 2  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP3OUT[OUT1] - Output for port pin. */
#define GP3OUT_OUT1_BBA                (*(volatile unsigned long *) 0x420C1504)
#define GP3OUT_OUT1_MSK                (0x1   << 1  )
#define GP3OUT_OUT1                    (0x1   << 1  )
#define GP3OUT_OUT1_LOW                (0x0   << 1  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP3OUT_OUT1_HIGH               (0x1   << 1  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP3OUT[OUT0] - Output for port pin. */
#define GP3OUT_OUT0_BBA                (*(volatile unsigned long *) 0x420C1500)
#define GP3OUT_OUT0_MSK                (0x1   << 0  )
#define GP3OUT_OUT0                    (0x1   << 0  )
#define GP3OUT_OUT0_LOW                (0x0   << 0  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP3OUT_OUT0_HIGH               (0x1   << 0  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* Reset Value for GP3SET*/
#define GP3SET_RVAL                    0x0

/* GP3SET[SET7] - Set output high for corresponding port pin. */
#define GP3SET_SET7_BBA                (*(volatile unsigned long *) 0x420C159C)
#define GP3SET_SET7_MSK                (0x1   << 7  )
#define GP3SET_SET7                    (0x1   << 7  )
#define GP3SET_SET7_SET                (0x1   << 7  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP3SET[SET6] - Set output high for corresponding port pin. */
#define GP3SET_SET6_BBA                (*(volatile unsigned long *) 0x420C1598)
#define GP3SET_SET6_MSK                (0x1   << 6  )
#define GP3SET_SET6                    (0x1   << 6  )
#define GP3SET_SET6_SET                (0x1   << 6  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP3SET[SET5] - Set output high for corresponding port pin. */
#define GP3SET_SET5_BBA                (*(volatile unsigned long *) 0x420C1594)
#define GP3SET_SET5_MSK                (0x1   << 5  )
#define GP3SET_SET5                    (0x1   << 5  )
#define GP3SET_SET5_SET                (0x1   << 5  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP3SET[SET4] - Set output high for corresponding port pin. */
#define GP3SET_SET4_BBA                (*(volatile unsigned long *) 0x420C1590)
#define GP3SET_SET4_MSK                (0x1   << 4  )
#define GP3SET_SET4                    (0x1   << 4  )
#define GP3SET_SET4_SET                (0x1   << 4  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP3SET[SET3] - Set output high for corresponding port pin. */
#define GP3SET_SET3_BBA                (*(volatile unsigned long *) 0x420C158C)
#define GP3SET_SET3_MSK                (0x1   << 3  )
#define GP3SET_SET3                    (0x1   << 3  )
#define GP3SET_SET3_SET                (0x1   << 3  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP3SET[SET2] - Set output high for corresponding port pin. */
#define GP3SET_SET2_BBA                (*(volatile unsigned long *) 0x420C1588)
#define GP3SET_SET2_MSK                (0x1   << 2  )
#define GP3SET_SET2                    (0x1   << 2  )
#define GP3SET_SET2_SET                (0x1   << 2  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP3SET[SET1] - Set output high for corresponding port pin. */
#define GP3SET_SET1_BBA                (*(volatile unsigned long *) 0x420C1584)
#define GP3SET_SET1_MSK                (0x1   << 1  )
#define GP3SET_SET1                    (0x1   << 1  )
#define GP3SET_SET1_SET                (0x1   << 1  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* GP3SET[SET0] - Set output high for corresponding port pin. */
#define GP3SET_SET0_BBA                (*(volatile unsigned long *) 0x420C1580)
#define GP3SET_SET0_MSK                (0x1   << 0  )
#define GP3SET_SET0                    (0x1   << 0  )
#define GP3SET_SET0_SET                (0x1   << 0  ) /* SET. Set by user code to drive the corresponding GPIO high. */

/* Reset Value for GP3CLR*/
#define GP3CLR_RVAL                    0x0

