contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GP3CLR[CLR7] - Set by user code to drive the corresponding GPIO low. */
#define GP3CLR_CLR7_BBA                (*(volatile unsigned long *) 0x420C161C)
#define GP3CLR_CLR7_MSK                (0x1   << 7  )
#define GP3CLR_CLR7                    (0x1   << 7  )
#define GP3CLR_CLR7_CLR                (0x1   << 7  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP3CLR[CLR6] - Set by user code to drive the corresponding GPIO low. */
#define GP3CLR_CLR6_BBA                (*(volatile unsigned long *) 0x420C1618)
#define GP3CLR_CLR6_MSK                (0x1   << 6  )
#define GP3CLR_CLR6                    (0x1   << 6  )
#define GP3CLR_CLR6_CLR                (0x1   << 6  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP3CLR[CLR5] - Set by user code to drive the corresponding GPIO low. */
#define GP3CLR_CLR5_BBA                (*(volatile unsigned long *) 0x420C1614)
#define GP3CLR_CLR5_MSK                (0x1   << 5  )
#define GP3CLR_CLR5                    (0x1   << 5  )
#define GP3CLR_CLR5_CLR                (0x1   << 5  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP3CLR[CLR4] - Set by user code to drive the corresponding GPIO low. */
#define GP3CLR_CLR4_BBA                (*(volatile unsigned long *) 0x420C1610)
#define GP3CLR_CLR4_MSK                (0x1   << 4  )
#define GP3CLR_CLR4                    (0x1   << 4  )
#define GP3CLR_CLR4_CLR                (0x1   << 4  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP3CLR[CLR3] - Set by user code to drive the corresponding GPIO low. */
#define GP3CLR_CLR3_BBA                (*(volatile unsigned long *) 0x420C160C)
#define GP3CLR_CLR3_MSK                (0x1   << 3  )
#define GP3CLR_CLR3                    (0x1   << 3  )
#define GP3CLR_CLR3_CLR                (0x1   << 3  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP3CLR[CLR2] - Set by user code to drive the corresponding GPIO low. */
#define GP3CLR_CLR2_BBA                (*(volatile unsigned long *) 0x420C1608)
#define GP3CLR_CLR2_MSK                (0x1   << 2  )
#define GP3CLR_CLR2                    (0x1   << 2  )
#define GP3CLR_CLR2_CLR                (0x1   << 2  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP3CLR[CLR1] - Set by user code to drive the corresponding GPIO low. */
#define GP3CLR_CLR1_BBA                (*(volatile unsigned long *) 0x420C1604)
#define GP3CLR_CLR1_MSK                (0x1   << 1  )
#define GP3CLR_CLR1                    (0x1   << 1  )
#define GP3CLR_CLR1_CLR                (0x1   << 1  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP3CLR[CLR0] - Set by user code to drive the corresponding GPIO low. */
#define GP3CLR_CLR0_BBA                (*(volatile unsigned long *) 0x420C1600)
#define GP3CLR_CLR0_MSK                (0x1   << 0  )
#define GP3CLR_CLR0                    (0x1   << 0  )
#define GP3CLR_CLR0_CLR                (0x1   << 0  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* Reset Value for GP3TGL*/
#define GP3TGL_RVAL                    0x0

/* GP3TGL[TGL7] - Toggle for corresponding port pin. */
#define GP3TGL_TGL7_BBA                (*(volatile unsigned long *) 0x420C169C)
#define GP3TGL_TGL7_MSK                (0x1   << 7  )
#define GP3TGL_TGL7                    (0x1   << 7  )
#define GP3TGL_TGL7_TGL                (0x1   << 7  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP3TGL[TGL6] - Toggle for corresponding port pin. */
#define GP3TGL_TGL6_BBA                (*(volatile unsigned long *) 0x420C1698)
#define GP3TGL_TGL6_MSK                (0x1   << 6  )
#define GP3TGL_TGL6                    (0x1   << 6  )
#define GP3TGL_TGL6_TGL                (0x1   << 6  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP3TGL[TGL5] - Toggle for corresponding port pin. */
#define GP3TGL_TGL5_BBA                (*(volatile unsigned long *) 0x420C1694)
#define GP3TGL_TGL5_MSK                (0x1   << 5  )
#define GP3TGL_TGL5                    (0x1   << 5  )
#define GP3TGL_TGL5_TGL                (0x1   << 5  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP3TGL[TGL4] - Toggle for corresponding port pin. */
#define GP3TGL_TGL4_BBA                (*(volatile unsigned long *) 0x420C1690)
#define GP3TGL_TGL4_MSK                (0x1   << 4  )
#define GP3TGL_TGL4                    (0x1   << 4  )
#define GP3TGL_TGL4_TGL                (0x1   << 4  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP3TGL[TGL3] - Toggle for corresponding port pin. */
#define GP3TGL_TGL3_BBA                (*(volatile unsigned long *) 0x420C168C)
#define GP3TGL_TGL3_MSK                (0x1   << 3  )
#define GP3TGL_TGL3                    (0x1   << 3  )
#define GP3TGL_TGL3_TGL                (0x1   << 3  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP3TGL[TGL2] - Toggle for corresponding port pin. */
#define GP3TGL_TGL2_BBA                (*(volatile unsigned long *) 0x420C1688)
#define GP3TGL_TGL2_MSK                (0x1   << 2  )
#define GP3TGL_TGL2                    (0x1   << 2  )
#define GP3TGL_TGL2_TGL                (0x1   << 2  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP3TGL[TGL1] - Toggle for corresponding port pin. */
#define GP3TGL_TGL1_BBA                (*(volatile unsigned long *) 0x420C1684)
#define GP3TGL_TGL1_MSK                (0x1   << 1  )
#define GP3TGL_TGL1                    (0x1   << 1  )
#define GP3TGL_TGL1_TGL                (0x1   << 1  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP3TGL[TGL0] - Toggle for corresponding port pin. */
#define GP3TGL_TGL0_BBA                (*(volatile unsigned long *) 0x420C1680)
#define GP3TGL_TGL0_MSK                (0x1   << 0  )
#define GP3TGL_TGL0                    (0x1   << 0  )
#define GP3TGL_TGL0_TGL                (0x1   << 0  ) /* TGL. Set by user code to invert the corresponding GPIO. */
#if (__NO_MMR_STRUCTS__==1)

#define          GP4CON                                     (*(volatile unsigned short int *) 0x400060C0)
#define          GP4OEN                                     (*(volatile unsigned char      *) 0x400060C4)
#define          GP4PUL                                     (*(volatile unsigned char      *) 0x400060C8)
#define          GP4OCE                                     (*(volatile unsigned char      *) 0x400060CC)
#define          GP4IN                                      (*(volatile unsigned char      *) 0x400060D4)
#define          GP4OUT                                     (*(volatile unsigned char      *) 0x400060D8)
#define          GP4SET                                     (*(volatile unsigned char      *) 0x400060DC)
#define          GP4CLR                                     (*(volatile unsigned char      *) 0x400060E0)
#define          GP4TGL                                     (*(volatile unsigned char      *) 0x400060E4)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for GP4CON*/
#define GP4CON_RVAL                    0x0

/* GP4CON[CON7] - Configuration bits for P4.7 */
#define GP4CON_CON7_MSK                (0x3   << 14 )
#define GP4CON_CON7_GPIO               (0x1   << 14 ) /* GPIO                     */
#define GP4CON_CON7_PWM7               (0x2   << 14 ) /* PWM7                     */

