contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GP4CON[CON6] - Configuration bits for P4.6 */
#define GP4CON_CON6_MSK                (0x3   << 12 )
#define GP4CON_CON6_GPIO               (0x1   << 12 ) /* GPIO                     */
#define GP4CON_CON6_PWM6               (0x2   << 12 ) /* PWM6                     */

/* GP4CON[CON5] - Configuration bits for P4.5 */
#define GP4CON_CON5_MSK                (0x3   << 10 )
#define GP4CON_CON5_GPIO               (0x1   << 10 ) /* GPIO                     */
#define GP4CON_CON5_PWM5               (0x2   << 10 ) /* PWM5                     */

/* GP4CON[CON4] - Configuration bits for P4.4 */
#define GP4CON_CON4_MSK                (0x3   << 8  )
#define GP4CON_CON4_GPIO               (0x1   << 8  ) /* GPIO                     */
#define GP4CON_CON4_PWM4               (0x2   << 8  ) /* PWM4                     */

/* GP4CON[CON3] - Configuration bits for P4.3 */
#define GP4CON_CON3_MSK                (0x3   << 6  )
#define GP4CON_CON3_GPIO               (0x1   << 6  ) /* GPIO                     */
#define GP4CON_CON3_PWM3               (0x2   << 6  ) /* PWM3                     */

/* GP4CON[CON2] - Configuration bits for P4.2 */
#define GP4CON_CON2_MSK                (0x3   << 4  )
#define GP4CON_CON2_GPIO               (0x1   << 4  ) /* GPIO                     */
#define GP4CON_CON2_PWM2               (0x2   << 4  ) /* PWM2                     */
#define GP4CON_CON2_SPI0CS             (0x3   << 4  ) /* SPI0CS                   */

/* GP4CON[CON1] - Configuration bits for P4.1 */
#define GP4CON_CON1_MSK                (0x3   << 2  )
#define GP4CON_CON1_GPIO               (0x1   << 2  ) /* GPIO                     */
#define GP4CON_CON1_PWM1               (0x2   << 2  ) /* PWM1                     */

/* GP4CON[CON0] - Configuration bits for P4.0 */
#define GP4CON_CON0_MSK                (0x3   << 0  )
#define GP4CON_CON0_GPIO               (0x1   << 0  ) /* GPIO                     */
#define GP4CON_CON0_PWM0               (0x2   << 0  ) /* PWM0                     */

/* Reset Value for GP4OEN*/
#define GP4OEN_RVAL                    0x0

/* GP4OEN[OEN7] - Port pin direction. */
#define GP4OEN_OEN7_BBA                (*(volatile unsigned long *) 0x420C189C)
#define GP4OEN_OEN7_MSK                (0x1   << 7  )
#define GP4OEN_OEN7                    (0x1   << 7  )
#define GP4OEN_OEN7_IN                 (0x0   << 7  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP4OEN_OEN7_OUT                (0x1   << 7  ) /* OUT. Enables the output on corresponding port pin. */

/* GP4OEN[OEN6] - Port pin direction. */
#define GP4OEN_OEN6_BBA                (*(volatile unsigned long *) 0x420C1898)
#define GP4OEN_OEN6_MSK                (0x1   << 6  )
#define GP4OEN_OEN6                    (0x1   << 6  )
#define GP4OEN_OEN6_IN                 (0x0   << 6  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP4OEN_OEN6_OUT                (0x1   << 6  ) /* OUT. Enables the output on corresponding port pin. */

/* GP4OEN[OEN5] - Port pin direction. */
#define GP4OEN_OEN5_BBA                (*(volatile unsigned long *) 0x420C1894)
#define GP4OEN_OEN5_MSK                (0x1   << 5  )
#define GP4OEN_OEN5                    (0x1   << 5  )
#define GP4OEN_OEN5_IN                 (0x0   << 5  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP4OEN_OEN5_OUT                (0x1   << 5  ) /* OUT. Enables the output on corresponding port pin. */

/* GP4OEN[OEN4] - Port pin direction. */
#define GP4OEN_OEN4_BBA                (*(volatile unsigned long *) 0x420C1890)
#define GP4OEN_OEN4_MSK                (0x1   << 4  )
#define GP4OEN_OEN4                    (0x1   << 4  )
#define GP4OEN_OEN4_IN                 (0x0   << 4  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP4OEN_OEN4_OUT                (0x1   << 4  ) /* OUT. Enables the output on corresponding port pin. */

/* GP4OEN[OEN3] - Port pin direction. */
#define GP4OEN_OEN3_BBA                (*(volatile unsigned long *) 0x420C188C)
#define GP4OEN_OEN3_MSK                (0x1   << 3  )
#define GP4OEN_OEN3                    (0x1   << 3  )
#define GP4OEN_OEN3_IN                 (0x0   << 3  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP4OEN_OEN3_OUT                (0x1   << 3  ) /* OUT. Enables the output on corresponding port pin. */

/* GP4OEN[OEN2] - Port pin direction. */
#define GP4OEN_OEN2_BBA                (*(volatile unsigned long *) 0x420C1888)
#define GP4OEN_OEN2_MSK                (0x1   << 2  )
#define GP4OEN_OEN2                    (0x1   << 2  )
#define GP4OEN_OEN2_IN                 (0x0   << 2  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP4OEN_OEN2_OUT                (0x1   << 2  ) /* OUT. Enables the output on corresponding port pin. */

/* GP4OEN[OEN1] - Port pin direction. */
#define GP4OEN_OEN1_BBA                (*(volatile unsigned long *) 0x420C1884)
#define GP4OEN_OEN1_MSK                (0x1   << 1  )
#define GP4OEN_OEN1                    (0x1   << 1  )
#define GP4OEN_OEN1_IN                 (0x0   << 1  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP4OEN_OEN1_OUT                (0x1   << 1  ) /* OUT. Enables the output on corresponding port pin. */

/* GP4OEN[OEN0] - Port pin direction. */
#define GP4OEN_OEN0_BBA                (*(volatile unsigned long *) 0x420C1880)
#define GP4OEN_OEN0_MSK                (0x1   << 0  )
#define GP4OEN_OEN0                    (0x1   << 0  )
#define GP4OEN_OEN0_IN                 (0x0   << 0  ) /* IN. Configures pin as an input.  Disables the output on corresponding port pin. */
#define GP4OEN_OEN0_OUT                (0x1   << 0  ) /* OUT. Enables the output on corresponding port pin. */

/* Reset Value for GP4PUL*/
#define GP4PUL_RVAL                    0xFF

/* GP4PUL[PUL7] - Pull Up Enable for port pin. */
#define GP4PUL_PUL7_BBA                (*(volatile unsigned long *) 0x420C191C)
#define GP4PUL_PUL7_MSK                (0x1   << 7  )
#define GP4PUL_PUL7                    (0x1   << 7  )
#define GP4PUL_PUL7_DIS                (0x0   << 7  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP4PUL_PUL7_EN                 (0x1   << 7  ) /* EN. Enables the internal pull up on corresponding port pin. */

