contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GP4PUL[PUL6] - Pull Up Enable for port pin. */
#define GP4PUL_PUL6_BBA                (*(volatile unsigned long *) 0x420C1918)
#define GP4PUL_PUL6_MSK                (0x1   << 6  )
#define GP4PUL_PUL6                    (0x1   << 6  )
#define GP4PUL_PUL6_DIS                (0x0   << 6  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP4PUL_PUL6_EN                 (0x1   << 6  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP4PUL[PUL5] - Pull Up Enable for port pin. */
#define GP4PUL_PUL5_BBA                (*(volatile unsigned long *) 0x420C1914)
#define GP4PUL_PUL5_MSK                (0x1   << 5  )
#define GP4PUL_PUL5                    (0x1   << 5  )
#define GP4PUL_PUL5_DIS                (0x0   << 5  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP4PUL_PUL5_EN                 (0x1   << 5  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP4PUL[PUL4] - Pull Up Enable for port pin. */
#define GP4PUL_PUL4_BBA                (*(volatile unsigned long *) 0x420C1910)
#define GP4PUL_PUL4_MSK                (0x1   << 4  )
#define GP4PUL_PUL4                    (0x1   << 4  )
#define GP4PUL_PUL4_DIS                (0x0   << 4  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP4PUL_PUL4_EN                 (0x1   << 4  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP4PUL[PUL3] - Pull Up Enable for port pin. */
#define GP4PUL_PUL3_BBA                (*(volatile unsigned long *) 0x420C190C)
#define GP4PUL_PUL3_MSK                (0x1   << 3  )
#define GP4PUL_PUL3                    (0x1   << 3  )
#define GP4PUL_PUL3_DIS                (0x0   << 3  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP4PUL_PUL3_EN                 (0x1   << 3  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP4PUL[PUL2] - Pull Up Enable for port pin. */
#define GP4PUL_PUL2_BBA                (*(volatile unsigned long *) 0x420C1908)
#define GP4PUL_PUL2_MSK                (0x1   << 2  )
#define GP4PUL_PUL2                    (0x1   << 2  )
#define GP4PUL_PUL2_DIS                (0x0   << 2  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP4PUL_PUL2_EN                 (0x1   << 2  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP4PUL[PUL1] - Pull Up Enable for port pin. */
#define GP4PUL_PUL1_BBA                (*(volatile unsigned long *) 0x420C1904)
#define GP4PUL_PUL1_MSK                (0x1   << 1  )
#define GP4PUL_PUL1                    (0x1   << 1  )
#define GP4PUL_PUL1_DIS                (0x0   << 1  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP4PUL_PUL1_EN                 (0x1   << 1  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* GP4PUL[PUL0] - Pull Up Enable for port pin. */
#define GP4PUL_PUL0_BBA                (*(volatile unsigned long *) 0x420C1900)
#define GP4PUL_PUL0_MSK                (0x1   << 0  )
#define GP4PUL_PUL0                    (0x1   << 0  )
#define GP4PUL_PUL0_DIS                (0x0   << 0  ) /* DIS.  Disables the internal pull up on corresponding port pin. */
#define GP4PUL_PUL0_EN                 (0x1   << 0  ) /* EN. Enables the internal pull up on corresponding port pin. */

/* Reset Value for GP4OCE*/
#define GP4OCE_RVAL                    0x0

/* GP4OCE[OCE7] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP4OCE_OCE7_BBA                (*(volatile unsigned long *) 0x420C199C)
#define GP4OCE_OCE7_MSK                (0x1   << 7  )
#define GP4OCE_OCE7                    (0x1   << 7  )
#define GP4OCE_OCE7_DIS                (0x0   << 7  ) /* DIS                      */
#define GP4OCE_OCE7_EN                 (0x1   << 7  ) /* EN                       */

/* GP4OCE[OCE6] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP4OCE_OCE6_BBA                (*(volatile unsigned long *) 0x420C1998)
#define GP4OCE_OCE6_MSK                (0x1   << 6  )
#define GP4OCE_OCE6                    (0x1   << 6  )
#define GP4OCE_OCE6_DIS                (0x0   << 6  ) /* DIS                      */
#define GP4OCE_OCE6_EN                 (0x1   << 6  ) /* EN                       */

/* GP4OCE[OCE5] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP4OCE_OCE5_BBA                (*(volatile unsigned long *) 0x420C1994)
#define GP4OCE_OCE5_MSK                (0x1   << 5  )
#define GP4OCE_OCE5                    (0x1   << 5  )
#define GP4OCE_OCE5_DIS                (0x0   << 5  ) /* DIS                      */
#define GP4OCE_OCE5_EN                 (0x1   << 5  ) /* EN                       */

/* GP4OCE[OCE4] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP4OCE_OCE4_BBA                (*(volatile unsigned long *) 0x420C1990)
#define GP4OCE_OCE4_MSK                (0x1   << 4  )
#define GP4OCE_OCE4                    (0x1   << 4  )
#define GP4OCE_OCE4_DIS                (0x0   << 4  ) /* DIS                      */
#define GP4OCE_OCE4_EN                 (0x1   << 4  ) /* EN                       */

/* GP4OCE[OCE3] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP4OCE_OCE3_BBA                (*(volatile unsigned long *) 0x420C198C)
#define GP4OCE_OCE3_MSK                (0x1   << 3  )
#define GP4OCE_OCE3                    (0x1   << 3  )
#define GP4OCE_OCE3_DIS                (0x0   << 3  ) /* DIS                      */
#define GP4OCE_OCE3_EN                 (0x1   << 3  ) /* EN                       */

/* GP4OCE[OCE2] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP4OCE_OCE2_BBA                (*(volatile unsigned long *) 0x420C1988)
#define GP4OCE_OCE2_MSK                (0x1   << 2  )
#define GP4OCE_OCE2                    (0x1   << 2  )
#define GP4OCE_OCE2_DIS                (0x0   << 2  ) /* DIS                      */
#define GP4OCE_OCE2_EN                 (0x1   << 2  ) /* EN                       */

/* GP4OCE[OCE1] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP4OCE_OCE1_BBA                (*(volatile unsigned long *) 0x420C1984)
#define GP4OCE_OCE1_MSK                (0x1   << 1  )
#define GP4OCE_OCE1                    (0x1   << 1  )
#define GP4OCE_OCE1_DIS                (0x0   << 1  ) /* DIS                      */
#define GP4OCE_OCE1_EN                 (0x1   << 1  ) /* EN                       */

/* GP4OCE[OCE0] - Output enable. Sets the GPIO pads on corresponding port to open circuit  mode. */
#define GP4OCE_OCE0_BBA                (*(volatile unsigned long *) 0x420C1980)
#define GP4OCE_OCE0_MSK                (0x1   << 0  )
#define GP4OCE_OCE0                    (0x1   << 0  )
#define GP4OCE_OCE0_DIS                (0x0   << 0  ) /* DIS                      */
#define GP4OCE_OCE0_EN                 (0x1   << 0  ) /* EN                       */

