contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* Reset Value for GP4IN*/
#define GP4IN_RVAL                     0xFF

/* GP4IN[IN7] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP4IN_IN7_BBA                  (*(volatile unsigned long *) 0x420C1A9C)
#define GP4IN_IN7_MSK                  (0x1   << 7  )
#define GP4IN_IN7                      (0x1   << 7  )
#define GP4IN_IN7_LOW                  (0x0   << 7  ) /* LOW                      */
#define GP4IN_IN7_HIGH                 (0x1   << 7  ) /* HIGH                     */

/* GP4IN[IN6] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP4IN_IN6_BBA                  (*(volatile unsigned long *) 0x420C1A98)
#define GP4IN_IN6_MSK                  (0x1   << 6  )
#define GP4IN_IN6                      (0x1   << 6  )
#define GP4IN_IN6_LOW                  (0x0   << 6  ) /* LOW                      */
#define GP4IN_IN6_HIGH                 (0x1   << 6  ) /* HIGH                     */

/* GP4IN[IN5] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP4IN_IN5_BBA                  (*(volatile unsigned long *) 0x420C1A94)
#define GP4IN_IN5_MSK                  (0x1   << 5  )
#define GP4IN_IN5                      (0x1   << 5  )
#define GP4IN_IN5_LOW                  (0x0   << 5  ) /* LOW                      */
#define GP4IN_IN5_HIGH                 (0x1   << 5  ) /* HIGH                     */

/* GP4IN[IN4] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP4IN_IN4_BBA                  (*(volatile unsigned long *) 0x420C1A90)
#define GP4IN_IN4_MSK                  (0x1   << 4  )
#define GP4IN_IN4                      (0x1   << 4  )
#define GP4IN_IN4_LOW                  (0x0   << 4  ) /* LOW                      */
#define GP4IN_IN4_HIGH                 (0x1   << 4  ) /* HIGH                     */

/* GP4IN[IN3] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP4IN_IN3_BBA                  (*(volatile unsigned long *) 0x420C1A8C)
#define GP4IN_IN3_MSK                  (0x1   << 3  )
#define GP4IN_IN3                      (0x1   << 3  )
#define GP4IN_IN3_LOW                  (0x0   << 3  ) /* LOW                      */
#define GP4IN_IN3_HIGH                 (0x1   << 3  ) /* HIGH                     */

/* GP4IN[IN2] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP4IN_IN2_BBA                  (*(volatile unsigned long *) 0x420C1A88)
#define GP4IN_IN2_MSK                  (0x1   << 2  )
#define GP4IN_IN2                      (0x1   << 2  )
#define GP4IN_IN2_LOW                  (0x0   << 2  ) /* LOW                      */
#define GP4IN_IN2_HIGH                 (0x1   << 2  ) /* HIGH                     */

/* GP4IN[IN1] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP4IN_IN1_BBA                  (*(volatile unsigned long *) 0x420C1A84)
#define GP4IN_IN1_MSK                  (0x1   << 1  )
#define GP4IN_IN1                      (0x1   << 1  )
#define GP4IN_IN1_LOW                  (0x0   << 1  ) /* LOW                      */
#define GP4IN_IN1_HIGH                 (0x1   << 1  ) /* HIGH                     */

/* GP4IN[IN0] - Reflects the level on the corresponding GPIO pins except when in configured in open circuit. */
#define GP4IN_IN0_BBA                  (*(volatile unsigned long *) 0x420C1A80)
#define GP4IN_IN0_MSK                  (0x1   << 0  )
#define GP4IN_IN0                      (0x1   << 0  )
#define GP4IN_IN0_LOW                  (0x0   << 0  ) /* LOW                      */
#define GP4IN_IN0_HIGH                 (0x1   << 0  ) /* HIGH                     */

/* Reset Value for GP4OUT*/
#define GP4OUT_RVAL                    0x0

/* GP4OUT[OUT7] - Output for port pin. */
#define GP4OUT_OUT7_BBA                (*(volatile unsigned long *) 0x420C1B1C)
#define GP4OUT_OUT7_MSK                (0x1   << 7  )
#define GP4OUT_OUT7                    (0x1   << 7  )
#define GP4OUT_OUT7_LOW                (0x0   << 7  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP4OUT_OUT7_HIGH               (0x1   << 7  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP4OUT[OUT6] - Output for port pin. */
#define GP4OUT_OUT6_BBA                (*(volatile unsigned long *) 0x420C1B18)
#define GP4OUT_OUT6_MSK                (0x1   << 6  )
#define GP4OUT_OUT6                    (0x1   << 6  )
#define GP4OUT_OUT6_LOW                (0x0   << 6  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP4OUT_OUT6_HIGH               (0x1   << 6  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP4OUT[OUT5] - Output for port pin. */
#define GP4OUT_OUT5_BBA                (*(volatile unsigned long *) 0x420C1B14)
#define GP4OUT_OUT5_MSK                (0x1   << 5  )
#define GP4OUT_OUT5                    (0x1   << 5  )
#define GP4OUT_OUT5_LOW                (0x0   << 5  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP4OUT_OUT5_HIGH               (0x1   << 5  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP4OUT[OUT4] - Output for port pin. */
#define GP4OUT_OUT4_BBA                (*(volatile unsigned long *) 0x420C1B10)
#define GP4OUT_OUT4_MSK                (0x1   << 4  )
#define GP4OUT_OUT4                    (0x1   << 4  )
#define GP4OUT_OUT4_LOW                (0x0   << 4  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP4OUT_OUT4_HIGH               (0x1   << 4  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

/* GP4OUT[OUT3] - Output for port pin. */
#define GP4OUT_OUT3_BBA                (*(volatile unsigned long *) 0x420C1B0C)
#define GP4OUT_OUT3_MSK                (0x1   << 3  )
#define GP4OUT_OUT3                    (0x1   << 3  )
#define GP4OUT_OUT3_LOW                (0x0   << 3  ) /* LOW. Cleared by user to drive the corresponding GPIO low. */
#define GP4OUT_OUT3_HIGH               (0x1   << 3  ) /* HIGH. Set by user code to drive the corresponding GPIO high. */

