contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* GP4CLR[CLR1] - Set by user code to drive the corresponding GPIO low. */
#define GP4CLR_CLR1_BBA                (*(volatile unsigned long *) 0x420C1C04)
#define GP4CLR_CLR1_MSK                (0x1   << 1  )
#define GP4CLR_CLR1                    (0x1   << 1  )
#define GP4CLR_CLR1_CLR                (0x1   << 1  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* GP4CLR[CLR0] - Set by user code to drive the corresponding GPIO low. */
#define GP4CLR_CLR0_BBA                (*(volatile unsigned long *) 0x420C1C00)
#define GP4CLR_CLR0_MSK                (0x1   << 0  )
#define GP4CLR_CLR0                    (0x1   << 0  )
#define GP4CLR_CLR0_CLR                (0x1   << 0  ) /* CLR. Set by user code to drive the corresponding GPIO low. */

/* Reset Value for GP4TGL*/
#define GP4TGL_RVAL                    0x0

/* GP4TGL[TGL7] - Toggle for corresponding port pin. */
#define GP4TGL_TGL7_BBA                (*(volatile unsigned long *) 0x420C1C9C)
#define GP4TGL_TGL7_MSK                (0x1   << 7  )
#define GP4TGL_TGL7                    (0x1   << 7  )
#define GP4TGL_TGL7_TGL                (0x1   << 7  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP4TGL[TGL6] - Toggle for corresponding port pin. */
#define GP4TGL_TGL6_BBA                (*(volatile unsigned long *) 0x420C1C98)
#define GP4TGL_TGL6_MSK                (0x1   << 6  )
#define GP4TGL_TGL6                    (0x1   << 6  )
#define GP4TGL_TGL6_TGL                (0x1   << 6  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP4TGL[TGL5] - Toggle for corresponding port pin. */
#define GP4TGL_TGL5_BBA                (*(volatile unsigned long *) 0x420C1C94)
#define GP4TGL_TGL5_MSK                (0x1   << 5  )
#define GP4TGL_TGL5                    (0x1   << 5  )
#define GP4TGL_TGL5_TGL                (0x1   << 5  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP4TGL[TGL4] - Toggle for corresponding port pin. */
#define GP4TGL_TGL4_BBA                (*(volatile unsigned long *) 0x420C1C90)
#define GP4TGL_TGL4_MSK                (0x1   << 4  )
#define GP4TGL_TGL4                    (0x1   << 4  )
#define GP4TGL_TGL4_TGL                (0x1   << 4  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP4TGL[TGL3] - Toggle for corresponding port pin. */
#define GP4TGL_TGL3_BBA                (*(volatile unsigned long *) 0x420C1C8C)
#define GP4TGL_TGL3_MSK                (0x1   << 3  )
#define GP4TGL_TGL3                    (0x1   << 3  )
#define GP4TGL_TGL3_TGL                (0x1   << 3  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP4TGL[TGL2] - Toggle for corresponding port pin. */
#define GP4TGL_TGL2_BBA                (*(volatile unsigned long *) 0x420C1C88)
#define GP4TGL_TGL2_MSK                (0x1   << 2  )
#define GP4TGL_TGL2                    (0x1   << 2  )
#define GP4TGL_TGL2_TGL                (0x1   << 2  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP4TGL[TGL1] - Toggle for corresponding port pin. */
#define GP4TGL_TGL1_BBA                (*(volatile unsigned long *) 0x420C1C84)
#define GP4TGL_TGL1_MSK                (0x1   << 1  )
#define GP4TGL_TGL1                    (0x1   << 1  )
#define GP4TGL_TGL1_TGL                (0x1   << 1  ) /* TGL. Set by user code to invert the corresponding GPIO. */

/* GP4TGL[TGL0] - Toggle for corresponding port pin. */
#define GP4TGL_TGL0_BBA                (*(volatile unsigned long *) 0x420C1C80)
#define GP4TGL_TGL0_MSK                (0x1   << 0  )
#define GP4TGL_TGL0                    (0x1   << 0  )
#define GP4TGL_TGL0_TGL                (0x1   << 0  ) /* TGL. Set by user code to invert the corresponding GPIO. */
// ------------------------------------------------------------------------------------------------
// -----                                        GPIOCMN                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief General Purpose Input Output (pADI_GPIOCMN)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_GPIOCMN Structure                 */
  __IO uint8_t   GPDWN;                     /*!< GPIO P3.4 Pull Down Control           */
} ADI_GPIOCMN_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          GPDWN                                      (*(volatile unsigned char      *) 0x400060F0)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for GPDWN*/
#define GPDWN_RVAL                     0x1

/* GPDWN[DWN1] - Pull down resistor control bit */
#define GPDWN_DWN1_BBA                 (*(volatile unsigned long *) 0x420C1E04)
#define GPDWN_DWN1_MSK                 (0x1   << 1  )
#define GPDWN_DWN1                     (0x1   << 1  )
#define GPDWN_DWN1_EN                  (0x0   << 1  ) /* EN to enable the pull down resistor on P3.4 by software. The hardware only enables this pull down automatically at power up. */
#define GPDWN_DWN1_DIS                 (0x1   << 1  ) /* DIS to disable the pull down resistor on P3.4. Disabled automatically by hardware if GP3PUL[4] =1 or if GP3OEN[4]=1. */
// ------------------------------------------------------------------------------------------------
// -----                                        MISC                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief General Purpose Input Output (pADI_MISC)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_MISC Structure                    */
  __I  uint32_t  RESERVED0;
  __IO uint16_t  RFTST;                     /*!< Internal Radio Test Mode Access       */
  __I  uint16_t  RESERVED1[5];
  __IO uint8_t   SWACT;                     /*!< Serial Wire Activity Register         */
} ADI_MISC_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          RFTST                                      (*(volatile unsigned short int *) 0x40008824)
#define          SWACT                                      (*(volatile unsigned char      *) 0x40008830)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for RFTST*/
#define RFTST_RVAL                     0x0

/* RFTST[DIR] - Controls the pin direction in RF test mode. */
#define RFTST_DIR_MSK                  (0x7FF << 5  )

/* RFTST[AN1] - Enable RF Analog test 2 mode. */
#define RFTST_AN1_BBA                  (*(volatile unsigned long *) 0x4211048C)
#define RFTST_AN1_MSK                  (0x1   << 3  )
#define RFTST_AN1                      (0x1   << 3  )
#define RFTST_AN1_DIS                  (0x0   << 3  ) /* DIS                      */
#define RFTST_AN1_EN                   (0x1   << 3  ) /* EN                       */

/* RFTST[AN0] - Enable RF Analog test mode. */
#define RFTST_AN0_BBA                  (*(volatile unsigned long *) 0x42110488)
#define RFTST_AN0_MSK                  (0x1   << 2  )
#define RFTST_AN0                      (0x1   << 2  )
#define RFTST_AN0_DIS                  (0x0   << 2  ) /* DIS                      */
#define RFTST_AN0_EN                   (0x1   << 2  ) /* EN                       */

/* RFTST[SPI0] - Enable the internal SPI0 signals to P0.0, P0.1, P0.2 and P0.3. */
#define RFTST_SPI0_BBA                 (*(volatile unsigned long *) 0x42110484)
#define RFTST_SPI0_MSK                 (0x1   << 1  )
#define RFTST_SPI0                     (0x1   << 1  )
#define RFTST_SPI0_DIS                 (0x0   << 1  ) /* DIS                      */
#define RFTST_SPI0_EN                  (0x1   << 1  ) /* EN                       */

/* RFTST[GPX] - Connect the internal GPIOs GP0-GP5 of the RF transceiver to external GPIOs P0.6, P0.7, P1.0, P1.1, P1.4, P1.5. */
#define RFTST_GPX_BBA                  (*(volatile unsigned long *) 0x42110480)
#define RFTST_GPX_MSK                  (0x1   << 0  )
#define RFTST_GPX                      (0x1   << 0  )
#define RFTST_GPX_DIS                  (0x0   << 0  ) /* DIS                      */
#define RFTST_GPX_EN                   (0x1   << 0  ) /* EN                       */

