contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* I2CMCON[IENRX] - Receive request interrupt enable. */
#define I2CMCON_IENRX_BBA              (*(volatile unsigned long *) 0x42060010)
#define I2CMCON_IENRX_MSK              (0x1   << 4  )
#define I2CMCON_IENRX                  (0x1   << 4  )
#define I2CMCON_IENRX_DIS              (0x0   << 4  ) /* DIS. Interrupt disabled. */
#define I2CMCON_IENRX_EN               (0x1   << 4  ) /* EN. Interrupt enabled. A master I2C interrupt is generated when data is in the receive FIFO. */

/* I2CMCON[STRETCH] - Stretch I2CSCL enable. */
#define I2CMCON_STRETCH_BBA            (*(volatile unsigned long *) 0x4206000C)
#define I2CMCON_STRETCH_MSK            (0x1   << 3  )
#define I2CMCON_STRETCH                (0x1   << 3  )
#define I2CMCON_STRETCH_DIS            (0x0   << 3  ) /* DIS. Disable             */
#define I2CMCON_STRETCH_EN             (0x1   << 3  ) /* EN. Setting this bit instructs the device that if I2CSCL is 0, hold it at 0. Or if I2CSCL is 1, then when it next goes to 0, hold it at 0. */

/* I2CMCON[LOOPBACK] - Internal loop back enable. */
#define I2CMCON_LOOPBACK_BBA           (*(volatile unsigned long *) 0x42060008)
#define I2CMCON_LOOPBACK_MSK           (0x1   << 2  )
#define I2CMCON_LOOPBACK               (0x1   << 2  )
#define I2CMCON_LOOPBACK_DIS           (0x0   << 2  ) /* DIS. Disable.            */
#define I2CMCON_LOOPBACK_EN            (0x1   << 2  ) /* EN. I2CSCL and I2CSDA out of the device are muxed onto their corresponding inputs. Note that is also possible for the master to loop back a transfer to the slave as long as the device address corresponds, that is, external loopback. */

/* I2CMCON[COMPETE] - Start back-off disable. */
#define I2CMCON_COMPETE_BBA            (*(volatile unsigned long *) 0x42060004)
#define I2CMCON_COMPETE_MSK            (0x1   << 1  )
#define I2CMCON_COMPETE                (0x1   << 1  )
#define I2CMCON_COMPETE_DIS            (0x0   << 1  ) /* DIS. Disable.            */
#define I2CMCON_COMPETE_EN             (0x1   << 1  ) /* EN. Enables the device to compete for ownership even if another device is currently driving a start condition. */

/* I2CMCON[MAS] - Master enable bit. */
#define I2CMCON_MAS_BBA                (*(volatile unsigned long *) 0x42060000)
#define I2CMCON_MAS_MSK                (0x1   << 0  )
#define I2CMCON_MAS                    (0x1   << 0  )
#define I2CMCON_MAS_DIS                (0x0   << 0  ) /* DIS. The master is disabled. The master state machine is reset.The master should be disabled when not in use. This bit should not be cleared until a transaction has completed. TCOMP in I2CMSTA indicates when a transaction is complete. */
#define I2CMCON_MAS_EN                 (0x1   << 0  ) /* EN. Enable master.       */

/* Reset Value for I2CMSTA*/
#define I2CMSTA_RVAL                   0x0

/* I2CMSTA[TXUR] - Master transmit FIFO underrun. */
#define I2CMSTA_TXUR_BBA               (*(volatile unsigned long *) 0x420600B0)
#define I2CMSTA_TXUR_MSK               (0x1   << 12 )
#define I2CMSTA_TXUR                   (0x1   << 12 )
#define I2CMSTA_TXUR_CLR               (0x0   << 12 ) /* CLR. Cleared.            */
#define I2CMSTA_TXUR_SET               (0x1   << 12 ) /* SET. Set when the I2C master ends the transaction due to a Tx FIFO empty condition. This bit is only set when IENTX (I2CSCON[5]) is set. */

/* I2CMSTA[MSTOP] - STOP driven by the I2C master. */
#define I2CMSTA_MSTOP_BBA              (*(volatile unsigned long *) 0x420600AC)
#define I2CMSTA_MSTOP_MSK              (0x1   << 11 )
#define I2CMSTA_MSTOP                  (0x1   << 11 )
#define I2CMSTA_MSTOP_CLR              (0x0   << 11 ) /* CLR. Cleared.            */
#define I2CMSTA_MSTOP_SET              (0x1   << 11 ) /* SET. Set when the I2C master drives a stop condition on the I2C bus, therefore indicating a transaction completion, Tx underrun, Rx overflow, or a NACK by the slave. It is different from TCOMP because it is not set when the stop condition occurs due to any other master on the I2C bus.  This bit does not generate an interrupt. See the TCOMP description for available interrupts related to the stop condition. */

/* I2CMSTA[LINEBUSY] - Line is busy. */
#define I2CMSTA_LINEBUSY_BBA           (*(volatile unsigned long *) 0x420600A8)
#define I2CMSTA_LINEBUSY_MSK           (0x1   << 10 )
#define I2CMSTA_LINEBUSY               (0x1   << 10 )
#define I2CMSTA_LINEBUSY_CLR           (0x0   << 10 ) /* CLR. Cleared when a stop is detected on the I2C bus. */
#define I2CMSTA_LINEBUSY_SET           (0x1   << 10 ) /* SET. Set when a start is detected on the I2C bus. */

/* I2CMSTA[RXOF] - Receive FIFO overflow. */
#define I2CMSTA_RXOF_BBA               (*(volatile unsigned long *) 0x420600A4)
#define I2CMSTA_RXOF_MSK               (0x1   << 9  )
#define I2CMSTA_RXOF                   (0x1   << 9  )
#define I2CMSTA_RXOF_CLR               (0x0   << 9  ) /* CLR. CLeared.            */
#define I2CMSTA_RXOF_SET               (0x1   << 9  ) /* SET. Set when a byte is written to the receive FIFO when the FIFO is already full. */

/* I2CMSTA[TCOMP] - Transaction completed (or stop detected). (Can drive an interrupt). */
#define I2CMSTA_TCOMP_BBA              (*(volatile unsigned long *) 0x420600A0)
#define I2CMSTA_TCOMP_MSK              (0x1   << 8  )
#define I2CMSTA_TCOMP                  (0x1   << 8  )
#define I2CMSTA_TCOMP_CLR              (0x0   << 8  ) /* CLR. Cleared.            */
#define I2CMSTA_TCOMP_SET              (0x1   << 8  ) /* SET. Set when a STOP condition is detected on the I2C bus.  If IENCMP is 1, an interrupt is generated when this bit asserts. This bit only asserts if the master is enabled (MASEN = 1).  This bit should be used to determine when it is safe to disable the master. It can also be used to wait for another master's transaction to complete on the I2C bus when this master loses arbitration. */

/* I2CMSTA[NACKDATA] - NACK received in response to data write. (Can drive an interrupt). */
#define I2CMSTA_NACKDATA_BBA           (*(volatile unsigned long *) 0x4206009C)
#define I2CMSTA_NACKDATA_MSK           (0x1   << 7  )
#define I2CMSTA_NACKDATA               (0x1   << 7  )
#define I2CMSTA_NACKDATA_CLR           (0x0   << 7  ) /* CLR. Cleared on a read of the I2CMSTA register. */
#define I2CMSTA_NACKDATA_SET           (0x1   << 7  ) /* SET. Set when a NACK is received in response to a data write transfer. If IENNACK is 1, an interrupt is generated when this bit asserts. */

/* I2CMSTA[BUSY] - Master busy. */
#define I2CMSTA_BUSY_BBA               (*(volatile unsigned long *) 0x42060098)
#define I2CMSTA_BUSY_MSK               (0x1   << 6  )
#define I2CMSTA_BUSY                   (0x1   << 6  )
#define I2CMSTA_BUSY_CLR               (0x0   << 6  ) /* CLR. Cleared if the state machine is idle or another device has control of the I2C bus. */
#define I2CMSTA_BUSY_SET               (0x1   << 6  ) /* SET. Set when the master state machine is servicing a transaction. */

/* I2CMSTA[ALOST] - Arbitration lost.  (Can drive an interrupt). */
#define I2CMSTA_ALOST_BBA              (*(volatile unsigned long *) 0x42060094)
#define I2CMSTA_ALOST_MSK              (0x1   << 5  )
#define I2CMSTA_ALOST                  (0x1   << 5  )
#define I2CMSTA_ALOST_CLR              (0x0   << 5  ) /* CLR. Cleared on a read of the I2CMSTA register. */
#define I2CMSTA_ALOST_SET              (0x1   << 5  ) /* SET. Set if the master looses arbitration.  If IENALOST is 1, an interrupt is generated when this bit asserts. */

