contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* I2CMSTA[NACKADDR] - NACK received in response to an address. (Can drive an interrupt). */
#define I2CMSTA_NACKADDR_BBA           (*(volatile unsigned long *) 0x42060090)
#define I2CMSTA_NACKADDR_MSK           (0x1   << 4  )
#define I2CMSTA_NACKADDR               (0x1   << 4  )
#define I2CMSTA_NACKADDR_CLR           (0x0   << 4  ) /* CLR. Cleared on a read of the I2CMSTA register. */
#define I2CMSTA_NACKADDR_SET           (0x1   << 4  ) /* SET. Set if a NACK received in response to an address.  If IENNACK is 1, an interrupt is generated when this bit asserts. */

/* I2CMSTA[RXREQ] - Receive Request. (Can drive an interrupt). */
#define I2CMSTA_RXREQ_BBA              (*(volatile unsigned long *) 0x4206008C)
#define I2CMSTA_RXREQ_MSK              (0x1   << 3  )
#define I2CMSTA_RXREQ                  (0x1   << 3  )
#define I2CMSTA_RXREQ_CLR              (0x0   << 3  ) /* CLR. Cleared.            */
#define I2CMSTA_RXREQ_SET              (0x1   << 3  ) /* SET. Set when there is data in the receive FIFO.  If IENRX is 1, an interrupt is generated when this bit asserts. */

/* I2CMSTA[TXREQ] - Transmit Request. (Can drive an interrupt). */
#define I2CMSTA_TXREQ_BBA              (*(volatile unsigned long *) 0x42060088)
#define I2CMSTA_TXREQ_MSK              (0x1   << 2  )
#define I2CMSTA_TXREQ                  (0x1   << 2  )
#define I2CMSTA_TXREQ_CLR              (0x0   << 2  ) /* CLR. Cleared when the transmit FIFO underrun condition is not met. */
#define I2CMSTA_TXREQ_SET              (0x1   << 2  ) /* SET. Set  when the direction bit is 0 and the transmit FIFO is either empty or not full. If IENTX is 1, an interrupt is generated when this bit asserts. */

/* I2CMSTA[TXFSTA] - Transmit FIFO Status. */
#define I2CMSTA_TXFSTA_MSK             (0x3   << 0  )
#define I2CMSTA_TXFSTA_EMPTY           (0x0   << 0  ) /* EMPTY. FIFO empty.       */
#define I2CMSTA_TXFSTA_ONEBYTE         (0x2   << 0  ) /* ONEBYTE. 1 byte in FIFO. */
#define I2CMSTA_TXFSTA_FULL            (0x3   << 0  ) /* FULL. FIFO full.         */

/* Reset Value for I2CMRX*/
#define I2CMRX_RVAL                    0x0

/* I2CMRX[VALUE] - Receive register. This register allows access to the receive data FIFO.  The FIFO can hold two bytes. */
#define I2CMRX_VALUE_MSK               (0xFF  << 0  )

/* Reset Value for I2CMTX*/
#define I2CMTX_RVAL                    0x0

/* I2CMTX[VALUE] - Transmit register. This register allows access to the transmit data FIFO.  The FIFO can hold two bytes. */
#define I2CMTX_VALUE_MSK               (0xFF  << 0  )

/* Reset Value for I2CMRXCNT*/
#define I2CMRXCNT_RVAL                 0x0

/* I2CMRXCNT[EXTEND] - Extended read: Use this bit if greater than 256 bytes are required on a read.  For example: To receive 412 bytes, write 0x100 (EXTEND = 1) to this register (I2CMRXCNT).  Wait for the first byte to be received, then check the I2CMCRXCNT register for every byte received thereafter.  When I2CMCRXCNT returns to 0, 256 bytes have been received.  Then, write 0x09C (412 - 256 = 156 decimal (equal to 0x9C)  with the EXTEND bit set to 0) to this register (I2CMRXCNT). */
#define I2CMRXCNT_EXTEND_BBA           (*(volatile unsigned long *) 0x42060220)
#define I2CMRXCNT_EXTEND_MSK           (0x1   << 8  )
#define I2CMRXCNT_EXTEND               (0x1   << 8  )
#define I2CMRXCNT_EXTEND_DIS           (0x0   << 8  ) /* DIS                      */
#define I2CMRXCNT_EXTEND_EN            (0x1   << 8  ) /* EN                       */

/* I2CMRXCNT[COUNT] - Receive count. Program the number of bytes required minus one to this register.  If just one byte is required write 0 to this register.  If greater than 256 bytes are required, then use EXTEND. */
#define I2CMRXCNT_COUNT_MSK            (0xFF  << 0  )

/* Reset Value for I2CMCRXCNT*/
#define I2CMCRXCNT_RVAL                0x0

/* I2CMCRXCNT[VALUE] - Current receive count. This register gives the total number of bytes received so far. If 256 bytes are requested, then this register reads 0 when the transaction has completed. */
#define I2CMCRXCNT_VALUE_MSK           (0xFF  << 0  )

/* Reset Value for I2CADR0*/
#define I2CADR0_RVAL                   0x0

/* I2CADR0[VALUE] - Address byte. If a 7-bit address is required, then I2CADR0[7:1] is programmed with the address and I2CADR0[0] is programmed with the direction (read or write). If a 10-bit address is required then I2CADR0[7:3] is programmed with '11110', I2CADR0[2:1] is programmed with the two MSBs of the address, and, again, I2CADR0[0] is programmed with the direction bit (read or write). */
#define I2CADR0_VALUE_MSK              (0xFF  << 0  )

/* Reset Value for I2CADR1*/
#define I2CADR1_RVAL                   0x0

/* I2CADR1[VALUE] - Address byte. This register is only required when addressing a slave with 10-bit addressing.  I2CADR1[7:0] is programmed with the lower eight bits of the address. */
#define I2CADR1_VALUE_MSK              (0xFF  << 0  )

/* Reset Value for I2CDIV*/
#define I2CDIV_RVAL                    0x1F1F

/* I2CDIV[HIGH] - Serial clock high time. This register controls the clock high time. See the serial clock generation section for more details. */
#define I2CDIV_HIGH_MSK                (0xFF  << 8  )

/* I2CDIV[LOW] - Serial clock low time. This register controls the clock low time. See the serial clock generation section for more details. */
#define I2CDIV_LOW_MSK                 (0xFF  << 0  )

/* Reset Value for I2CSCON*/
#define I2CSCON_RVAL                   0x0

/* I2CSCON[TXDMA] - Enable slave Tx DMA request. */
#define I2CSCON_TXDMA_BBA              (*(volatile unsigned long *) 0x42060538)
#define I2CSCON_TXDMA_MSK              (0x1   << 14 )
#define I2CSCON_TXDMA                  (0x1   << 14 )
#define I2CSCON_TXDMA_DIS              (0x0   << 14 ) /* DIS. Disable DMA mode.   */
#define I2CSCON_TXDMA_EN               (0x1   << 14 ) /* EN. Enable I2C slave DMA requests. */

/* I2CSCON[RXDMA] - Enable slave Rx DMA request. */
#define I2CSCON_RXDMA_BBA              (*(volatile unsigned long *) 0x42060534)
#define I2CSCON_RXDMA_MSK              (0x1   << 13 )
#define I2CSCON_RXDMA                  (0x1   << 13 )
#define I2CSCON_RXDMA_DIS              (0x0   << 13 ) /* DIS. Disable DMA mode.   */
#define I2CSCON_RXDMA_EN               (0x1   << 13 ) /* EN. Enable I2C slave DMA requests. */

