contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* I2CSCON[IENREPST] - Repeated start interrupt enable. */
#define I2CSCON_IENREPST_BBA           (*(volatile unsigned long *) 0x42060530)
#define I2CSCON_IENREPST_MSK           (0x1   << 12 )
#define I2CSCON_IENREPST               (0x1   << 12 )
#define I2CSCON_IENREPST_DIS           (0x0   << 12 ) /* DIS. Disable an interrupt when the REPSTART status bit asserts. */
#define I2CSCON_IENREPST_EN            (0x1   << 12 ) /* EN.  Generate an interrupt when the REPSTART status bit asserts. */

/* I2CSCON[IENTX] - Transmit request interrupt enable. */
#define I2CSCON_IENTX_BBA              (*(volatile unsigned long *) 0x42060528)
#define I2CSCON_IENTX_MSK              (0x1   << 10 )
#define I2CSCON_IENTX                  (0x1   << 10 )
#define I2CSCON_IENTX_DIS              (0x0   << 10 ) /* DIS. Disable transmit request interrupt. */
#define I2CSCON_IENTX_EN               (0x1   << 10 ) /* EN. Enable transmit request interrupt. */

/* I2CSCON[IENRX] - Receive request interrupt enable. */
#define I2CSCON_IENRX_BBA              (*(volatile unsigned long *) 0x42060524)
#define I2CSCON_IENRX_MSK              (0x1   << 9  )
#define I2CSCON_IENRX                  (0x1   << 9  )
#define I2CSCON_IENRX_DIS              (0x0   << 9  ) /* DIS. Disable receive request interrupt. */
#define I2CSCON_IENRX_EN               (0x1   << 9  ) /* EN. Enable receive request interrupt. */

/* I2CSCON[IENSTOP] - Stop condition detected interrupt enable. */
#define I2CSCON_IENSTOP_BBA            (*(volatile unsigned long *) 0x42060520)
#define I2CSCON_IENSTOP_MSK            (0x1   << 8  )
#define I2CSCON_IENSTOP                (0x1   << 8  )
#define I2CSCON_IENSTOP_DIS            (0x0   << 8  ) /* DIS. Disable stop condition detect interrupt. */
#define I2CSCON_IENSTOP_EN             (0x1   << 8  ) /* EN.  Enable stop condition detect interrupt. Enables STOP (I2CSSTA[10]) to generate an interrupt */

/* I2CSCON[NACK] - NACK next communication. */
#define I2CSCON_NACK_BBA               (*(volatile unsigned long *) 0x4206051C)
#define I2CSCON_NACK_MSK               (0x1   << 7  )
#define I2CSCON_NACK                   (0x1   << 7  )
#define I2CSCON_NACK_DIS               (0x0   << 7  ) /* DIS. Disable.            */
#define I2CSCON_NACK_EN                (0x1   << 7  ) /* EN. Allow the next communication to be NACK'ed.  This can be used for example if during a 24xx I2C serial eeprom style access, an attempt was made to write to a read only or nonexisting location in system memory. That is the indirect address in a 24xx I2C serial eeprom style write pointed to an unwritable memory location. */

/* I2CSCON[STRETCH] - Stretch I2CSCL enable. */
#define I2CSCON_STRETCH_BBA            (*(volatile unsigned long *) 0x42060518)
#define I2CSCON_STRETCH_MSK            (0x1   << 6  )
#define I2CSCON_STRETCH                (0x1   << 6  )
#define I2CSCON_STRETCH_DIS            (0x0   << 6  ) /* DIS. Disable.            */
#define I2CSCON_STRETCH_EN             (0x1   << 6  ) /* EN. Tell the device that, if I2CSCL is 0, hold it at 0.  Or if I2CSCL is 1, then when it next goes to 0 hold it at 0. */

/* I2CSCON[EARLYTXR] - Early transmit request mode. */
#define I2CSCON_EARLYTXR_BBA           (*(volatile unsigned long *) 0x42060514)
#define I2CSCON_EARLYTXR_MSK           (0x1   << 5  )
#define I2CSCON_EARLYTXR               (0x1   << 5  )
#define I2CSCON_EARLYTXR_DIS           (0x0   << 5  ) /* DIS. Disable.            */
#define I2CSCON_EARLYTXR_EN            (0x1   << 5  ) /* EN. Enable a transmit request just after the positive edge of the direction bit (READ/WRITE) I2CSCL clock pulse. */

/* I2CSCON[GCSB] - General call status bit clear. */
#define I2CSCON_GCSB_BBA               (*(volatile unsigned long *) 0x42060510)
#define I2CSCON_GCSB_MSK               (0x1   << 4  )
#define I2CSCON_GCSB                   (0x1   << 4  )
#define I2CSCON_GCSB_CLR               (0x1   << 4  ) /* CLR. Clear the General Call status and General Call ID bits. The General Call status and General Call ID bits are not reset by anything other than a write to this bit or a full reset. */

/* I2CSCON[HGC] - Hardware general call enable. */
#define I2CSCON_HGC_BBA                (*(volatile unsigned long *) 0x4206050C)
#define I2CSCON_HGC_MSK                (0x1   << 3  )
#define I2CSCON_HGC                    (0x1   << 3  )
#define I2CSCON_HGC_DIS                (0x0   << 3  ) /* DIS. Disable.            */
#define I2CSCON_HGC_EN                 (0x1   << 3  ) /* EN. When this bit and the General Call enable bit are set the device after receiving a general call, Address 0x00 and a data byte checks the contents of the I2CALT against the receive shift register. If they match, the device has received a hardware general call. This is used if a device needs urgent attention from a master device without knowing which master it needs to turn to. This is a broadcast message to all master devices in the bus. The device that requires attention embeds its own address into the message. The LSB of the I2CALT register should always be written to a 1. */

/* I2CSCON[GC] - General call enable. */
#define I2CSCON_GC_BBA                 (*(volatile unsigned long *) 0x42060508)
#define I2CSCON_GC_MSK                 (0x1   << 2  )
#define I2CSCON_GC                     (0x1   << 2  )
#define I2CSCON_GC_DIS                 (0x0   << 2  ) /* DIS. Disable.            */
#define I2CSCON_GC_EN                  (0x1   << 2  ) /* EN. Enable the I2C slave to ACK an I2C general call, Address 0x00 (write). */

/* I2CSCON[ADR10] - Enable 10 bit addressing. */
#define I2CSCON_ADR10_BBA              (*(volatile unsigned long *) 0x42060504)
#define I2CSCON_ADR10_MSK              (0x1   << 1  )
#define I2CSCON_ADR10                  (0x1   << 1  )
#define I2CSCON_ADR10_DIS              (0x0   << 1  ) /* DIS. If this bit is clear, the slave can support four slave addresses, programmed in Registers I2CID0 to I2CID3. */
#define I2CSCON_ADR10_EN               (0x1   << 1  ) /* EN. Enable 10-bit addressing. One 10-bit address is supported by the slave and is stored in I2CID0 and I2CID1, where I2CID0 contains the first byte of the address and the upper five bits must be programmed to 11110' I2CID2 and I2CID3 can be programmed with 7-bit addresses at the same time. */

/* I2CSCON[SLV] - Slave enable. */
#define I2CSCON_SLV_BBA                (*(volatile unsigned long *) 0x42060500)
#define I2CSCON_SLV_MSK                (0x1   << 0  )
#define I2CSCON_SLV                    (0x1   << 0  )
#define I2CSCON_SLV_DIS                (0x0   << 0  ) /* DIS. Disable the slave and all slave state machine flops are held in reset. */
#define I2CSCON_SLV_EN                 (0x1   << 0  ) /* EN. Enable slave.        */

/* Reset Value for I2CSSTA*/
#define I2CSSTA_RVAL                   0x1

