contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* I2CSSTA[START] - Start and matching address. */
#define I2CSSTA_START_BBA              (*(volatile unsigned long *) 0x420605B8)
#define I2CSSTA_START_MSK              (0x1   << 14 )
#define I2CSSTA_START                  (0x1   << 14 )
#define I2CSSTA_START_CLR              (0x0   << 14 ) /* CLR. Cleared on receipt of either a stop or start condition. */
#define I2CSSTA_START_SET              (0x1   << 14 ) /* SET. Set if a start is detected on I2CSCL/I2CSDA and one of the following is true: The device address is matched.  A general call (GC = 0000_0000) code is received and GC is enabled.  A high speed (HS = 0000_1XXX) code is received. A start byte (0000_0001) is received. */

/* I2CSSTA[REPSTART] - Repeated start and matching address. (Can drive an interrupt). */
#define I2CSSTA_REPSTART_BBA           (*(volatile unsigned long *) 0x420605B4)
#define I2CSSTA_REPSTART_MSK           (0x1   << 13 )
#define I2CSSTA_REPSTART               (0x1   << 13 )
#define I2CSSTA_REPSTART_CLR           (0x0   << 13 ) /* CLR. Cleared when read or on receipt of a stop condition. */
#define I2CSSTA_REPSTART_SET           (0x1   << 13 ) /* SET. Set if START (I2CSSTA[14]) is already asserted and then a repeated start is detected. */

/* I2CSSTA[IDMAT] - Device ID matched. */
#define I2CSSTA_IDMAT_MSK              (0x3   << 11 )

/* I2CSSTA[STOP] - Stop after start and matching address. (Can drive an interrupt). */
#define I2CSSTA_STOP_BBA               (*(volatile unsigned long *) 0x420605A8)
#define I2CSSTA_STOP_MSK               (0x1   << 10 )
#define I2CSSTA_STOP                   (0x1   << 10 )
#define I2CSSTA_STOP_CLR               (0x0   << 10 ) /* CLR. Cleared by a read of the status register. */
#define I2CSSTA_STOP_SET               (0x1   << 10 ) /* SET. Set if the slave device received a stop condition after a previous start condition and a matching address. */

/* I2CSSTA[GCID] - General call ID. Cleared when the GCSBCLR (I2CSCON[4]) is written to 1. These status bits are not cleared by a general call reset. */
#define I2CSSTA_GCID_MSK               (0x3   << 8  )

/* I2CSSTA[GCINT] - General call interrupt. (Always drives an interrupt). */
#define I2CSSTA_GCINT_BBA              (*(volatile unsigned long *) 0x4206059C)
#define I2CSSTA_GCINT_MSK              (0x1   << 7  )
#define I2CSSTA_GCINT                  (0x1   << 7  )
#define I2CSSTA_GCINT_CLR              (0x0   << 7  ) /* CLR. To clear this bit, write 1 to the I2CSCON[4].  If it was a general call reset, all registers are at their default values. If it was a hardware general call, the Rx FIFO holds the second byte of the general call and this can be compared with the ALT register. */
#define I2CSSTA_GCINT_SET              (0x1   << 7  ) /* SET. Set if the slave device receives a general call of any type. */

/* I2CSSTA[BUSY] - Slave busy. */
#define I2CSSTA_BUSY_BBA               (*(volatile unsigned long *) 0x42060598)
#define I2CSSTA_BUSY_MSK               (0x1   << 6  )
#define I2CSSTA_BUSY                   (0x1   << 6  )
#define I2CSSTA_BUSY_CLR               (0x0   << 6  ) /* CLR. Cleared by hardware on any of the following conditions: The address does not match an ID register, the slave device receives a I2C stop condition or if a repeated start address doesnt match. */
#define I2CSSTA_BUSY_SET               (0x1   << 6  ) /* SET. Set if the slave device receives an I2C start condition. */

/* I2CSSTA[NOACK] - NACK generated by the slave. */
#define I2CSSTA_NOACK_BBA              (*(volatile unsigned long *) 0x42060594)
#define I2CSSTA_NOACK_MSK              (0x1   << 5  )
#define I2CSSTA_NOACK                  (0x1   << 5  )
#define I2CSSTA_NOACK_CLR              (0x0   << 5  ) /* CLR. Cleared on a read of the I2CSSTA register. */
#define I2CSSTA_NOACK_SET              (0x1   << 5  ) /* SET. Set to indicate that the slave responded to its device address with a NACK. Set under any of the following conditions: If there was no data to transmit and sequence was a slave read, the device address is NACK'ed or if the NACK bit was set in the slave control register and the device was addressed. */

/* I2CSSTA[RXOF] - Receive FIFO overflow. */
#define I2CSSTA_RXOF_BBA               (*(volatile unsigned long *) 0x42060590)
#define I2CSSTA_RXOF_MSK               (0x1   << 4  )
#define I2CSSTA_RXOF                   (0x1   << 4  )
#define I2CSSTA_RXOF_CLR               (0x0   << 4  ) /* CLR. Cleared.            */
#define I2CSSTA_RXOF_SET               (0x1   << 4  ) /* SET. Set when a byte is written to the receive FIFO when the FIFO is already full. */

/* I2CSSTA[RXREQ] - Receive request. (Can drive an interrupt). */
#define I2CSSTA_RXREQ_BBA              (*(volatile unsigned long *) 0x4206058C)
#define I2CSSTA_RXREQ_MSK              (0x1   << 3  )
#define I2CSSTA_RXREQ                  (0x1   << 3  )
#define I2CSSTA_RXREQ_CLR              (0x0   << 3  ) /* CLR. Cleared when the receive FIFO is read or flushed. */
#define I2CSSTA_RXREQ_SET              (0x1   << 3  ) /* SET. Set when the receive FIFO is not empty. Set on the falling edge of the I2CSCL clock pulse that clocks in the last data bit of a byte. */

/* I2CSSTA[TXREQ] - Transmit request. (Can drive an interrupt). */
#define I2CSSTA_TXREQ_BBA              (*(volatile unsigned long *) 0x42060588)
#define I2CSSTA_TXREQ_MSK              (0x1   << 2  )
#define I2CSSTA_TXREQ                  (0x1   << 2  )
#define I2CSSTA_TXREQ_CLR              (0x0   << 2  ) /* CLR. This bit is cleared on a read of the I2CSSTA register. */
#define I2CSSTA_TXREQ_SET              (0x1   << 2  ) /* SET. If EARLYTXR = 0, TXREQ is set when the direction bit for a transfer is received high. Thereafter, as long as the transmit FIFO is not full, this bit remains asserted. Initially, it is asserted on the negative edge of the SCL pulse that clocks in the direction bit (if the device address matched also). If EARLYTXR = 1, TXREQ is set when the direction bit for a transfer is received high. Thereafter, as long as the transmit FIFO is not full, this bit will remain asserted. Initially, it is asserted after the positive edge of the SCL pulse that clocks in the direction bit (if the device address matched also). */

