contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* Reset Value for EI0CFG*/
#define EI0CFG_RVAL                    0x0

/* EI0CFG[IRQ3EN] - External interrupt 3 enable bit. */
#define EI0CFG_IRQ3EN_BBA              (*(volatile unsigned long *) 0x4204843C)
#define EI0CFG_IRQ3EN_MSK              (0x1   << 15 )
#define EI0CFG_IRQ3EN                  (0x1   << 15 )
#define EI0CFG_IRQ3EN_DIS              (0x0   << 15 ) /* DIS. External interrupt 3 disabled. */
#define EI0CFG_IRQ3EN_EN               (0x1   << 15 ) /* EN. External Interrupt 3 enabled. */

/* EI0CFG[IRQ3MDE] - External interrupt 3 detection mode. */
#define EI0CFG_IRQ3MDE_MSK             (0x7   << 12 )
#define EI0CFG_IRQ3MDE_RISE            (0x0   << 12 ) /* RISE. Rising edge.       */
#define EI0CFG_IRQ3MDE_FALL            (0x1   << 12 ) /* FALL. Falling edge.      */
#define EI0CFG_IRQ3MDE_RISEORFALL      (0x2   << 12 ) /* RISEORFALL. Rising or falling edge. */
#define EI0CFG_IRQ3MDE_HIGHLEVEL       (0x3   << 12 ) /* HIGHLEVEL. High level.   */
#define EI0CFG_IRQ3MDE_LOWLEVEL        (0x4   << 12 ) /* LOWLEVEL. Low level.     */

/* EI0CFG[IRQ2EN] - External interrupt 2 enable bit. */
#define EI0CFG_IRQ2EN_BBA              (*(volatile unsigned long *) 0x4204842C)
#define EI0CFG_IRQ2EN_MSK              (0x1   << 11 )
#define EI0CFG_IRQ2EN                  (0x1   << 11 )
#define EI0CFG_IRQ2EN_DIS              (0x0   << 11 ) /* DIS. External interrupt 2 disabled. */
#define EI0CFG_IRQ2EN_EN               (0x1   << 11 ) /* EN. External Interrupt 2 enabled. */

/* EI0CFG[IRQ2MDE] - External interrupt 2 detection mode. */
#define EI0CFG_IRQ2MDE_MSK             (0x7   << 8  )
#define EI0CFG_IRQ2MDE_RISE            (0x0   << 8  ) /* RISE. Rising edge.       */
#define EI0CFG_IRQ2MDE_FALL            (0x1   << 8  ) /* FALL. Falling edge.      */
#define EI0CFG_IRQ2MDE_RISEORFALL      (0x2   << 8  ) /* RISEORFALL. Rising or falling edge. */
#define EI0CFG_IRQ2MDE_HIGHLEVEL       (0x3   << 8  ) /* HIGHLEVEL. High level.   */
#define EI0CFG_IRQ2MDE_LOWLEVEL        (0x4   << 8  ) /* LOWLEVEL. Low level.     */

/* EI0CFG[IRQ1EN] - External interrupt 1 enable bit. */
#define EI0CFG_IRQ1EN_BBA              (*(volatile unsigned long *) 0x4204841C)
#define EI0CFG_IRQ1EN_MSK              (0x1   << 7  )
#define EI0CFG_IRQ1EN                  (0x1   << 7  )
#define EI0CFG_IRQ1EN_DIS              (0x0   << 7  ) /* DIS. External interrupt 1 disabled. */
#define EI0CFG_IRQ1EN_EN               (0x1   << 7  ) /* EN. External Interrupt 1 enabled. */

/* EI0CFG[IRQ1MDE] - External interrupt 1 detection mode. */
#define EI0CFG_IRQ1MDE_MSK             (0x7   << 4  )
#define EI0CFG_IRQ1MDE_RISE            (0x0   << 4  ) /* RISE. Rising edge.       */
#define EI0CFG_IRQ1MDE_FALL            (0x1   << 4  ) /* FALL. Falling edge.      */
#define EI0CFG_IRQ1MDE_RISEORFALL      (0x2   << 4  ) /* RISEORFALL. Rising or falling edge. */
#define EI0CFG_IRQ1MDE_HIGHLEVEL       (0x3   << 4  ) /* HIGHLEVEL. High level.   */
#define EI0CFG_IRQ1MDE_LOWLEVEL        (0x4   << 4  ) /* LOWLEVEL. Low level.     */

/* EI0CFG[IRQ0EN] - RF transceiver clock IRQ enable bit. */
#define EI0CFG_IRQ0EN_BBA              (*(volatile unsigned long *) 0x4204840C)
#define EI0CFG_IRQ0EN_MSK              (0x1   << 3  )
#define EI0CFG_IRQ0EN                  (0x1   << 3  )
#define EI0CFG_IRQ0EN_DIS              (0x0   << 3  ) /* DIS. RF transceiver clock IRQ disabled. */
#define EI0CFG_IRQ0EN_EN               (0x1   << 3  ) /* EN. RF transceiver clock IRQ enabled. */

/* EI0CFG[IRQ0MDE] - RF transceiver clock detection mode. */
#define EI0CFG_IRQ0MDE_MSK             (0x7   << 0  )
#define EI0CFG_IRQ0MDE_RISE            (0x0   << 0  ) /* RISE. Rising edge.       */
#define EI0CFG_IRQ0MDE_FALL            (0x1   << 0  ) /* FALL. Falling edge.      */
#define EI0CFG_IRQ0MDE_RISEORFALL      (0x2   << 0  ) /* RISEORFALL. Rising or falling edge. */
#define EI0CFG_IRQ0MDE_HIGHLEVEL       (0x3   << 0  ) /* HIGHLEVEL. High level.   */
#define EI0CFG_IRQ0MDE_LOWLEVEL        (0x4   << 0  ) /* LOWLEVEL. Low level.     */

/* Reset Value for EI1CFG*/
#define EI1CFG_RVAL                    0x0

/* EI1CFG[IRQ7EN] - External interrupt 7 enable bit. */
#define EI1CFG_IRQ7EN_BBA              (*(volatile unsigned long *) 0x420484BC)
#define EI1CFG_IRQ7EN_MSK              (0x1   << 15 )
#define EI1CFG_IRQ7EN                  (0x1   << 15 )
#define EI1CFG_IRQ7EN_DIS              (0x0   << 15 ) /* DIS. External interrupt 7 disabled. */
#define EI1CFG_IRQ7EN_EN               (0x1   << 15 ) /* EN. External interrupt 7 enabled. */

/* EI1CFG[IRQ7MDE] - External interrupt 7 detection mode. */
#define EI1CFG_IRQ7MDE_MSK             (0x7   << 12 )
#define EI1CFG_IRQ7MDE_RISE            (0x0   << 12 ) /* RISE. Rising edge.       */
#define EI1CFG_IRQ7MDE_FALL            (0x1   << 12 ) /* FALL. Falling edge.      */
#define EI1CFG_IRQ7MDE_RISEORFALL      (0x2   << 12 ) /* RISEORFALL. Rising or falling edge. */
#define EI1CFG_IRQ7MDE_HIGHLEVEL       (0x3   << 12 ) /* HIGHLEVEL. High level.   */
#define EI1CFG_IRQ7MDE_LOWLEVEL        (0x4   << 12 ) /* LOWLEVEL. Low level.     */

/* EI1CFG[IRQ6EN] - External interrupt 6 enable bit. */
#define EI1CFG_IRQ6EN_BBA              (*(volatile unsigned long *) 0x420484AC)
#define EI1CFG_IRQ6EN_MSK              (0x1   << 11 )
#define EI1CFG_IRQ6EN                  (0x1   << 11 )
#define EI1CFG_IRQ6EN_DIS              (0x0   << 11 ) /* DIS. External interrupt 6 disabled. */
#define EI1CFG_IRQ6EN_EN               (0x1   << 11 ) /* EN. External Interrupt 6 enabled. */

/* EI1CFG[IRQ6MDE] - External interrupt 6 detection mode. */
#define EI1CFG_IRQ6MDE_MSK             (0x7   << 8  )
#define EI1CFG_IRQ6MDE_RISE            (0x0   << 8  ) /* RISE. Rising edge.       */
#define EI1CFG_IRQ6MDE_FALL            (0x1   << 8  ) /* FALL. Falling edge.      */
#define EI1CFG_IRQ6MDE_RISEORFALL      (0x2   << 8  ) /* RISEORFALL. Rising or falling edge. */
#define EI1CFG_IRQ6MDE_HIGHLEVEL       (0x3   << 8  ) /* HIGHLEVEL. High level.   */
#define EI1CFG_IRQ6MDE_LOWLEVEL        (0x4   << 8  ) /* LOWLEVEL. Low Level.     */

/* EI1CFG[IRQ5EN] - External interrupt 5 enable bit. */
#define EI1CFG_IRQ5EN_BBA              (*(volatile unsigned long *) 0x4204849C)
#define EI1CFG_IRQ5EN_MSK              (0x1   << 7  )
#define EI1CFG_IRQ5EN                  (0x1   << 7  )
#define EI1CFG_IRQ5EN_DIS              (0x0   << 7  ) /* DIS. External interrupt 5 disabled. */
#define EI1CFG_IRQ5EN_EN               (0x1   << 7  ) /* EN. External Interrupt 5 enabled. */

/* EI1CFG[IRQ5MDE] - External interrupt 5 detection mode. */
#define EI1CFG_IRQ5MDE_MSK             (0x7   << 4  )
#define EI1CFG_IRQ5MDE_RISE            (0x0   << 4  ) /* RISE. Rising edge.       */
#define EI1CFG_IRQ5MDE_FALL            (0x1   << 4  ) /* FALL. Falling edge.      */
#define EI1CFG_IRQ5MDE_RISEORFALL      (0x2   << 4  ) /* RISEORFALL. Rising or falling edge. */
#define EI1CFG_IRQ5MDE_HIGHLEVEL       (0x3   << 4  ) /* HIGHLEVEL. High level.   */
#define EI1CFG_IRQ5MDE_LOWLEVEL        (0x4   << 4  ) /* LOWLEVEL. Low Level.     */

/* EI1CFG[IRQ4EN] - External interrupt 4 enable bit. */
#define EI1CFG_IRQ4EN_BBA              (*(volatile unsigned long *) 0x4204848C)
#define EI1CFG_IRQ4EN_MSK              (0x1   << 3  )
#define EI1CFG_IRQ4EN                  (0x1   << 3  )
#define EI1CFG_IRQ4EN_DIS              (0x0   << 3  ) /* DIS. External interrupt 4 disabled. */
#define EI1CFG_IRQ4EN_EN               (0x1   << 3  ) /* EN. External Interrupt 4 enabled. */

/* EI1CFG[IRQ4MDE] - External interrupt 4 detection mode. */
#define EI1CFG_IRQ4MDE_MSK             (0x7   << 0  )
#define EI1CFG_IRQ4MDE_RISE            (0x0   << 0  ) /* RISE. Rising edge.       */
#define EI1CFG_IRQ4MDE_FALL            (0x1   << 0  ) /* FALL. Falling edge.      */
#define EI1CFG_IRQ4MDE_RISEORFALL      (0x2   << 0  ) /* RISEORFALL. Rising or falling edge. */
#define EI1CFG_IRQ4MDE_HIGHLEVEL       (0x3   << 0  ) /* HIGHLEVEL. High level.   */
#define EI1CFG_IRQ4MDE_LOWLEVEL        (0x4   << 0  ) /* LOWLEVEL. Low Level.     */

/* Reset Value for EI2CFG*/
#define EI2CFG_RVAL                    0x0

/* EI2CFG[IRQ8EN] - RF transceiver IRQ enable bit. */
#define EI2CFG_IRQ8EN_BBA              (*(volatile unsigned long *) 0x4204850C)
#define EI2CFG_IRQ8EN_MSK              (0x1   << 3  )
#define EI2CFG_IRQ8EN                  (0x1   << 3  )
#define EI2CFG_IRQ8EN_DIS              (0x0   << 3  ) /* DIS. RF transceiver IRQ disabled. */
#define EI2CFG_IRQ8EN_EN               (0x1   << 3  ) /* EN.  RF transceiver IRQ enabled. */

/* EI2CFG[IRQ8MDE] - RF transceiver IRQ detection mode. */
#define EI2CFG_IRQ8MDE_MSK             (0x7   << 0  )
#define EI2CFG_IRQ8MDE_RISE            (0x0   << 0  ) /* RISE. Rising edge.       */
#define EI2CFG_IRQ8MDE_FALL            (0x1   << 0  ) /* FALL. Falling edge.      */
#define EI2CFG_IRQ8MDE_RISEORFALL      (0x2   << 0  ) /* RISEORFALL. Rising or falling edge. */
#define EI2CFG_IRQ8MDE_HIGHLEVEL       (0x3   << 0  ) /* HIGHLEVEL. High level.   */
#define EI2CFG_IRQ8MDE_LOWLEVEL        (0x4   << 0  ) /* LOWLEVEL. Low level.     */

/* Reset Value for EICLR*/
#define EICLR_RVAL                     0x0

/* EICLR[IRQ8] - External interrupt 8 (RF transceiver) clear bit. */
#define EICLR_IRQ8_BBA                 (*(volatile unsigned long *) 0x42048620)
#define EICLR_IRQ8_MSK                 (0x1   << 8  )
#define EICLR_IRQ8                     (0x1   << 8  )
#define EICLR_IRQ8_CLR                 (0x1   << 8  ) /* CLR. Clear an internal interrupt flag. */

/* EICLR[IRQ7] - External interrupt 7 clear bit. */
#define EICLR_IRQ7_BBA                 (*(volatile unsigned long *) 0x4204861C)
#define EICLR_IRQ7_MSK                 (0x1   << 7  )
#define EICLR_IRQ7                     (0x1   << 7  )
#define EICLR_IRQ7_CLR                 (0x1   << 7  ) /* CLR. Clear an internal interrupt flag. */

