contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* ISER0[T3] -  */
#define ISER0_T3_MSK                   (0x1   << 10 )
#define ISER0_T3                       (0x1   << 10 )
#define ISER0_T3_DIS                   (0x0   << 10 ) /* DIS                      */
#define ISER0_T3_EN                    (0x1   << 10 ) /* EN                       */

/* ISER0[EXTINT8] -  */
#define ISER0_EXTINT8_MSK              (0x1   << 9  )
#define ISER0_EXTINT8                  (0x1   << 9  )
#define ISER0_EXTINT8_DIS              (0x0   << 9  ) /* DIS                      */
#define ISER0_EXTINT8_EN               (0x1   << 9  ) /* EN                       */

/* ISER0[EXTINT7] -  */
#define ISER0_EXTINT7_MSK              (0x1   << 8  )
#define ISER0_EXTINT7                  (0x1   << 8  )
#define ISER0_EXTINT7_DIS              (0x0   << 8  ) /* DIS                      */
#define ISER0_EXTINT7_EN               (0x1   << 8  ) /* EN                       */

/* ISER0[EXTINT6] -  */
#define ISER0_EXTINT6_MSK              (0x1   << 7  )
#define ISER0_EXTINT6                  (0x1   << 7  )
#define ISER0_EXTINT6_DIS              (0x0   << 7  ) /* DIS                      */
#define ISER0_EXTINT6_EN               (0x1   << 7  ) /* EN                       */

/* ISER0[EXTINT5] -  */
#define ISER0_EXTINT5_MSK              (0x1   << 6  )
#define ISER0_EXTINT5                  (0x1   << 6  )
#define ISER0_EXTINT5_DIS              (0x0   << 6  ) /* DIS                      */
#define ISER0_EXTINT5_EN               (0x1   << 6  ) /* EN                       */

/* ISER0[EXTINT4] -  */
#define ISER0_EXTINT4_MSK              (0x1   << 5  )
#define ISER0_EXTINT4                  (0x1   << 5  )
#define ISER0_EXTINT4_DIS              (0x0   << 5  ) /* DIS                      */
#define ISER0_EXTINT4_EN               (0x1   << 5  ) /* EN                       */

/* ISER0[EXTINT3] -  */
#define ISER0_EXTINT3_MSK              (0x1   << 4  )
#define ISER0_EXTINT3                  (0x1   << 4  )
#define ISER0_EXTINT3_DIS              (0x0   << 4  ) /* DIS                      */
#define ISER0_EXTINT3_EN               (0x1   << 4  ) /* EN                       */

/* ISER0[EXTINT2] -  */
#define ISER0_EXTINT2_MSK              (0x1   << 3  )
#define ISER0_EXTINT2                  (0x1   << 3  )
#define ISER0_EXTINT2_DIS              (0x0   << 3  ) /* DIS                      */
#define ISER0_EXTINT2_EN               (0x1   << 3  ) /* EN                       */

/* ISER0[EXTINT1] -  */
#define ISER0_EXTINT1_MSK              (0x1   << 2  )
#define ISER0_EXTINT1                  (0x1   << 2  )
#define ISER0_EXTINT1_DIS              (0x0   << 2  ) /* DIS                      */
#define ISER0_EXTINT1_EN               (0x1   << 2  ) /* EN                       */

/* ISER0[EXTINT0] -  */
#define ISER0_EXTINT0_MSK              (0x1   << 1  )
#define ISER0_EXTINT0                  (0x1   << 1  )
#define ISER0_EXTINT0_DIS              (0x0   << 1  ) /* DIS                      */
#define ISER0_EXTINT0_EN               (0x1   << 1  ) /* EN                       */

/* ISER0[T2] -  */
#define ISER0_T2_MSK                   (0x1   << 0  )
#define ISER0_T2                       (0x1   << 0  )
#define ISER0_T2_DIS                   (0x0   << 0  ) /* DIS                      */
#define ISER0_T2_EN                    (0x1   << 0  ) /* EN                       */

/* Reset Value for ISER1*/
#define ISER1_RVAL                     0x0

/* ISER1[PWM3] -  */
#define ISER1_PWM3_MSK                 (0x1   << 9  )
#define ISER1_PWM3                     (0x1   << 9  )
#define ISER1_PWM3_DIS                 (0x0   << 9  ) /* DIS                      */
#define ISER1_PWM3_EN                  (0x1   << 9  ) /* EN                       */

/* ISER1[PWM2] -  */
#define ISER1_PWM2_MSK                 (0x1   << 8  )
#define ISER1_PWM2                     (0x1   << 8  )
#define ISER1_PWM2_DIS                 (0x0   << 8  ) /* DIS                      */
#define ISER1_PWM2_EN                  (0x1   << 8  ) /* EN                       */

/* ISER1[PWM1] -  */
#define ISER1_PWM1_MSK                 (0x1   << 7  )
#define ISER1_PWM1                     (0x1   << 7  )
#define ISER1_PWM1_DIS                 (0x0   << 7  ) /* DIS                      */
#define ISER1_PWM1_EN                  (0x1   << 7  ) /* EN                       */

/* ISER1[PWM0] -  */
#define ISER1_PWM0_MSK                 (0x1   << 6  )
#define ISER1_PWM0                     (0x1   << 6  )
#define ISER1_PWM0_DIS                 (0x0   << 6  ) /* DIS                      */
#define ISER1_PWM0_EN                  (0x1   << 6  ) /* EN                       */

/* ISER1[PWMTRIP] -  */
#define ISER1_PWMTRIP_MSK              (0x1   << 5  )
#define ISER1_PWMTRIP                  (0x1   << 5  )
#define ISER1_PWMTRIP_DIS              (0x0   << 5  ) /* DIS                      */
#define ISER1_PWMTRIP_EN               (0x1   << 5  ) /* EN                       */

/* ISER1[DMASPI0RX] -  */
#define ISER1_DMASPI0RX_MSK            (0x1   << 4  )
#define ISER1_DMASPI0RX                (0x1   << 4  )
#define ISER1_DMASPI0RX_DIS            (0x0   << 4  ) /* DIS                      */
#define ISER1_DMASPI0RX_EN             (0x1   << 4  ) /* EN                       */

/* ISER1[DMASPI0TX] -  */
#define ISER1_DMASPI0TX_MSK            (0x1   << 3  )
#define ISER1_DMASPI0TX                (0x1   << 3  )
#define ISER1_DMASPI0TX_DIS            (0x0   << 3  ) /* DIS                      */
#define ISER1_DMASPI0TX_EN             (0x1   << 3  ) /* EN                       */

/* ISER1[DMAADC] -  */
#define ISER1_DMAADC_MSK               (0x1   << 2  )
#define ISER1_DMAADC                   (0x1   << 2  )
#define ISER1_DMAADC_DIS               (0x0   << 2  ) /* DIS                      */
#define ISER1_DMAADC_EN                (0x1   << 2  ) /* EN                       */

/* Reset Value for ICER0*/
#define ICER0_RVAL                     0x0

/* ICER0[DMAI2CMRX] -  */
#define ICER0_DMAI2CMRX_MSK            (0x1   << 30 )
#define ICER0_DMAI2CMRX                (0x1   << 30 )
#define ICER0_DMAI2CMRX_DIS            (0x0   << 30 ) /* DIS                      */
#define ICER0_DMAI2CMRX_EN             (0x1   << 30 ) /* EN                       */

