contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* ICER0[DMAI2CMTX] -  */
#define ICER0_DMAI2CMTX_MSK            (0x1   << 29 )
#define ICER0_DMAI2CMTX                (0x1   << 29 )
#define ICER0_DMAI2CMTX_DIS            (0x0   << 29 ) /* DIS                      */
#define ICER0_DMAI2CMTX_EN             (0x1   << 29 ) /* EN                       */

/* ICER0[DMAI2CSRX] -  */
#define ICER0_DMAI2CSRX_MSK            (0x1   << 28 )
#define ICER0_DMAI2CSRX                (0x1   << 28 )
#define ICER0_DMAI2CSRX_DIS            (0x0   << 28 ) /* DIS                      */
#define ICER0_DMAI2CSRX_EN             (0x1   << 28 ) /* EN                       */

/* ICER0[DMAI2CSTX] -  */
#define ICER0_DMAI2CSTX_MSK            (0x1   << 27 )
#define ICER0_DMAI2CSTX                (0x1   << 27 )
#define ICER0_DMAI2CSTX_DIS            (0x0   << 27 ) /* DIS                      */
#define ICER0_DMAI2CSTX_EN             (0x1   << 27 ) /* EN                       */

/* ICER0[DMAUARTRX] -  */
#define ICER0_DMAUARTRX_MSK            (0x1   << 26 )
#define ICER0_DMAUARTRX                (0x1   << 26 )
#define ICER0_DMAUARTRX_DIS            (0x0   << 26 ) /* DIS                      */
#define ICER0_DMAUARTRX_EN             (0x1   << 26 ) /* EN                       */

/* ICER0[DMAUARTTX] -  */
#define ICER0_DMAUARTTX_MSK            (0x1   << 25 )
#define ICER0_DMAUARTTX                (0x1   << 25 )
#define ICER0_DMAUARTTX_DIS            (0x0   << 25 ) /* DIS                      */
#define ICER0_DMAUARTTX_EN             (0x1   << 25 ) /* EN                       */

/* ICER0[DMASPI1RX] -  */
#define ICER0_DMASPI1RX_MSK            (0x1   << 24 )
#define ICER0_DMASPI1RX                (0x1   << 24 )
#define ICER0_DMASPI1RX_DIS            (0x0   << 24 ) /* DIS                      */
#define ICER0_DMASPI1RX_EN             (0x1   << 24 ) /* EN                       */

/* ICER0[DMASPI1TX] -  */
#define ICER0_DMASPI1TX_MSK            (0x1   << 23 )
#define ICER0_DMASPI1TX                (0x1   << 23 )
#define ICER0_DMASPI1TX_DIS            (0x0   << 23 ) /* DIS                      */
#define ICER0_DMASPI1TX_EN             (0x1   << 23 ) /* EN                       */

/* ICER0[DMAERROR] -  */
#define ICER0_DMAERROR_MSK             (0x1   << 22 )
#define ICER0_DMAERROR                 (0x1   << 22 )
#define ICER0_DMAERROR_DIS             (0x0   << 22 ) /* DIS                      */
#define ICER0_DMAERROR_EN              (0x1   << 22 ) /* EN                       */

/* ICER0[I2CM] -  */
#define ICER0_I2CM_MSK                 (0x1   << 20 )
#define ICER0_I2CM                     (0x1   << 20 )
#define ICER0_I2CM_DIS                 (0x0   << 20 ) /* DIS                      */
#define ICER0_I2CM_EN                  (0x1   << 20 ) /* EN                       */

/* ICER0[I2CS] -  */
#define ICER0_I2CS_MSK                 (0x1   << 19 )
#define ICER0_I2CS                     (0x1   << 19 )
#define ICER0_I2CS_DIS                 (0x0   << 19 ) /* DIS                      */
#define ICER0_I2CS_EN                  (0x1   << 19 ) /* EN                       */

/* ICER0[SPI1] -  */
#define ICER0_SPI1_MSK                 (0x1   << 18 )
#define ICER0_SPI1                     (0x1   << 18 )
#define ICER0_SPI1_DIS                 (0x0   << 18 ) /* DIS                      */
#define ICER0_SPI1_EN                  (0x1   << 18 ) /* EN                       */

/* ICER0[SPI0] -  */
#define ICER0_SPI0_MSK                 (0x1   << 17 )
#define ICER0_SPI0                     (0x1   << 17 )
#define ICER0_SPI0_DIS                 (0x0   << 17 ) /* DIS                      */
#define ICER0_SPI0_EN                  (0x1   << 17 ) /* EN                       */

/* ICER0[UART] -  */
#define ICER0_UART_MSK                 (0x1   << 16 )
#define ICER0_UART                     (0x1   << 16 )
#define ICER0_UART_DIS                 (0x0   << 16 ) /* DIS                      */
#define ICER0_UART_EN                  (0x1   << 16 ) /* EN                       */

/* ICER0[FEE] -  */
#define ICER0_FEE_MSK                  (0x1   << 15 )
#define ICER0_FEE                      (0x1   << 15 )
#define ICER0_FEE_DIS                  (0x0   << 15 ) /* DIS                      */
#define ICER0_FEE_EN                   (0x1   << 15 ) /* EN                       */

/* ICER0[ADC] -  */
#define ICER0_ADC_MSK                  (0x1   << 14 )
#define ICER0_ADC                      (0x1   << 14 )
#define ICER0_ADC_DIS                  (0x0   << 14 ) /* DIS                      */
#define ICER0_ADC_EN                   (0x1   << 14 ) /* EN                       */

/* ICER0[T1] -  */
#define ICER0_T1_MSK                   (0x1   << 13 )
#define ICER0_T1                       (0x1   << 13 )
#define ICER0_T1_DIS                   (0x0   << 13 ) /* DIS                      */
#define ICER0_T1_EN                    (0x1   << 13 ) /* EN                       */

/* ICER0[T0] -  */
#define ICER0_T0_MSK                   (0x1   << 12 )
#define ICER0_T0                       (0x1   << 12 )
#define ICER0_T0_DIS                   (0x0   << 12 ) /* DIS                      */
#define ICER0_T0_EN                    (0x1   << 12 ) /* EN                       */

/* ICER0[T3] -  */
#define ICER0_T3_MSK                   (0x1   << 10 )
#define ICER0_T3                       (0x1   << 10 )
#define ICER0_T3_DIS                   (0x0   << 10 ) /* DIS                      */
#define ICER0_T3_EN                    (0x1   << 10 ) /* EN                       */

/* ICER0[EXTINT8] -  */
#define ICER0_EXTINT8_MSK              (0x1   << 9  )
#define ICER0_EXTINT8                  (0x1   << 9  )
#define ICER0_EXTINT8_DIS              (0x0   << 9  ) /* DIS                      */
#define ICER0_EXTINT8_EN               (0x1   << 9  ) /* EN                       */

/* ICER0[EXTINT7] -  */
#define ICER0_EXTINT7_MSK              (0x1   << 8  )
#define ICER0_EXTINT7                  (0x1   << 8  )
#define ICER0_EXTINT7_DIS              (0x0   << 8  ) /* DIS                      */
#define ICER0_EXTINT7_EN               (0x1   << 8  ) /* EN                       */

/* ICER0[EXTINT6] -  */
#define ICER0_EXTINT6_MSK              (0x1   << 7  )
#define ICER0_EXTINT6                  (0x1   << 7  )
#define ICER0_EXTINT6_DIS              (0x0   << 7  ) /* DIS                      */
#define ICER0_EXTINT6_EN               (0x1   << 7  ) /* EN                       */

