contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* ISPR0[DMAERROR] -  */
#define ISPR0_DMAERROR_MSK             (0x1   << 22 )
#define ISPR0_DMAERROR                 (0x1   << 22 )
#define ISPR0_DMAERROR_DIS             (0x0   << 22 ) /* DIS                      */
#define ISPR0_DMAERROR_EN              (0x1   << 22 ) /* EN                       */

/* ISPR0[I2CM] -  */
#define ISPR0_I2CM_MSK                 (0x1   << 20 )
#define ISPR0_I2CM                     (0x1   << 20 )
#define ISPR0_I2CM_DIS                 (0x0   << 20 ) /* DIS                      */
#define ISPR0_I2CM_EN                  (0x1   << 20 ) /* EN                       */

/* ISPR0[I2CS] -  */
#define ISPR0_I2CS_MSK                 (0x1   << 19 )
#define ISPR0_I2CS                     (0x1   << 19 )
#define ISPR0_I2CS_DIS                 (0x0   << 19 ) /* DIS                      */
#define ISPR0_I2CS_EN                  (0x1   << 19 ) /* EN                       */

/* ISPR0[SPI1] -  */
#define ISPR0_SPI1_MSK                 (0x1   << 18 )
#define ISPR0_SPI1                     (0x1   << 18 )
#define ISPR0_SPI1_DIS                 (0x0   << 18 ) /* DIS                      */
#define ISPR0_SPI1_EN                  (0x1   << 18 ) /* EN                       */

/* ISPR0[SPI0] -  */
#define ISPR0_SPI0_MSK                 (0x1   << 17 )
#define ISPR0_SPI0                     (0x1   << 17 )
#define ISPR0_SPI0_DIS                 (0x0   << 17 ) /* DIS                      */
#define ISPR0_SPI0_EN                  (0x1   << 17 ) /* EN                       */

/* ISPR0[UART] -  */
#define ISPR0_UART_MSK                 (0x1   << 16 )
#define ISPR0_UART                     (0x1   << 16 )
#define ISPR0_UART_DIS                 (0x0   << 16 ) /* DIS                      */
#define ISPR0_UART_EN                  (0x1   << 16 ) /* EN                       */

/* ISPR0[FEE] -  */
#define ISPR0_FEE_MSK                  (0x1   << 15 )
#define ISPR0_FEE                      (0x1   << 15 )
#define ISPR0_FEE_DIS                  (0x0   << 15 ) /* DIS                      */
#define ISPR0_FEE_EN                   (0x1   << 15 ) /* EN                       */

/* ISPR0[ADC] -  */
#define ISPR0_ADC_MSK                  (0x1   << 14 )
#define ISPR0_ADC                      (0x1   << 14 )
#define ISPR0_ADC_DIS                  (0x0   << 14 ) /* DIS                      */
#define ISPR0_ADC_EN                   (0x1   << 14 ) /* EN                       */

/* ISPR0[T1] -  */
#define ISPR0_T1_MSK                   (0x1   << 13 )
#define ISPR0_T1                       (0x1   << 13 )
#define ISPR0_T1_DIS                   (0x0   << 13 ) /* DIS                      */
#define ISPR0_T1_EN                    (0x1   << 13 ) /* EN                       */

/* ISPR0[T0] -  */
#define ISPR0_T0_MSK                   (0x1   << 12 )
#define ISPR0_T0                       (0x1   << 12 )
#define ISPR0_T0_DIS                   (0x0   << 12 ) /* DIS                      */
#define ISPR0_T0_EN                    (0x1   << 12 ) /* EN                       */

/* ISPR0[T3] -  */
#define ISPR0_T3_MSK                   (0x1   << 10 )
#define ISPR0_T3                       (0x1   << 10 )
#define ISPR0_T3_DIS                   (0x0   << 10 ) /* DIS                      */
#define ISPR0_T3_EN                    (0x1   << 10 ) /* EN                       */

/* ISPR0[EXTINT8] -  */
#define ISPR0_EXTINT8_MSK              (0x1   << 9  )
#define ISPR0_EXTINT8                  (0x1   << 9  )
#define ISPR0_EXTINT8_DIS              (0x0   << 9  ) /* DIS                      */
#define ISPR0_EXTINT8_EN               (0x1   << 9  ) /* EN                       */

/* ISPR0[EXTINT7] -  */
#define ISPR0_EXTINT7_MSK              (0x1   << 8  )
#define ISPR0_EXTINT7                  (0x1   << 8  )
#define ISPR0_EXTINT7_DIS              (0x0   << 8  ) /* DIS                      */
#define ISPR0_EXTINT7_EN               (0x1   << 8  ) /* EN                       */

/* ISPR0[EXTINT6] -  */
#define ISPR0_EXTINT6_MSK              (0x1   << 7  )
#define ISPR0_EXTINT6                  (0x1   << 7  )
#define ISPR0_EXTINT6_DIS              (0x0   << 7  ) /* DIS                      */
#define ISPR0_EXTINT6_EN               (0x1   << 7  ) /* EN                       */

/* ISPR0[EXTINT5] -  */
#define ISPR0_EXTINT5_MSK              (0x1   << 6  )
#define ISPR0_EXTINT5                  (0x1   << 6  )
#define ISPR0_EXTINT5_DIS              (0x0   << 6  ) /* DIS                      */
#define ISPR0_EXTINT5_EN               (0x1   << 6  ) /* EN                       */

/* ISPR0[EXTINT4] -  */
#define ISPR0_EXTINT4_MSK              (0x1   << 5  )
#define ISPR0_EXTINT4                  (0x1   << 5  )
#define ISPR0_EXTINT4_DIS              (0x0   << 5  ) /* DIS                      */
#define ISPR0_EXTINT4_EN               (0x1   << 5  ) /* EN                       */

/* ISPR0[EXTINT3] -  */
#define ISPR0_EXTINT3_MSK              (0x1   << 4  )
#define ISPR0_EXTINT3                  (0x1   << 4  )
#define ISPR0_EXTINT3_DIS              (0x0   << 4  ) /* DIS                      */
#define ISPR0_EXTINT3_EN               (0x1   << 4  ) /* EN                       */

/* ISPR0[EXTINT2] -  */
#define ISPR0_EXTINT2_MSK              (0x1   << 3  )
#define ISPR0_EXTINT2                  (0x1   << 3  )
#define ISPR0_EXTINT2_DIS              (0x0   << 3  ) /* DIS                      */
#define ISPR0_EXTINT2_EN               (0x1   << 3  ) /* EN                       */

/* ISPR0[EXTINT1] -  */
#define ISPR0_EXTINT1_MSK              (0x1   << 2  )
#define ISPR0_EXTINT1                  (0x1   << 2  )
#define ISPR0_EXTINT1_DIS              (0x0   << 2  ) /* DIS                      */
#define ISPR0_EXTINT1_EN               (0x1   << 2  ) /* EN                       */

/* ISPR0[EXTINT0] -  */
#define ISPR0_EXTINT0_MSK              (0x1   << 1  )
#define ISPR0_EXTINT0                  (0x1   << 1  )
#define ISPR0_EXTINT0_DIS              (0x0   << 1  ) /* DIS                      */
#define ISPR0_EXTINT0_EN               (0x1   << 1  ) /* EN                       */

/* ISPR0[T2] -  */
#define ISPR0_T2_MSK                   (0x1   << 0  )
#define ISPR0_T2                       (0x1   << 0  )
#define ISPR0_T2_DIS                   (0x0   << 0  ) /* DIS                      */
#define ISPR0_T2_EN                    (0x1   << 0  ) /* EN                       */

/* Reset Value for ISPR1*/
#define ISPR1_RVAL                     0x0

/* ISPR1[PWM3] -  */
#define ISPR1_PWM3_MSK                 (0x1   << 9  )
#define ISPR1_PWM3                     (0x1   << 9  )
#define ISPR1_PWM3_DIS                 (0x0   << 9  ) /* DIS                      */
#define ISPR1_PWM3_EN                  (0x1   << 9  ) /* EN                       */

