contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* ICPR0[T1] -  */
#define ICPR0_T1_MSK                   (0x1   << 13 )
#define ICPR0_T1                       (0x1   << 13 )
#define ICPR0_T1_DIS                   (0x0   << 13 ) /* DIS                      */
#define ICPR0_T1_EN                    (0x1   << 13 ) /* EN                       */

/* ICPR0[T0] -  */
#define ICPR0_T0_MSK                   (0x1   << 12 )
#define ICPR0_T0                       (0x1   << 12 )
#define ICPR0_T0_DIS                   (0x0   << 12 ) /* DIS                      */
#define ICPR0_T0_EN                    (0x1   << 12 ) /* EN                       */

/* ICPR0[T3] -  */
#define ICPR0_T3_MSK                   (0x1   << 10 )
#define ICPR0_T3                       (0x1   << 10 )
#define ICPR0_T3_DIS                   (0x0   << 10 ) /* DIS                      */
#define ICPR0_T3_EN                    (0x1   << 10 ) /* EN                       */

/* ICPR0[EXTINT8] -  */
#define ICPR0_EXTINT8_MSK              (0x1   << 9  )
#define ICPR0_EXTINT8                  (0x1   << 9  )
#define ICPR0_EXTINT8_DIS              (0x0   << 9  ) /* DIS                      */
#define ICPR0_EXTINT8_EN               (0x1   << 9  ) /* EN                       */

/* ICPR0[EXTINT7] -  */
#define ICPR0_EXTINT7_MSK              (0x1   << 8  )
#define ICPR0_EXTINT7                  (0x1   << 8  )
#define ICPR0_EXTINT7_DIS              (0x0   << 8  ) /* DIS                      */
#define ICPR0_EXTINT7_EN               (0x1   << 8  ) /* EN                       */

/* ICPR0[EXTINT6] -  */
#define ICPR0_EXTINT6_MSK              (0x1   << 7  )
#define ICPR0_EXTINT6                  (0x1   << 7  )
#define ICPR0_EXTINT6_DIS              (0x0   << 7  ) /* DIS                      */
#define ICPR0_EXTINT6_EN               (0x1   << 7  ) /* EN                       */

/* ICPR0[EXTINT5] -  */
#define ICPR0_EXTINT5_MSK              (0x1   << 6  )
#define ICPR0_EXTINT5                  (0x1   << 6  )
#define ICPR0_EXTINT5_DIS              (0x0   << 6  ) /* DIS                      */
#define ICPR0_EXTINT5_EN               (0x1   << 6  ) /* EN                       */

/* ICPR0[EXTINT4] -  */
#define ICPR0_EXTINT4_MSK              (0x1   << 5  )
#define ICPR0_EXTINT4                  (0x1   << 5  )
#define ICPR0_EXTINT4_DIS              (0x0   << 5  ) /* DIS                      */
#define ICPR0_EXTINT4_EN               (0x1   << 5  ) /* EN                       */

/* ICPR0[EXTINT3] -  */
#define ICPR0_EXTINT3_MSK              (0x1   << 4  )
#define ICPR0_EXTINT3                  (0x1   << 4  )
#define ICPR0_EXTINT3_DIS              (0x0   << 4  ) /* DIS                      */
#define ICPR0_EXTINT3_EN               (0x1   << 4  ) /* EN                       */

/* ICPR0[EXTINT2] -  */
#define ICPR0_EXTINT2_MSK              (0x1   << 3  )
#define ICPR0_EXTINT2                  (0x1   << 3  )
#define ICPR0_EXTINT2_DIS              (0x0   << 3  ) /* DIS                      */
#define ICPR0_EXTINT2_EN               (0x1   << 3  ) /* EN                       */

/* ICPR0[EXTINT1] -  */
#define ICPR0_EXTINT1_MSK              (0x1   << 2  )
#define ICPR0_EXTINT1                  (0x1   << 2  )
#define ICPR0_EXTINT1_DIS              (0x0   << 2  ) /* DIS                      */
#define ICPR0_EXTINT1_EN               (0x1   << 2  ) /* EN                       */

/* ICPR0[EXTINT0] -  */
#define ICPR0_EXTINT0_MSK              (0x1   << 1  )
#define ICPR0_EXTINT0                  (0x1   << 1  )
#define ICPR0_EXTINT0_DIS              (0x0   << 1  ) /* DIS                      */
#define ICPR0_EXTINT0_EN               (0x1   << 1  ) /* EN                       */

/* ICPR0[T2] -  */
#define ICPR0_T2_MSK                   (0x1   << 0  )
#define ICPR0_T2                       (0x1   << 0  )
#define ICPR0_T2_DIS                   (0x0   << 0  ) /* DIS                      */
#define ICPR0_T2_EN                    (0x1   << 0  ) /* EN                       */

/* Reset Value for ICPR1*/
#define ICPR1_RVAL                     0x0

/* ICPR1[PWM3] -  */
#define ICPR1_PWM3_MSK                 (0x1   << 9  )
#define ICPR1_PWM3                     (0x1   << 9  )
#define ICPR1_PWM3_DIS                 (0x0   << 9  ) /* DIS                      */
#define ICPR1_PWM3_EN                  (0x1   << 9  ) /* EN                       */

/* ICPR1[PWM2] -  */
#define ICPR1_PWM2_MSK                 (0x1   << 8  )
#define ICPR1_PWM2                     (0x1   << 8  )
#define ICPR1_PWM2_DIS                 (0x0   << 8  ) /* DIS                      */
#define ICPR1_PWM2_EN                  (0x1   << 8  ) /* EN                       */

/* ICPR1[PWM1] -  */
#define ICPR1_PWM1_MSK                 (0x1   << 7  )
#define ICPR1_PWM1                     (0x1   << 7  )
#define ICPR1_PWM1_DIS                 (0x0   << 7  ) /* DIS                      */
#define ICPR1_PWM1_EN                  (0x1   << 7  ) /* EN                       */

/* ICPR1[PWM0] -  */
#define ICPR1_PWM0_MSK                 (0x1   << 6  )
#define ICPR1_PWM0                     (0x1   << 6  )
#define ICPR1_PWM0_DIS                 (0x0   << 6  ) /* DIS                      */
#define ICPR1_PWM0_EN                  (0x1   << 6  ) /* EN                       */

/* ICPR1[PWMTRIP] -  */
#define ICPR1_PWMTRIP_MSK              (0x1   << 5  )
#define ICPR1_PWMTRIP                  (0x1   << 5  )
#define ICPR1_PWMTRIP_DIS              (0x0   << 5  ) /* DIS                      */
#define ICPR1_PWMTRIP_EN               (0x1   << 5  ) /* EN                       */

/* ICPR1[DMASPI0RX] -  */
#define ICPR1_DMASPI0RX_MSK            (0x1   << 4  )
#define ICPR1_DMASPI0RX                (0x1   << 4  )
#define ICPR1_DMASPI0RX_DIS            (0x0   << 4  ) /* DIS                      */
#define ICPR1_DMASPI0RX_EN             (0x1   << 4  ) /* EN                       */

/* ICPR1[DMASPI0TX] -  */
#define ICPR1_DMASPI0TX_MSK            (0x1   << 3  )
#define ICPR1_DMASPI0TX                (0x1   << 3  )
#define ICPR1_DMASPI0TX_DIS            (0x0   << 3  ) /* DIS                      */
#define ICPR1_DMASPI0TX_EN             (0x1   << 3  ) /* EN                       */

/* ICPR1[DMAADC] -  */
#define ICPR1_DMAADC_MSK               (0x1   << 2  )
#define ICPR1_DMAADC                   (0x1   << 2  )
#define ICPR1_DMAADC_DIS               (0x0   << 2  ) /* DIS                      */
#define ICPR1_DMAADC_EN                (0x1   << 2  ) /* EN                       */

