contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* Reset Value for IABR0*/
#define IABR0_RVAL                     0x0

/* IABR0[DMAI2CMRX] -  */
#define IABR0_DMAI2CMRX_MSK            (0x1   << 30 )
#define IABR0_DMAI2CMRX                (0x1   << 30 )
#define IABR0_DMAI2CMRX_DIS            (0x0   << 30 ) /* DIS                      */
#define IABR0_DMAI2CMRX_EN             (0x1   << 30 ) /* EN                       */

/* IABR0[DMAI2CMTX] -  */
#define IABR0_DMAI2CMTX_MSK            (0x1   << 29 )
#define IABR0_DMAI2CMTX                (0x1   << 29 )
#define IABR0_DMAI2CMTX_DIS            (0x0   << 29 ) /* DIS                      */
#define IABR0_DMAI2CMTX_EN             (0x1   << 29 ) /* EN                       */

/* IABR0[DMAI2CSRX] -  */
#define IABR0_DMAI2CSRX_MSK            (0x1   << 28 )
#define IABR0_DMAI2CSRX                (0x1   << 28 )
#define IABR0_DMAI2CSRX_DIS            (0x0   << 28 ) /* DIS                      */
#define IABR0_DMAI2CSRX_EN             (0x1   << 28 ) /* EN                       */

/* IABR0[DMAI2CSTX] -  */
#define IABR0_DMAI2CSTX_MSK            (0x1   << 27 )
#define IABR0_DMAI2CSTX                (0x1   << 27 )
#define IABR0_DMAI2CSTX_DIS            (0x0   << 27 ) /* DIS                      */
#define IABR0_DMAI2CSTX_EN             (0x1   << 27 ) /* EN                       */

/* IABR0[DMAUARTRX] -  */
#define IABR0_DMAUARTRX_MSK            (0x1   << 26 )
#define IABR0_DMAUARTRX                (0x1   << 26 )
#define IABR0_DMAUARTRX_DIS            (0x0   << 26 ) /* DIS                      */
#define IABR0_DMAUARTRX_EN             (0x1   << 26 ) /* EN                       */

/* IABR0[DMAUARTTX] -  */
#define IABR0_DMAUARTTX_MSK            (0x1   << 25 )
#define IABR0_DMAUARTTX                (0x1   << 25 )
#define IABR0_DMAUARTTX_DIS            (0x0   << 25 ) /* DIS                      */
#define IABR0_DMAUARTTX_EN             (0x1   << 25 ) /* EN                       */

/* IABR0[DMASPI1RX] -  */
#define IABR0_DMASPI1RX_MSK            (0x1   << 24 )
#define IABR0_DMASPI1RX                (0x1   << 24 )
#define IABR0_DMASPI1RX_DIS            (0x0   << 24 ) /* DIS                      */
#define IABR0_DMASPI1RX_EN             (0x1   << 24 ) /* EN                       */

/* IABR0[DMASPI1TX] -  */
#define IABR0_DMASPI1TX_MSK            (0x1   << 23 )
#define IABR0_DMASPI1TX                (0x1   << 23 )
#define IABR0_DMASPI1TX_DIS            (0x0   << 23 ) /* DIS                      */
#define IABR0_DMASPI1TX_EN             (0x1   << 23 ) /* EN                       */

/* IABR0[DMAERROR] -  */
#define IABR0_DMAERROR_MSK             (0x1   << 22 )
#define IABR0_DMAERROR                 (0x1   << 22 )
#define IABR0_DMAERROR_DIS             (0x0   << 22 ) /* DIS                      */
#define IABR0_DMAERROR_EN              (0x1   << 22 ) /* EN                       */

/* IABR0[I2CM] -  */
#define IABR0_I2CM_MSK                 (0x1   << 20 )
#define IABR0_I2CM                     (0x1   << 20 )
#define IABR0_I2CM_DIS                 (0x0   << 20 ) /* DIS                      */
#define IABR0_I2CM_EN                  (0x1   << 20 ) /* EN                       */

/* IABR0[I2CS] -  */
#define IABR0_I2CS_MSK                 (0x1   << 19 )
#define IABR0_I2CS                     (0x1   << 19 )
#define IABR0_I2CS_DIS                 (0x0   << 19 ) /* DIS                      */
#define IABR0_I2CS_EN                  (0x1   << 19 ) /* EN                       */

/* IABR0[SPI1] -  */
#define IABR0_SPI1_MSK                 (0x1   << 18 )
#define IABR0_SPI1                     (0x1   << 18 )
#define IABR0_SPI1_DIS                 (0x0   << 18 ) /* DIS                      */
#define IABR0_SPI1_EN                  (0x1   << 18 ) /* EN                       */

/* IABR0[SPI0] -  */
#define IABR0_SPI0_MSK                 (0x1   << 17 )
#define IABR0_SPI0                     (0x1   << 17 )
#define IABR0_SPI0_DIS                 (0x0   << 17 ) /* DIS                      */
#define IABR0_SPI0_EN                  (0x1   << 17 ) /* EN                       */

/* IABR0[UART] -  */
#define IABR0_UART_MSK                 (0x1   << 16 )
#define IABR0_UART                     (0x1   << 16 )
#define IABR0_UART_DIS                 (0x0   << 16 ) /* DIS                      */
#define IABR0_UART_EN                  (0x1   << 16 ) /* EN                       */

/* IABR0[FEE] -  */
#define IABR0_FEE_MSK                  (0x1   << 15 )
#define IABR0_FEE                      (0x1   << 15 )
#define IABR0_FEE_DIS                  (0x0   << 15 ) /* DIS                      */
#define IABR0_FEE_EN                   (0x1   << 15 ) /* EN                       */

/* IABR0[ADC] -  */
#define IABR0_ADC_MSK                  (0x1   << 14 )
#define IABR0_ADC                      (0x1   << 14 )
#define IABR0_ADC_DIS                  (0x0   << 14 ) /* DIS                      */
#define IABR0_ADC_EN                   (0x1   << 14 ) /* EN                       */

/* IABR0[T1] -  */
#define IABR0_T1_MSK                   (0x1   << 13 )
#define IABR0_T1                       (0x1   << 13 )
#define IABR0_T1_DIS                   (0x0   << 13 ) /* DIS                      */
#define IABR0_T1_EN                    (0x1   << 13 ) /* EN                       */

/* IABR0[T0] -  */
#define IABR0_T0_MSK                   (0x1   << 12 )
#define IABR0_T0                       (0x1   << 12 )
#define IABR0_T0_DIS                   (0x0   << 12 ) /* DIS                      */
#define IABR0_T0_EN                    (0x1   << 12 ) /* EN                       */

/* IABR0[T3] -  */
#define IABR0_T3_MSK                   (0x1   << 10 )
#define IABR0_T3                       (0x1   << 10 )
#define IABR0_T3_DIS                   (0x0   << 10 ) /* DIS                      */
#define IABR0_T3_EN                    (0x1   << 10 ) /* EN                       */

/* IABR0[EXTINT8] -  */
#define IABR0_EXTINT8_MSK              (0x1   << 9  )
#define IABR0_EXTINT8                  (0x1   << 9  )
#define IABR0_EXTINT8_DIS              (0x0   << 9  ) /* DIS                      */
#define IABR0_EXTINT8_EN               (0x1   << 9  ) /* EN                       */

