contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* IABR0[EXTINT7] -  */
#define IABR0_EXTINT7_MSK              (0x1   << 8  )
#define IABR0_EXTINT7                  (0x1   << 8  )
#define IABR0_EXTINT7_DIS              (0x0   << 8  ) /* DIS                      */
#define IABR0_EXTINT7_EN               (0x1   << 8  ) /* EN                       */

/* IABR0[EXTINT6] -  */
#define IABR0_EXTINT6_MSK              (0x1   << 7  )
#define IABR0_EXTINT6                  (0x1   << 7  )
#define IABR0_EXTINT6_DIS              (0x0   << 7  ) /* DIS                      */
#define IABR0_EXTINT6_EN               (0x1   << 7  ) /* EN                       */

/* IABR0[EXTINT5] -  */
#define IABR0_EXTINT5_MSK              (0x1   << 6  )
#define IABR0_EXTINT5                  (0x1   << 6  )
#define IABR0_EXTINT5_DIS              (0x0   << 6  ) /* DIS                      */
#define IABR0_EXTINT5_EN               (0x1   << 6  ) /* EN                       */

/* IABR0[EXTINT4] -  */
#define IABR0_EXTINT4_MSK              (0x1   << 5  )
#define IABR0_EXTINT4                  (0x1   << 5  )
#define IABR0_EXTINT4_DIS              (0x0   << 5  ) /* DIS                      */
#define IABR0_EXTINT4_EN               (0x1   << 5  ) /* EN                       */

/* IABR0[EXTINT3] -  */
#define IABR0_EXTINT3_MSK              (0x1   << 4  )
#define IABR0_EXTINT3                  (0x1   << 4  )
#define IABR0_EXTINT3_DIS              (0x0   << 4  ) /* DIS                      */
#define IABR0_EXTINT3_EN               (0x1   << 4  ) /* EN                       */

/* IABR0[EXTINT2] -  */
#define IABR0_EXTINT2_MSK              (0x1   << 3  )
#define IABR0_EXTINT2                  (0x1   << 3  )
#define IABR0_EXTINT2_DIS              (0x0   << 3  ) /* DIS                      */
#define IABR0_EXTINT2_EN               (0x1   << 3  ) /* EN                       */

/* IABR0[EXTINT1] -  */
#define IABR0_EXTINT1_MSK              (0x1   << 2  )
#define IABR0_EXTINT1                  (0x1   << 2  )
#define IABR0_EXTINT1_DIS              (0x0   << 2  ) /* DIS                      */
#define IABR0_EXTINT1_EN               (0x1   << 2  ) /* EN                       */

/* IABR0[EXTINT0] -  */
#define IABR0_EXTINT0_MSK              (0x1   << 1  )
#define IABR0_EXTINT0                  (0x1   << 1  )
#define IABR0_EXTINT0_DIS              (0x0   << 1  ) /* DIS                      */
#define IABR0_EXTINT0_EN               (0x1   << 1  ) /* EN                       */

/* IABR0[T2] -  */
#define IABR0_T2_MSK                   (0x1   << 0  )
#define IABR0_T2                       (0x1   << 0  )
#define IABR0_T2_DIS                   (0x0   << 0  ) /* DIS                      */
#define IABR0_T2_EN                    (0x1   << 0  ) /* EN                       */

/* Reset Value for IABR1*/
#define IABR1_RVAL                     0x0

/* IABR1[PWM3] -  */
#define IABR1_PWM3_MSK                 (0x1   << 9  )
#define IABR1_PWM3                     (0x1   << 9  )
#define IABR1_PWM3_DIS                 (0x0   << 9  ) /* DIS                      */
#define IABR1_PWM3_EN                  (0x1   << 9  ) /* EN                       */

/* IABR1[PWM2] -  */
#define IABR1_PWM2_MSK                 (0x1   << 8  )
#define IABR1_PWM2                     (0x1   << 8  )
#define IABR1_PWM2_DIS                 (0x0   << 8  ) /* DIS                      */
#define IABR1_PWM2_EN                  (0x1   << 8  ) /* EN                       */

/* IABR1[PWM1] -  */
#define IABR1_PWM1_MSK                 (0x1   << 7  )
#define IABR1_PWM1                     (0x1   << 7  )
#define IABR1_PWM1_DIS                 (0x0   << 7  ) /* DIS                      */
#define IABR1_PWM1_EN                  (0x1   << 7  ) /* EN                       */

/* IABR1[PWM0] -  */
#define IABR1_PWM0_MSK                 (0x1   << 6  )
#define IABR1_PWM0                     (0x1   << 6  )
#define IABR1_PWM0_DIS                 (0x0   << 6  ) /* DIS                      */
#define IABR1_PWM0_EN                  (0x1   << 6  ) /* EN                       */

/* IABR1[PWMTRIP] -  */
#define IABR1_PWMTRIP_MSK              (0x1   << 5  )
#define IABR1_PWMTRIP                  (0x1   << 5  )
#define IABR1_PWMTRIP_DIS              (0x0   << 5  ) /* DIS                      */
#define IABR1_PWMTRIP_EN               (0x1   << 5  ) /* EN                       */

/* IABR1[DMASPI0RX] -  */
#define IABR1_DMASPI0RX_MSK            (0x1   << 4  )
#define IABR1_DMASPI0RX                (0x1   << 4  )
#define IABR1_DMASPI0RX_DIS            (0x0   << 4  ) /* DIS                      */
#define IABR1_DMASPI0RX_EN             (0x1   << 4  ) /* EN                       */

/* IABR1[DMASPI0TX] -  */
#define IABR1_DMASPI0TX_MSK            (0x1   << 3  )
#define IABR1_DMASPI0TX                (0x1   << 3  )
#define IABR1_DMASPI0TX_DIS            (0x0   << 3  ) /* DIS                      */
#define IABR1_DMASPI0TX_EN             (0x1   << 3  ) /* EN                       */

/* IABR1[DMAADC] -  */
#define IABR1_DMAADC_MSK               (0x1   << 2  )
#define IABR1_DMAADC                   (0x1   << 2  )
#define IABR1_DMAADC_DIS               (0x0   << 2  ) /* DIS                      */
#define IABR1_DMAADC_EN                (0x1   << 2  ) /* EN                       */

/* Reset Value for IPR0*/
#define IPR0_RVAL                      0x0

/* IPR0[EXTINT2] -  */
#define IPR0_EXTINT2_MSK               (0xFF  << 24 )

/* IPR0[EXTINT1] -  */
#define IPR0_EXTINT1_MSK               (0xFF  << 16 )

/* IPR0[EXTINT0] - Priority of interrupt number 1 */
#define IPR0_EXTINT0_MSK               (0xFF  << 8  )

/* IPR0[T2] - Priority of interrupt number 0 */
#define IPR0_T2_MSK                    (0xFF  << 0  )

/* Reset Value for IPR1*/
#define IPR1_RVAL                      0x0

/* IPR1[EXTINT6] -  */
#define IPR1_EXTINT6_MSK               (0xFF  << 24 )

/* IPR1[EXTINT5] -  */
#define IPR1_EXTINT5_MSK               (0xFF  << 16 )

/* IPR1[EXTINT4] -  */
#define IPR1_EXTINT4_MSK               (0xFF  << 8  )

/* IPR1[EXTINT3] -  */
#define IPR1_EXTINT3_MSK               (0xFF  << 0  )

