contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* Reset Value for PWRKEY*/
#define PWRKEY_RVAL                    0x0

/* PWRKEY[VALUE] -  */
#define PWRKEY_VALUE_MSK               (0xFFFF << 0  )
#define PWRKEY_VALUE_KEY1              (0x4859 << 0  ) /* KEY1                     */
#define PWRKEY_VALUE_KEY2              (0xF27B << 0  ) /* KEY2                     */

/* Reset Value for PSMCON*/
#define PSMCON_RVAL                    0x3

/* PSMCON[PD] - Power Supply Monitor power down bit. */
#define PSMCON_PD_BBA                  (*(volatile unsigned long *) 0x42048104)
#define PSMCON_PD_MSK                  (0x1   << 1  )
#define PSMCON_PD                      (0x1   << 1  )
#define PSMCON_PD_DIS                  (0x0   << 1  ) /* DIS. Power up the PSM.   */
#define PSMCON_PD_EN                   (0x1   << 1  ) /* EN. Power down the PSM.  */

/* Reset Value for SRAMRET*/
#define SRAMRET_RVAL                   0x1

/* SRAMRET[RETAIN] - SRAM retention enable bit */
#define SRAMRET_RETAIN_BBA             (*(volatile unsigned long *) 0x42048F00)
#define SRAMRET_RETAIN_MSK             (0x1   << 0  )
#define SRAMRET_RETAIN                 (0x1   << 0  )
#define SRAMRET_RETAIN_DIS             (0x0   << 0  ) /* DIS. To retain contents of the bottom 8 kB of SRAM only */
#define SRAMRET_RETAIN_EN              (0x1   << 0  ) /* EN. To retain contents of the entire 16 kB of SRAM */

/* Reset Value for SHUTDOWN*/
#define SHUTDOWN_RVAL                  0x0

/* SHUTDOWN[EINT8] - External Interrupt 8 detected during SHUTDOWN mode */
#define SHUTDOWN_EINT8_BBA             (*(volatile unsigned long *) 0x42048F88)
#define SHUTDOWN_EINT8_MSK             (0x1   << 2  )
#define SHUTDOWN_EINT8                 (0x1   << 2  )
#define SHUTDOWN_EINT8_CLR             (0x0   << 2  ) /* CLR. Cleared automatically by hardware when clearing IRQ8 in EICLR. */
#define SHUTDOWN_EINT8_SET             (0x1   << 2  ) /* SET Indicates the interrupt was detected */

/* SHUTDOWN[EINT1] - External Interrupt 1 detected during SHUTDOWN mode */
#define SHUTDOWN_EINT1_BBA             (*(volatile unsigned long *) 0x42048F84)
#define SHUTDOWN_EINT1_MSK             (0x1   << 1  )
#define SHUTDOWN_EINT1                 (0x1   << 1  )
#define SHUTDOWN_EINT1_CLR             (0x0   << 1  ) /* CLR. Cleared automatically by hardware when clearing IRQ1 in EICLR. */
#define SHUTDOWN_EINT1_SET             (0x1   << 1  ) /* SET Indicates the interrupt was detected */

/* SHUTDOWN[EINT0] - External Interrupt 0 detected during SHUTDOWN mode */
#define SHUTDOWN_EINT0_BBA             (*(volatile unsigned long *) 0x42048F80)
#define SHUTDOWN_EINT0_MSK             (0x1   << 0  )
#define SHUTDOWN_EINT0                 (0x1   << 0  )
#define SHUTDOWN_EINT0_CLR             (0x0   << 0  ) /* CLR. Cleared automatically by hardware when clearing IRQ0 in EICLR. */
#define SHUTDOWN_EINT0_SET             (0x1   << 0  ) /* SET Indicates the interrupt was detected */
// ------------------------------------------------------------------------------------------------
// -----                                        PWM                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Pulse Width Modulation (pADI_PWM)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_PWM Structure                     */
  __IO uint16_t  PWMCON0;                   /*!< PWM Control Register                  */
  __I  uint16_t  RESERVED0;
  __IO uint8_t   PWMCON1;                   /*!< Trip Control Register                 */
  __I  uint8_t   RESERVED1[3];
  __IO uint16_t  PWMCLRI;                   /*!< PWM Interrupt Clear                   */
  __I  uint16_t  RESERVED2[3];
  __IO uint16_t  PWM0COM0;                  /*!< Compare Register 0 for Pair 0         */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  PWM0COM1;                  /*!< Compare Register 1 for Pair 0         */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  PWM0COM2;                  /*!< Compare Register 2 for Pair 0         */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  PWM0LEN;                   /*!< Period Value Register for Pair 0      */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  PWM1COM0;                  /*!< Compare Register 0 for Pair 1         */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  PWM1COM1;                  /*!< Compare Register 1 for Pair 1         */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  PWM1COM2;                  /*!< Compare Register 2 for Pair 1         */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  PWM1LEN;                   /*!< Period Value Register for Pair 1      */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  PWM2COM0;                  /*!< Compare Register 0 for Pair 2         */
  __I  uint16_t  RESERVED11;
  __IO uint16_t  PWM2COM1;                  /*!< Compare Register 1 for Pair 2         */
  __I  uint16_t  RESERVED12;
  __IO uint16_t  PWM2COM2;                  /*!< Compare Register 2 for Pair 2         */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  PWM2LEN;                   /*!< Period Value Register for Pair 2      */
  __I  uint16_t  RESERVED14;
  __IO uint16_t  PWM3COM0;                  /*!< Compare Register 0 for Pair 3         */
  __I  uint16_t  RESERVED15;
  __IO uint16_t  PWM3COM1;                  /*!< Compare Register 1 for Pair 3         */
  __I  uint16_t  RESERVED16;
  __IO uint16_t  PWM3COM2;                  /*!< Compare Register 2 for Pair 3         */
  __I  uint16_t  RESERVED17;
  __IO uint16_t  PWM3LEN;                   /*!< Period Value Register for Pair 3      */
} ADI_PWM_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          PWMCON0                                    (*(volatile unsigned short int *) 0x40001000)
#define          PWMCON1                                    (*(volatile unsigned char      *) 0x40001004)
#define          PWMCLRI                                    (*(volatile unsigned short int *) 0x40001008)
#define          PWM0COM0                                   (*(volatile unsigned short int *) 0x40001010)
#define          PWM0COM1                                   (*(volatile unsigned short int *) 0x40001014)
#define          PWM0COM2                                   (*(volatile unsigned short int *) 0x40001018)
#define          PWM0LEN                                    (*(volatile unsigned short int *) 0x4000101C)
#define          PWM1COM0                                   (*(volatile unsigned short int *) 0x40001020)
#define          PWM1COM1                                   (*(volatile unsigned short int *) 0x40001024)
#define          PWM1COM2                                   (*(volatile unsigned short int *) 0x40001028)
#define          PWM1LEN                                    (*(volatile unsigned short int *) 0x4000102C)
#define          PWM2COM0                                   (*(volatile unsigned short int *) 0x40001030)
#define          PWM2COM1                                   (*(volatile unsigned short int *) 0x40001034)
#define          PWM2COM2                                   (*(volatile unsigned short int *) 0x40001038)
#define          PWM2LEN                                    (*(volatile unsigned short int *) 0x4000103C)
#define          PWM3COM0                                   (*(volatile unsigned short int *) 0x40001040)
#define          PWM3COM1                                   (*(volatile unsigned short int *) 0x40001044)
#define          PWM3COM2                                   (*(volatile unsigned short int *) 0x40001048)
#define          PWM3LEN                                    (*(volatile unsigned short int *) 0x4000104C)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for PWMCON0*/
#define PWMCON0_RVAL                   0x12

