contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* PWMCON0[SYNC] - PWM Synchronization. */
#define PWMCON0_SYNC_BBA               (*(volatile unsigned long *) 0x4202003C)
#define PWMCON0_SYNC_MSK               (0x1   << 15 )
#define PWMCON0_SYNC                   (0x1   << 15 )
#define PWMCON0_SYNC_DIS               (0x0   << 15 ) /* DIS. Ignore transitions on the PWMSYNC pin. */
#define PWMCON0_SYNC_EN                (0x1   << 15 ) /* EN. All PWM counters are reset on the next clock edge after the detection of a falling edge on the PWMSYNC pin. */

/* PWMCON0[PWM7INV] - Inversion of PWM output. Available in standard mode only. */
#define PWMCON0_PWM7INV_BBA            (*(volatile unsigned long *) 0x42020038)
#define PWMCON0_PWM7INV_MSK            (0x1   << 14 )
#define PWMCON0_PWM7INV                (0x1   << 14 )
#define PWMCON0_PWM7INV_DIS            (0x0   << 14 ) /* DIS. PWM7 is normal.     */
#define PWMCON0_PWM7INV_EN             (0x1   << 14 ) /* EN. Invert PWM7.         */

/* PWMCON0[PWM5INV] - Inversion of PWM output. Available in standard mode only. */
#define PWMCON0_PWM5INV_BBA            (*(volatile unsigned long *) 0x42020034)
#define PWMCON0_PWM5INV_MSK            (0x1   << 13 )
#define PWMCON0_PWM5INV                (0x1   << 13 )
#define PWMCON0_PWM5INV_DIS            (0x0   << 13 ) /* DIS. PWM5 is normal.     */
#define PWMCON0_PWM5INV_EN             (0x1   << 13 ) /* EN. Invert PWM5.         */

/* PWMCON0[PWM3INV] - Inversion of PWM output. Available in standard mode only. */
#define PWMCON0_PWM3INV_BBA            (*(volatile unsigned long *) 0x42020030)
#define PWMCON0_PWM3INV_MSK            (0x1   << 12 )
#define PWMCON0_PWM3INV                (0x1   << 12 )
#define PWMCON0_PWM3INV_DIS            (0x0   << 12 ) /* DIS. PWM3 is normal.     */
#define PWMCON0_PWM3INV_EN             (0x1   << 12 ) /* EN. Invert PWM3.         */

/* PWMCON0[PWM1INV] - Inversion of PWM output. Available in standard mode only. */
#define PWMCON0_PWM1INV_BBA            (*(volatile unsigned long *) 0x4202002C)
#define PWMCON0_PWM1INV_MSK            (0x1   << 11 )
#define PWMCON0_PWM1INV                (0x1   << 11 )
#define PWMCON0_PWM1INV_DIS            (0x0   << 11 ) /* DIS.  PWM1 is normal.    */
#define PWMCON0_PWM1INV_EN             (0x1   << 11 ) /* EN. Invert PWM1.         */

/* PWMCON0[PWMIEN] - Enable PWM interrupts. */
#define PWMCON0_PWMIEN_BBA             (*(volatile unsigned long *) 0x42020028)
#define PWMCON0_PWMIEN_MSK             (0x1   << 10 )
#define PWMCON0_PWMIEN                 (0x1   << 10 )
#define PWMCON0_PWMIEN_DIS             (0x0   << 10 ) /* DIS. Disable PWM interrupts. */
#define PWMCON0_PWMIEN_EN              (0x1   << 10 ) /* EN.  Enable PWM interrupts. */

/* PWMCON0[ENA] - Enable PWM outputs. Available in H-Bridge mode only. */
#define PWMCON0_ENA_BBA                (*(volatile unsigned long *) 0x42020024)
#define PWMCON0_ENA_MSK                (0x1   << 9  )
#define PWMCON0_ENA                    (0x1   << 9  )
#define PWMCON0_ENA_DIS                (0x0   << 9  ) /* DIS. Disable PWM outputs. */
#define PWMCON0_ENA_EN                 (0x1   << 9  ) /* EN. Enable PWM outputs.  */

/* PWMCON0[PWMCP] - PWM Clock Prescaler. Sets UCLK divider. */
#define PWMCON0_PWMCP_MSK              (0x7   << 6  )
#define PWMCON0_PWMCP_UCLKDIV2         (0x0   << 6  ) /* UCLK/2.                  */
#define PWMCON0_PWMCP_UCLKDIV4         (0x1   << 6  ) /* UCLK/4.                  */
#define PWMCON0_PWMCP_UCLKDIV8         (0x2   << 6  ) /* UCLK/8.                  */
#define PWMCON0_PWMCP_UCLKDIV16        (0x3   << 6  ) /* UCLK/16.                 */
#define PWMCON0_PWMCP_UCLKDIV32        (0x4   << 6  ) /* UCLK/32.                 */
#define PWMCON0_PWMCP_UCLKDIV64        (0x5   << 6  ) /* UCLK/64.                 */
#define PWMCON0_PWMCP_UCLKDIV128       (0x6   << 6  ) /* UCLK/128.                */
#define PWMCON0_PWMCP_UCLKDIV256       (0x7   << 6  ) /* UCLK/256.                */

/* PWMCON0[POINV] - Invert all PWM outputs. Available in H-Bridge mode only. */
#define PWMCON0_POINV_BBA              (*(volatile unsigned long *) 0x42020014)
#define PWMCON0_POINV_MSK              (0x1   << 5  )
#define PWMCON0_POINV                  (0x1   << 5  )
#define PWMCON0_POINV_DIS              (0x0   << 5  ) /* DIS. PWM outputs as normal. */
#define PWMCON0_POINV_EN               (0x1   << 5  ) /* EN. Invert all PWM outputs. */

/* PWMCON0[HOFF] - High Side Off. Available in H-Bridge mode only. */
#define PWMCON0_HOFF_BBA               (*(volatile unsigned long *) 0x42020010)
#define PWMCON0_HOFF_MSK               (0x1   << 4  )
#define PWMCON0_HOFF                   (0x1   << 4  )
#define PWMCON0_HOFF_DIS               (0x0   << 4  ) /* DIS. PWM outputs as normal. */
#define PWMCON0_HOFF_EN                (0x1   << 4  ) /* EN. Force PWM0 and PWM2 outputs high and PWM1 and PWM3 low. */

/* PWMCON0[LCOMP] - Load Compare Registers. */
#define PWMCON0_LCOMP_BBA              (*(volatile unsigned long *) 0x4202000C)
#define PWMCON0_LCOMP_MSK              (0x1   << 3  )
#define PWMCON0_LCOMP                  (0x1   << 3  )
#define PWMCON0_LCOMP_DIS              (0x0   << 3  ) /* DIS. Use the values previously stored in the internal compare registers. */
#define PWMCON0_LCOMP_EN               (0x1   << 3  ) /* EN. Load the internal compare registers with the values in PWMxCOMx on the next transition of the PWM timer from 0x00 to 0x01. */

/* PWMCON0[DIR] - Direction Control. Available in H-Bridge mode only. */
#define PWMCON0_DIR_BBA                (*(volatile unsigned long *) 0x42020008)
#define PWMCON0_DIR_MSK                (0x1   << 2  )
#define PWMCON0_DIR                    (0x1   << 2  )
#define PWMCON0_DIR_DIS                (0x0   << 2  ) /* DIS. Enable PWM2 and PWM3 as the output signals while PWM0 and PWM1 are held low. */
#define PWMCON0_DIR_EN                 (0x1   << 2  ) /* EN. Enable PWM0 and PWM1 as the output signals while PWM2 and PWM3 are held low. */

/* PWMCON0[HMODE] - Enable H-Bridge Mode. */
#define PWMCON0_HMODE_BBA              (*(volatile unsigned long *) 0x42020004)
#define PWMCON0_HMODE_MSK              (0x1   << 1  )
#define PWMCON0_HMODE                  (0x1   << 1  )
#define PWMCON0_HMODE_DIS              (0x0   << 1  ) /* DIS. The PWM operates in standard mode. */
#define PWMCON0_HMODE_EN               (0x1   << 1  ) /* EN. The PWM is configured in H-Bridge mode. */

/* PWMCON0[PWMEN] - Enable all PWM outputs. */
#define PWMCON0_PWMEN_BBA              (*(volatile unsigned long *) 0x42020000)
#define PWMCON0_PWMEN_MSK              (0x1   << 0  )
#define PWMCON0_PWMEN                  (0x1   << 0  )
#define PWMCON0_PWMEN_DIS              (0x0   << 0  ) /* DIS. Disables all PWM outputs. */
#define PWMCON0_PWMEN_EN               (0x1   << 0  ) /* EN. Enables all PWM outputs. */

/* Reset Value for PWMCON1*/
#define PWMCON1_RVAL                   0x0

