contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* PWMCON1[TRIPEN] - Enable PWM trip functionality. */
#define PWMCON1_TRIPEN_BBA             (*(volatile unsigned long *) 0x42020098)
#define PWMCON1_TRIPEN_MSK             (0x1   << 6  )
#define PWMCON1_TRIPEN                 (0x1   << 6  )
#define PWMCON1_TRIPEN_DIS             (0x0   << 6  ) /* DIS. Disable PWM trip functionality. */
#define PWMCON1_TRIPEN_EN              (0x1   << 6  ) /* EN. Enable PWM trip functionality. */

/* Reset Value for PWMCLRI*/
#define PWMCLRI_RVAL                   0x0

/* PWMCLRI[TRIP] - Clear the latched trip interrupt. This bit always reads 0. */
#define PWMCLRI_TRIP_BBA               (*(volatile unsigned long *) 0x42020110)
#define PWMCLRI_TRIP_MSK               (0x1   << 4  )
#define PWMCLRI_TRIP                   (0x1   << 4  )
#define PWMCLRI_TRIP_EN                (0x1   << 4  ) /* EN. Clear the latched PWMTRIP interrupt. */

/* PWMCLRI[IRQPWM3] - Clear the latched PWM3 interrupt. This bit always reads 0. */
#define PWMCLRI_IRQPWM3_BBA            (*(volatile unsigned long *) 0x4202010C)
#define PWMCLRI_IRQPWM3_MSK            (0x1   << 3  )
#define PWMCLRI_IRQPWM3                (0x1   << 3  )
#define PWMCLRI_IRQPWM3_EN             (0x1   << 3  ) /* EN. Clear the latched IRQPWM3 interrupt. */

/* PWMCLRI[IRQPWM2] - Clear the latched PWM2 interrupt. This bit always reads 0. */
#define PWMCLRI_IRQPWM2_BBA            (*(volatile unsigned long *) 0x42020108)
#define PWMCLRI_IRQPWM2_MSK            (0x1   << 2  )
#define PWMCLRI_IRQPWM2                (0x1   << 2  )
#define PWMCLRI_IRQPWM2_EN             (0x1   << 2  ) /* EN. Clear the latched IRQPWM2 interrupt. */

/* PWMCLRI[IRQPWM1] - Clear the latched PWM1 interrupt. This bit always reads 0. */
#define PWMCLRI_IRQPWM1_BBA            (*(volatile unsigned long *) 0x42020104)
#define PWMCLRI_IRQPWM1_MSK            (0x1   << 1  )
#define PWMCLRI_IRQPWM1                (0x1   << 1  )
#define PWMCLRI_IRQPWM1_EN             (0x1   << 1  ) /* EN. Clear the latched IRQPWM1 interrupt. */

/* PWMCLRI[IRQPWM0] - Clear the latched PWM0 interrupt. This bit always reads 0. */
#define PWMCLRI_IRQPWM0_BBA            (*(volatile unsigned long *) 0x42020100)
#define PWMCLRI_IRQPWM0_MSK            (0x1   << 0  )
#define PWMCLRI_IRQPWM0                (0x1   << 0  )
#define PWMCLRI_IRQPWM0_EN             (0x1   << 0  ) /* EN. Clear the latched IRQPWM0 interrupt. */

/* Reset Value for PWM0COM0*/
#define PWM0COM0_RVAL                  0x0

/* PWM0COM0[VALUE] -  */
#define PWM0COM0_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM0COM1*/
#define PWM0COM1_RVAL                  0x0

/* PWM0COM1[VALUE] -  */
#define PWM0COM1_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM0COM2*/
#define PWM0COM2_RVAL                  0x0

/* PWM0COM2[VALUE] -  */
#define PWM0COM2_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM0LEN*/
#define PWM0LEN_RVAL                   0x0

/* PWM0LEN[VALUE] -  */
#define PWM0LEN_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for PWM1COM0*/
#define PWM1COM0_RVAL                  0x0

/* PWM1COM0[VALUE] -  */
#define PWM1COM0_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM1COM1*/
#define PWM1COM1_RVAL                  0x0

/* PWM1COM1[VALUE] -  */
#define PWM1COM1_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM1COM2*/
#define PWM1COM2_RVAL                  0x0

/* PWM1COM2[VALUE] -  */
#define PWM1COM2_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM1LEN*/
#define PWM1LEN_RVAL                   0x0

/* PWM1LEN[VALUE] -  */
#define PWM1LEN_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for PWM2COM0*/
#define PWM2COM0_RVAL                  0x0

/* PWM2COM0[VALUE] -  */
#define PWM2COM0_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM2COM1*/
#define PWM2COM1_RVAL                  0x0

/* PWM2COM1[VALUE] -  */
#define PWM2COM1_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM2COM2*/
#define PWM2COM2_RVAL                  0x0

/* PWM2COM2[VALUE] -  */
#define PWM2COM2_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM2LEN*/
#define PWM2LEN_RVAL                   0x0

/* PWM2LEN[VALUE] -  */
#define PWM2LEN_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for PWM3COM0*/
#define PWM3COM0_RVAL                  0x0

/* PWM3COM0[VALUE] -  */
#define PWM3COM0_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM3COM1*/
#define PWM3COM1_RVAL                  0x0

/* PWM3COM1[VALUE] -  */
#define PWM3COM1_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM3COM2*/
#define PWM3COM2_RVAL                  0x0

/* PWM3COM2[VALUE] -  */
#define PWM3COM2_VALUE_MSK             (0xFFFF << 0  )

/* Reset Value for PWM3LEN*/
#define PWM3LEN_RVAL                   0x0

/* PWM3LEN[VALUE] -  */
#define PWM3LEN_VALUE_MSK              (0xFFFF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        RESET                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Reset (pADI_RESET)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_RESET Structure                   */

  union {
    __IO uint8_t   RSTSTA;                  /*!< Reset Status                          */
    __IO uint8_t   RSTCLR;                  /*!< Reset Status Clear                    */
  } ;
} ADI_RESET_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          RSTSTA                                     (*(volatile unsigned char      *) 0x40002440)
#define          RSTCLR                                     (*(volatile unsigned char      *) 0x40002440)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for RSTSTA*/
#define RSTSTA_RVAL                    0x3

/* RSTSTA[SWRST] - Software reset status bit */
#define RSTSTA_SWRST_BBA               (*(volatile unsigned long *) 0x42048810)
#define RSTSTA_SWRST_MSK               (0x1   << 4  )
#define RSTSTA_SWRST                   (0x1   << 4  )
#define RSTSTA_SWRST_CLR               (0x0   << 4  ) /* CLR. Indicates that no software reset has occurred. */
#define RSTSTA_SWRST_SET               (0x1   << 4  ) /* SET. Indicates that a software reset has occurred. */

/* RSTSTA[WDRST] - Watchdog reset status bit */
#define RSTSTA_WDRST_BBA               (*(volatile unsigned long *) 0x4204880C)
#define RSTSTA_WDRST_MSK               (0x1   << 3  )
#define RSTSTA_WDRST                   (0x1   << 3  )
#define RSTSTA_WDRST_CLR               (0x0   << 3  ) /* CLR. Indicates that no watchdog reset has occurred. */
#define RSTSTA_WDRST_SET               (0x1   << 3  ) /* SET. Indicates that a Watchdog Reset has occurred. */

