contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* RSTSTA[EXTRST] - External reset status bit */
#define RSTSTA_EXTRST_BBA              (*(volatile unsigned long *) 0x42048808)
#define RSTSTA_EXTRST_MSK              (0x1   << 2  )
#define RSTSTA_EXTRST                  (0x1   << 2  )
#define RSTSTA_EXTRST_CLR              (0x0   << 2  ) /* CLR. Indicates that no external reset has occurred. */
#define RSTSTA_EXTRST_SET              (0x1   << 2  ) /* SET. Indicates an external reset has occurred. */

/* RSTSTA[PORHV] - Power-on reset status bit HV */
#define RSTSTA_PORHV_BBA               (*(volatile unsigned long *) 0x42048804)
#define RSTSTA_PORHV_MSK               (0x1   << 1  )
#define RSTSTA_PORHV                   (0x1   << 1  )
#define RSTSTA_PORHV_CLR               (0x0   << 1  ) /* CLR. Indicates a POR or wake up from SHUTDOWN has not occurred. */
#define RSTSTA_PORHV_SET               (0x1   << 1  ) /* SET. This bit indicates that the AVDD supply has dropped below the POR trip point, causing a Power On Reset. It is also set when waking up from SHUTDOWN mode. */

/* RSTSTA[PORLV] - Power-on reset status bit LV */
#define RSTSTA_PORLV_BBA               (*(volatile unsigned long *) 0x42048800)
#define RSTSTA_PORLV_MSK               (0x1   << 0  )
#define RSTSTA_PORLV                   (0x1   << 0  )
#define RSTSTA_PORLV_CLR               (0x0   << 0  ) /* CLR. Indicates a POR or wake up from SHUTDOWN has not occurred. */
#define RSTSTA_PORLV_SET               (0x1   << 0  ) /* SET. This bit indicates that the AVDD supply has dropped below the POR trip point, causing a Power On Reset. It is also set when waking up from SHUTDOWN mode. */

/* Reset Value for RSTCLR*/
#define RSTCLR_RVAL                    0x3

/* RSTCLR[SWRST] - Software reset clear status bit */
#define RSTCLR_SWRST_BBA               (*(volatile unsigned long *) 0x42048810)
#define RSTCLR_SWRST_MSK               (0x1   << 4  )
#define RSTCLR_SWRST                   (0x1   << 4  )
#define RSTCLR_SWRST_DIS               (0x0   << 4  ) /* DIS. Has no effect.      */
#define RSTCLR_SWRST_EN                (0x1   << 4  ) /* EN. Clears the SWRST status bit in RSTSTA. */

/* RSTCLR[WDRST] - Watchdog reset clear status bit */
#define RSTCLR_WDRST_BBA               (*(volatile unsigned long *) 0x4204880C)
#define RSTCLR_WDRST_MSK               (0x1   << 3  )
#define RSTCLR_WDRST                   (0x1   << 3  )
#define RSTCLR_WDRST_DIS               (0x0   << 3  ) /* DIS. Has no effect.      */
#define RSTCLR_WDRST_EN                (0x1   << 3  ) /* EN. Clears the WDRST status bit in RSTSTA. */

/* RSTCLR[EXTRST] - External reset clear status bit */
#define RSTCLR_EXTRST_BBA              (*(volatile unsigned long *) 0x42048808)
#define RSTCLR_EXTRST_MSK              (0x1   << 2  )
#define RSTCLR_EXTRST                  (0x1   << 2  )
#define RSTCLR_EXTRST_DIS              (0x0   << 2  ) /* DIS. Has no effect.      */
#define RSTCLR_EXTRST_EN               (0x1   << 2  ) /* EN. Clears the EXTRST status bit in RSTSTA. */

/* RSTCLR[PORHV] - Power on reset clear status bit */
#define RSTCLR_PORHV_BBA               (*(volatile unsigned long *) 0x42048804)
#define RSTCLR_PORHV_MSK               (0x1   << 1  )
#define RSTCLR_PORHV                   (0x1   << 1  )
#define RSTCLR_PORHV_DIS               (0x0   << 1  ) /* DIS. Has no effect.      */
#define RSTCLR_PORHV_EN                (0x1   << 1  ) /* EN. Clears PORLV status bit in RSTSTA. */

/* RSTCLR[PORLV] - Power-on reset clear status bit LV */
#define RSTCLR_PORLV_BBA               (*(volatile unsigned long *) 0x42048800)
#define RSTCLR_PORLV_MSK               (0x1   << 0  )
#define RSTCLR_PORLV                   (0x1   << 0  )
#define RSTCLR_PORLV_DIS               (0x0   << 0  ) /* DIS. Has no effect.      */
#define RSTCLR_PORLV_EN                (0x1   << 0  ) /* EN. Clears the PORLV status bit in RSTSTA. */
// ------------------------------------------------------------------------------------------------
// -----                                        SPI0                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Serial Peripheral Interface (pADI_SPI0)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_SPI0 Structure                    */
  __IO uint16_t  SPISTA;                    /*!< SPI0 Status Register                  */
  __I  uint16_t  RESERVED0;
  __IO uint8_t   SPIRX;                     /*!< SPI0 Receive Register                 */
  __I  uint8_t   RESERVED1[3];
  __IO uint8_t   SPITX;                     /*!< SPI0 Transmit Register                */
  __I  uint8_t   RESERVED2[3];
  __IO uint16_t  SPIDIV;                    /*!< SPI0 Bit Rate Selection Register      */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  SPICON;                    /*!< SPI0 Configuration Register           */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  SPIDMA;                    /*!< SPI0 DMA Enable Register              */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  SPICNT;                    /*!< SPI0 DMA Master Received Byte Count Register */
} ADI_SPI_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          SPI0STA                                    (*(volatile unsigned short int *) 0x40004000)
#define          SPI0RX                                     (*(volatile unsigned char      *) 0x40004004)
#define          SPI0TX                                     (*(volatile unsigned char      *) 0x40004008)
#define          SPI0DIV                                    (*(volatile unsigned short int *) 0x4000400C)
#define          SPI0CON                                    (*(volatile unsigned short int *) 0x40004010)
#define          SPI0DMA                                    (*(volatile unsigned short int *) 0x40004014)
#define          SPI0CNT                                    (*(volatile unsigned short int *) 0x40004018)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for SPI0STA*/
#define SPI0STA_RVAL                   0x0

/* SPI0STA[CSERR] - CS error status bit. This bit generates an interrupt when detecting an abrupt CS desassertion before the full byte of data is transmitted completely. */
#define SPI0STA_CSERR_BBA              (*(volatile unsigned long *) 0x42080030)
#define SPI0STA_CSERR_MSK              (0x1   << 12 )
#define SPI0STA_CSERR                  (0x1   << 12 )
#define SPI0STA_CSERR_CLR              (0x0   << 12 ) /* CLR: Cleared when no CS error is detected. Cleared to 0 on a read of SPI0STA register. */
#define SPI0STA_CSERR_SET              (0x1   << 12 ) /* SET: Set when the CS line is deasserted abruptly. */

