contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* SPI0CON[TFLUSH] - Tx FIFO flush enable bit. */
#define SPI0CON_TFLUSH_BBA             (*(volatile unsigned long *) 0x42080234)
#define SPI0CON_TFLUSH_MSK             (0x1   << 13 )
#define SPI0CON_TFLUSH                 (0x1   << 13 )
#define SPI0CON_TFLUSH_DIS             (0x0   << 13 ) /* DIS. Disable Tx FIFO flushing. */
#define SPI0CON_TFLUSH_EN              (0x1   << 13 ) /* EN. Flush the Tx FIFO. This bit does not clear itself and should be toggled if a single flush is required. If this bit is left high, then either the last transmitted value or 0x00 is transmitted depending on the ZEN bit (SPI0CON[7]). Any writes to the Tx FIFO are ignored while this bit is set. */

/* SPI0CON[RFLUSH] - Rx FIFO flush enable bit. */
#define SPI0CON_RFLUSH_BBA             (*(volatile unsigned long *) 0x42080230)
#define SPI0CON_RFLUSH_MSK             (0x1   << 12 )
#define SPI0CON_RFLUSH                 (0x1   << 12 )
#define SPI0CON_RFLUSH_DIS             (0x0   << 12 ) /* DIS. Disable Rx FIFO flushing. */
#define SPI0CON_RFLUSH_EN              (0x1   << 12 ) /* EN. If this bit is set, all incoming data is ignored and no interrupts are generated. If set and TIM = 0  (SPI0CON[6]), a read of the Rx FIFO initiates a transfer. */

/* SPI0CON[CON] - Continuous transfer enable bit. */
#define SPI0CON_CON_BBA                (*(volatile unsigned long *) 0x4208022C)
#define SPI0CON_CON_MSK                (0x1   << 11 )
#define SPI0CON_CON                    (0x1   << 11 )
#define SPI0CON_CON_DIS                (0x0   << 11 ) /* DIS. Disable continuous transfer. Each transfer consists of a single 8-bit serial transfer. If valid data exists in the SPIxTX register, then a new transfer is initiated after a stall period of one serial clock cycle. The CS line is deactivated for this one serial clock cycle. */
#define SPI0CON_CON_EN                 (0x1   << 11 ) /* EN. Enable continuous transfer. In master mode, the transfer continues until no valid data is available in the Tx register. CS is asserted and remains asserted for the duration of each 8-bit serial transfer until Tx is empty. */

/* SPI0CON[LOOPBACK] - Loopback enable bit. */
#define SPI0CON_LOOPBACK_BBA           (*(volatile unsigned long *) 0x42080228)
#define SPI0CON_LOOPBACK_MSK           (0x1   << 10 )
#define SPI0CON_LOOPBACK               (0x1   << 10 )
#define SPI0CON_LOOPBACK_DIS           (0x0   << 10 ) /* DIS. Normal mode.        */
#define SPI0CON_LOOPBACK_EN            (0x1   << 10 ) /* EN. Connect MISO to MOSI, thus, data transmitted from Tx register is looped back to the Rx register. SPI must be configured in master mode. */

/* SPI0CON[SOEN] - Slave output enable bit. */
#define SPI0CON_SOEN_BBA               (*(volatile unsigned long *) 0x42080224)
#define SPI0CON_SOEN_MSK               (0x1   << 9  )
#define SPI0CON_SOEN                   (0x1   << 9  )
#define SPI0CON_SOEN_DIS               (0x0   << 9  ) /* DIS. Disable the output driver on the MISO pin. The MISO pin is open-circuit when this bit is clear. */
#define SPI0CON_SOEN_EN                (0x1   << 9  ) /* EN. MISO operates as normal. */

/* SPI0CON[RXOF] - RX overflow overwrite enable bit. */
#define SPI0CON_RXOF_BBA               (*(volatile unsigned long *) 0x42080220)
#define SPI0CON_RXOF_MSK               (0x1   << 8  )
#define SPI0CON_RXOF                   (0x1   << 8  )
#define SPI0CON_RXOF_DIS               (0x0   << 8  ) /* DIS. The new serial byte received is discarded when there is no space left in the FIFO */
#define SPI0CON_RXOF_EN                (0x1   << 8  ) /* EN. The valid data in the Rx register is overwritten by the new serial byte received when there is no space left in the FIFO. */

/* SPI0CON[ZEN] - Transmit underrun: Transmit 0s when the Tx FIFO is empty */
#define SPI0CON_ZEN_BBA                (*(volatile unsigned long *) 0x4208021C)
#define SPI0CON_ZEN_MSK                (0x1   << 7  )
#define SPI0CON_ZEN                    (0x1   << 7  )
#define SPI0CON_ZEN_DIS                (0x0   << 7  ) /* DIS. The last byte from the previous transmission is shifted out when a transfer is initiated with no valid data in the FIFO. */
#define SPI0CON_ZEN_EN                 (0x1   << 7  ) /* EN. Transmit 0x00 when a transfer is initiated with no valid data in the FIFO. */

/* SPI0CON[TIM] - Transfer and interrupt mode bit. */
#define SPI0CON_TIM_BBA                (*(volatile unsigned long *) 0x42080218)
#define SPI0CON_TIM_MSK                (0x1   << 6  )
#define SPI0CON_TIM                    (0x1   << 6  )
#define SPI0CON_TIM_TXWR               (0x1   << 6  ) /* TXWR. Initiate transfer with a write to the SPIxTX register.  Interrupt only occurs when Tx is empty. */
#define SPI0CON_TIM_RXRD               (0x0   << 6  ) /* RXRD. Initiate transfer with a read of the SPIxRX register.  The read must be done while the SPI interface is idle. Interrupt only occurs when Rx is full. */

/* SPI0CON[LSB] - LSB first transfer enable bit. */
#define SPI0CON_LSB_BBA                (*(volatile unsigned long *) 0x42080214)
#define SPI0CON_LSB_MSK                (0x1   << 5  )
#define SPI0CON_LSB                    (0x1   << 5  )
#define SPI0CON_LSB_DIS                (0x0   << 5  ) /* DIS. MSB is transmitted first. */
#define SPI0CON_LSB_EN                 (0x1   << 5  ) /* EN. LSB is transmitted first. */

/* SPI0CON[WOM] - Wired OR enable bit. */
#define SPI0CON_WOM_BBA                (*(volatile unsigned long *) 0x42080210)
#define SPI0CON_WOM_MSK                (0x1   << 4  )
#define SPI0CON_WOM                    (0x1   << 4  )
#define SPI0CON_WOM_DIS                (0x0   << 4  ) /* DIS. Normal driver output operation. */
#define SPI0CON_WOM_EN                 (0x1   << 4  ) /* EN. Enable open circuit data output for multimaster/multislave configuration. */

/* SPI0CON[CPOL] - Serial clock polarity mode bit. */
#define SPI0CON_CPOL_BBA               (*(volatile unsigned long *) 0x4208020C)
#define SPI0CON_CPOL_MSK               (0x1   << 3  )
#define SPI0CON_CPOL                   (0x1   << 3  )
#define SPI0CON_CPOL_LOW               (0x0   << 3  ) /* LOW. Serial clock idles low. */
#define SPI0CON_CPOL_HIGH              (0x1   << 3  ) /* HIGH. Serial clock idles high. */

/* SPI0CON[CPHA] - Serial clock phase mode bit. */
#define SPI0CON_CPHA_BBA               (*(volatile unsigned long *) 0x42080208)
#define SPI0CON_CPHA_MSK               (0x1   << 2  )
#define SPI0CON_CPHA                   (0x1   << 2  )
#define SPI0CON_CPHA_SAMPLELEADING     (0x0   << 2  ) /* SAMPLELEADING. Serial clock pulses at the middle of the first data bit transfer. */
#define SPI0CON_CPHA_SAMPLETRAILING    (0x1   << 2  ) /* SAMPLETRAILING. Serial clock pulses at the start of the first data bit. */

