contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* SPI1STA[IRQ] - Interrupt status bit. */
#define SPI1STA_IRQ_BBA                (*(volatile unsigned long *) 0x42088000)
#define SPI1STA_IRQ_MSK                (0x1   << 0  )
#define SPI1STA_IRQ                    (0x1   << 0  )
#define SPI1STA_IRQ_CLR                (0x0   << 0  ) /* CLR. Cleared to 0 on a read of SPI1STA register. */
#define SPI1STA_IRQ_SET                (0x1   << 0  ) /* SET. Set to 1 when an SPI1 based interrupt occurs. */

/* Reset Value for SPI1RX*/
#define SPI1RX_RVAL                    0x0

/* SPI1RX[VALUE] - 8-bit receive register. A read of the RX FIFO returns the next byte to be read from the FIFO. A read of the FIFO when it is empty returns zero. */
#define SPI1RX_VALUE_MSK               (0xFF  << 0  )

/* Reset Value for SPI1TX*/
#define SPI1TX_RVAL                    0x0

/* SPI1TX[VALUE] - 8-bit transmit register. A write to the Tx FIFO address space writes data to the next available location in the Tx FIFO. If the FIFO is full, the oldest byte of data in the FIFO is overwritten. A read from this address location return zero. */
#define SPI1TX_VALUE_MSK               (0xFF  << 0  )

/* Reset Value for SPI1DIV*/
#define SPI1DIV_RVAL                   0x0

/* SPI1DIV[BCRST] - Configures the behavior of SPI communication after an abrupt deassertion of CS.  This bit should be set in slave and master mode. */
#define SPI1DIV_BCRST_BBA              (*(volatile unsigned long *) 0x4208819C)
#define SPI1DIV_BCRST_MSK              (0x1   << 7  )
#define SPI1DIV_BCRST                  (0x1   << 7  )
#define SPI1DIV_BCRST_DIS              (0x0   << 7  ) /* DIS. Resumes communication from where it stopped when the CS is deasserted. The rest of the bits are then received/ transmitted when CS returns low. User code should ignore the CSERR interrupt. */
#define SPI1DIV_BCRST_EN               (0x1   << 7  ) /* EN. Enabled for a clean restart of SPI transfer after a CSERR condition. User code must also clear the SPI enable bit in SPI1CON during the CSERR interrupt. */

/* SPI1DIV[DIV] - Factor used to divide UCLK in the generation of the master mode serial clock. */
#define SPI1DIV_DIV_MSK                (0x3F  << 0  )

/* Reset Value for SPI1CON*/
#define SPI1CON_RVAL                   0x0

/* SPI1CON[MOD] - IRQ mode bits. When TIM is set these bits configure when the Tx/Rx interrupts occur in a transfer. For a DMA Rx transfer, these bits should be 00. */
#define SPI1CON_MOD_MSK                (0x3   << 14 )
#define SPI1CON_MOD_TX1RX1             (0x0   << 14 ) /* TX1RX1.  Tx/Rx interrupt occurs when 1 byte has been transmitted/received from/into the FIFO. */
#define SPI1CON_MOD_TX2RX2             (0x1   << 14 ) /* TX2RX2.  Tx/Rx interrupt occurs when 2 bytes have been transmitted/received from/into the FIFO. */
#define SPI1CON_MOD_TX3RX3             (0x2   << 14 ) /* TX3RX3.  Tx/Rx interrupt occurs when 3 bytes have been transmitted/received from/into the FIFO. */
#define SPI1CON_MOD_TX4RX4             (0x3   << 14 ) /* TX4RX4.  Tx/Rx interrupt occurs when 4 bytes have been transmitted/received from/into the FIFO. */

/* SPI1CON[TFLUSH] - Tx FIFO flush enable bit. */
#define SPI1CON_TFLUSH_BBA             (*(volatile unsigned long *) 0x42088234)
#define SPI1CON_TFLUSH_MSK             (0x1   << 13 )
#define SPI1CON_TFLUSH                 (0x1   << 13 )
#define SPI1CON_TFLUSH_DIS             (0x0   << 13 ) /* DIS. Disable Tx FIFO flushing. */
#define SPI1CON_TFLUSH_EN              (0x1   << 13 ) /* EN. Flush the Tx FIFO. This bit does not clear itself and should be toggled if a single flush is required. If this bit is left high, then either the last transmitted value or 0x00 is transmitted depending on the ZEN bit (SPI1CON[7]). Any writes to the Tx FIFO are ignored while this bit is set. */

/* SPI1CON[RFLUSH] - Rx FIFO flush enable bit. */
#define SPI1CON_RFLUSH_BBA             (*(volatile unsigned long *) 0x42088230)
#define SPI1CON_RFLUSH_MSK             (0x1   << 12 )
#define SPI1CON_RFLUSH                 (0x1   << 12 )
#define SPI1CON_RFLUSH_DIS             (0x0   << 12 ) /* DIS. Disable Rx FIFO flushing. */
#define SPI1CON_RFLUSH_EN              (0x1   << 12 ) /* EN.  If this bit is set, all incoming data is ignored and no interrupts are generated. If set and TIM = 0  (SPI1CON[6]), a read of the Rx FIFO initiates a transfer. */

/* SPI1CON[CON] - Continuous transfer enable bit. */
#define SPI1CON_CON_BBA                (*(volatile unsigned long *) 0x4208822C)
#define SPI1CON_CON_MSK                (0x1   << 11 )
#define SPI1CON_CON                    (0x1   << 11 )
#define SPI1CON_CON_DIS                (0x0   << 11 ) /* DIS. Disable continuous transfer. Each transfer consists of a single 8-bit serial transfer. If valid data exists in the SPIxTX register, then a new transfer is initiated after a stall period of one serial clock cycle. The CS line is deactivated for this one serial clock cycle. */
#define SPI1CON_CON_EN                 (0x1   << 11 ) /* EN. Enable continuous transfer. In master mode, the transfer continues until no valid data is available in the Tx register. CS is asserted and remains asserted for the duration of each 8-bit serial transfer until Tx is empty. */

/* SPI1CON[LOOPBACK] - Loopback enable bit. */
#define SPI1CON_LOOPBACK_BBA           (*(volatile unsigned long *) 0x42088228)
#define SPI1CON_LOOPBACK_MSK           (0x1   << 10 )
#define SPI1CON_LOOPBACK               (0x1   << 10 )
#define SPI1CON_LOOPBACK_DIS           (0x0   << 10 ) /* DIS. Normal mode.        */
#define SPI1CON_LOOPBACK_EN            (0x1   << 10 ) /* EN. Connect MISO to MOSI, thus, data transmitted from Tx register is looped back to the Rx register. SPI must be configured in master mode. */

/* SPI1CON[SOEN] - Slave output enable bit. */
#define SPI1CON_SOEN_BBA               (*(volatile unsigned long *) 0x42088224)
#define SPI1CON_SOEN_MSK               (0x1   << 9  )
#define SPI1CON_SOEN                   (0x1   << 9  )
#define SPI1CON_SOEN_DIS               (0x0   << 9  ) /* DIS.  Disable the output driver on the MISO pin. The MISO pin is open-circuit when this bit is clear. */
#define SPI1CON_SOEN_EN                (0x1   << 9  ) /* EN. MISO operates as normal. */

/* SPI1CON[RXOF] - RX overflow overwrite enable bit. */
#define SPI1CON_RXOF_BBA               (*(volatile unsigned long *) 0x42088220)
#define SPI1CON_RXOF_MSK               (0x1   << 8  )
#define SPI1CON_RXOF                   (0x1   << 8  )
#define SPI1CON_RXOF_DIS               (0x0   << 8  ) /* DIS. The new serial byte received is discarded when there is no space left in the FIFO */
#define SPI1CON_RXOF_EN                (0x1   << 8  ) /* EN. The valid data in the Rx register is overwritten by the new serial byte received when there is no space left in the FIFO. */

/* SPI1CON[ZEN] - TX underrun: Transmit 0s when Tx FIFO is empty. */
#define SPI1CON_ZEN_BBA                (*(volatile unsigned long *) 0x4208821C)
#define SPI1CON_ZEN_MSK                (0x1   << 7  )
#define SPI1CON_ZEN                    (0x1   << 7  )
#define SPI1CON_ZEN_DIS                (0x0   << 7  ) /* DIS. The last byte from the previous transmission is shifted out when a transfer is initiated with no valid data in the FIFO. */
#define SPI1CON_ZEN_EN                 (0x1   << 7  ) /* EN. Transmit 0x00 when a transfer is initiated with no valid data in the FIFO. */

/* SPI1CON[TIM] - Transfer and interrupt mode bit. */
#define SPI1CON_TIM_BBA                (*(volatile unsigned long *) 0x42088218)
#define SPI1CON_TIM_MSK                (0x1   << 6  )
#define SPI1CON_TIM                    (0x1   << 6  )
#define SPI1CON_TIM_TXWR               (0x1   << 6  ) /* TXWR. Initiate transfer with a write to the SPIxTX register.  Interrupt only occurs when Tx is empty. */
#define SPI1CON_TIM_RXRD               (0x0   << 6  ) /* RXRD. Initiate transfer with a read of the SPIxRX register.  The read must be done while the SPI interface is idle. Interrupt only occurs when Rx is full. */

/* SPI1CON[LSB] - LSB first transfer enable bit. */
#define SPI1CON_LSB_BBA                (*(volatile unsigned long *) 0x42088214)
#define SPI1CON_LSB_MSK                (0x1   << 5  )
#define SPI1CON_LSB                    (0x1   << 5  )
#define SPI1CON_LSB_DIS                (0x0   << 5  ) /* DIS. MSB is transmitted first. */
#define SPI1CON_LSB_EN                 (0x1   << 5  ) /* EN. LSB is transmitted first. */

/* SPI1CON[WOM] - Wired OR enable bit. */
#define SPI1CON_WOM_BBA                (*(volatile unsigned long *) 0x42088210)
#define SPI1CON_WOM_MSK                (0x1   << 4  )
#define SPI1CON_WOM                    (0x1   << 4  )
#define SPI1CON_WOM_DIS                (0x0   << 4  ) /* DIS. Normal driver output operation. */
#define SPI1CON_WOM_EN                 (0x1   << 4  ) /* EN. Enable open circuit data output for multimaster/multislave configuration. */

