contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* T0CON[EVENT] - Event select bits. Settings not described are reserved and should not be used. */
#define T0CON_EVENT_MSK                (0xF   << 8  )
#define T0CON_EVENT_T2                 (0x0   << 8  ) /* T2. Wakeup Timer.        */
#define T0CON_EVENT_EXT0               (0x1   << 8  ) /* EXT0. External interrupt 0. */
#define T0CON_EVENT_EXT1               (0x2   << 8  ) /* EXT1. External interrupt 1. */
#define T0CON_EVENT_EXT2               (0x3   << 8  ) /* EXT2. External interrupt 2. */
#define T0CON_EVENT_EXT3               (0x4   << 8  ) /* EXT3. External interrupt 3. */
#define T0CON_EVENT_EXT4               (0x5   << 8  ) /* EXT4. External interrupt 4. */
#define T0CON_EVENT_EXT5               (0x6   << 8  ) /* EXT5. External interrupt 5. */
#define T0CON_EVENT_EXT6               (0x7   << 8  ) /* EXT6. External interrupt 6. */
#define T0CON_EVENT_EXT7               (0x8   << 8  ) /* EXT7. External interrupt 7. */
#define T0CON_EVENT_EXT8               (0x9   << 8  ) /* EXT8. External interrupt 8. */
#define T0CON_EVENT_T3                 (0xA   << 8  ) /* T3. Watchdog timer.      */
#define T0CON_EVENT_T1                 (0xC   << 8  ) /* T1. Timer 1.             */
#define T0CON_EVENT_ADC                (0xD   << 8  ) /* ADC. Analog to Digital Converter. */
#define T0CON_EVENT_FEE                (0xE   << 8  ) /* FEE. Flash Controller.   */
#define T0CON_EVENT_COM                (0xF   << 8  ) /* COM. UART Peripheral.    */

/* T0CON[RLD] - Reload control bit for periodic mode. */
#define T0CON_RLD_BBA                  (*(volatile unsigned long *) 0x4200011C)
#define T0CON_RLD_MSK                  (0x1   << 7  )
#define T0CON_RLD                      (0x1   << 7  )
#define T0CON_RLD_DIS                  (0x0   << 7  ) /* DIS. Reload on a time out. */
#define T0CON_RLD_EN                   (0x1   << 7  ) /* EN. Reload the counter on a write to T0CLRI. */

/* T0CON[CLK] - Clock select. */
#define T0CON_CLK_MSK                  (0x3   << 5  )
#define T0CON_CLK_UCLK                 (0x0   << 5  ) /* UCLK. Undivided system clock. */
#define T0CON_CLK_PCLK                 (0x1   << 5  ) /* PCLK. Peripheral clock.  */
#define T0CON_CLK_LFOSC                (0x2   << 5  ) /* LFOSC. 32 kHz internal oscillator. */
#define T0CON_CLK_LFXTAL               (0x3   << 5  ) /* LFXTAL. 32 kHz external crystal. */

/* T0CON[ENABLE] - Timer enable bit. */
#define T0CON_ENABLE_BBA               (*(volatile unsigned long *) 0x42000110)
#define T0CON_ENABLE_MSK               (0x1   << 4  )
#define T0CON_ENABLE                   (0x1   << 4  )
#define T0CON_ENABLE_DIS               (0x0   << 4  ) /* DIS. Disable the timer. Clearing this bit resets the timer, including the T0VAL register. */
#define T0CON_ENABLE_EN                (0x1   << 4  ) /* EN. Enable the timer.  The timer starts counting from its initial value, 0 if count-up mode or 0xFFFF if count-down mode. */

/* T0CON[MOD] - Timer mode. */
#define T0CON_MOD_BBA                  (*(volatile unsigned long *) 0x4200010C)
#define T0CON_MOD_MSK                  (0x1   << 3  )
#define T0CON_MOD                      (0x1   << 3  )
#define T0CON_MOD_FREERUN              (0x0   << 3  ) /* FREERUN. Operate in free running mode. */
#define T0CON_MOD_PERIODIC             (0x1   << 3  ) /* PERIODIC. Operate in periodic mode. */

/* T0CON[UP] - Count down/up. */
#define T0CON_UP_BBA                   (*(volatile unsigned long *) 0x42000108)
#define T0CON_UP_MSK                   (0x1   << 2  )
#define T0CON_UP                       (0x1   << 2  )
#define T0CON_UP_DIS                   (0x0   << 2  ) /* DIS. Timer to count down. */
#define T0CON_UP_EN                    (0x1   << 2  ) /* EN. Timer to count up.   */

/* T0CON[PRE] - Prescaler. */
#define T0CON_PRE_MSK                  (0x3   << 0  )
#define T0CON_PRE_DIV1                 (0x0   << 0  ) /* DIV1. Source clock/1.If the selected clock source is UCLK or PCLK this setting results in a prescaler of 4. */
#define T0CON_PRE_DIV16                (0x1   << 0  ) /* DIV16. Source clock/16.  */
#define T0CON_PRE_DIV256               (0x2   << 0  ) /* DIV256. Source clock/256. */
#define T0CON_PRE_DIV32768             (0x3   << 0  ) /* DIV32768. Source clock/32768. */

/* Reset Value for T0CLRI*/
#define T0CLRI_RVAL                    0x0

/* T0CLRI[CAP] - Clear captured event interrupt. */
#define T0CLRI_CAP_BBA                 (*(volatile unsigned long *) 0x42000184)
#define T0CLRI_CAP_MSK                 (0x1   << 1  )
#define T0CLRI_CAP                     (0x1   << 1  )
#define T0CLRI_CAP_CLR                 (0x1   << 1  ) /* CLR. Clear a captured event interrupt. This bit always reads 0. */

/* T0CLRI[TMOUT] - Clear timeout interrupt. */
#define T0CLRI_TMOUT_BBA               (*(volatile unsigned long *) 0x42000180)
#define T0CLRI_TMOUT_MSK               (0x1   << 0  )
#define T0CLRI_TMOUT                   (0x1   << 0  )
#define T0CLRI_TMOUT_CLR               (0x1   << 0  ) /* CLR. Clear a timeout interrupt. This bit always reads 0. */

/* Reset Value for T0CAP*/
#define T0CAP_RVAL                     0x0

/* T0CAP[VALUE] - Capture value. */
#define T0CAP_VALUE_MSK                (0xFFFF << 0  )

/* Reset Value for T0STA*/
#define T0STA_RVAL                     0x0

/* T0STA[CLRI] - T0CLRI write sync in progress.. */
#define T0STA_CLRI_BBA                 (*(volatile unsigned long *) 0x4200039C)
#define T0STA_CLRI_MSK                 (0x1   << 7  )
#define T0STA_CLRI                     (0x1   << 7  )
#define T0STA_CLRI_CLR                 (0x0   << 7  ) /* CLR. Cleared when the interrupt is cleared in the timer clock domain. */
#define T0STA_CLRI_SET                 (0x1   << 7  ) /* SET. Set automatically when the T0CLRI value is being updated in the timer clock domain, indicating that the timers configuration is not yet valid. */

/* T0STA[CON] - T0CON write sync in progress. */
#define T0STA_CON_BBA                  (*(volatile unsigned long *) 0x42000398)
#define T0STA_CON_MSK                  (0x1   << 6  )
#define T0STA_CON                      (0x1   << 6  )
#define T0STA_CON_CLR                  (0x0   << 6  ) /* CLR. Timer ready to receive commands to T0CON. The previous change of T0CON has been synchronized in the timer clock domain. */
#define T0STA_CON_SET                  (0x1   << 6  ) /* SET. Timer not ready to receive commands to T0CON. Previous change of the T0CON value has not been synchronized in the timer clock domain. */

