contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* T0STA[CAP] - Capture event pending. */
#define T0STA_CAP_BBA                  (*(volatile unsigned long *) 0x42000384)
#define T0STA_CAP_MSK                  (0x1   << 1  )
#define T0STA_CAP                      (0x1   << 1  )
#define T0STA_CAP_CLR                  (0x0   << 1  ) /* CLR. No capture event is pending. */
#define T0STA_CAP_SET                  (0x1   << 1  ) /* SET. Capture event is pending. */

/* T0STA[TMOUT] - Time out event occurred. */
#define T0STA_TMOUT_BBA                (*(volatile unsigned long *) 0x42000380)
#define T0STA_TMOUT_MSK                (0x1   << 0  )
#define T0STA_TMOUT                    (0x1   << 0  )
#define T0STA_TMOUT_CLR                (0x0   << 0  ) /* CLR. No timeout event has occurred. */
#define T0STA_TMOUT_SET                (0x1   << 0  ) /* SET. Timeout event has occurred.  For count-up mode, this is when the counter reaches full scale. For count-down mode, this is when the counter reaches 0. */
#if (__NO_MMR_STRUCTS__==1)

#define          T1LD                                       (*(volatile unsigned short int *) 0x40000400)
#define          T1VAL                                      (*(volatile unsigned short int *) 0x40000404)
#define          T1CON                                      (*(volatile unsigned short int *) 0x40000408)
#define          T1CLRI                                     (*(volatile unsigned short int *) 0x4000040C)
#define          T1CAP                                      (*(volatile unsigned short int *) 0x40000410)
#define          T1STA                                      (*(volatile unsigned short int *) 0x4000041C)
#endif // (__NO_MMR_STRUCTS__==1)

/* Reset Value for T1LD*/
#define T1LD_RVAL                      0x0

/* T1LD[VALUE] - Load value. */
#define T1LD_VALUE_MSK                 (0xFFFF << 0  )

/* Reset Value for T1VAL*/
#define T1VAL_RVAL                     0x0

/* T1VAL[VALUE] - Current counter value. */
#define T1VAL_VALUE_MSK                (0xFFFF << 0  )

/* Reset Value for T1CON*/
#define T1CON_RVAL                     0xA

/* T1CON[EVENTEN] - Enable event bit. */
#define T1CON_EVENTEN_BBA              (*(volatile unsigned long *) 0x42008130)
#define T1CON_EVENTEN_MSK              (0x1   << 12 )
#define T1CON_EVENTEN                  (0x1   << 12 )
#define T1CON_EVENTEN_DIS              (0x0   << 12 ) /* DIS. Cleared by user.    */
#define T1CON_EVENTEN_EN               (0x1   << 12 ) /* EN. Enable time capture of an event. */

/* T1CON[EVENT] - Event select bits. Settings not described are reserved and should not be used. */
#define T1CON_EVENT_MSK                (0xF   << 8  )
#define T1CON_EVENT_T0                 (0x0   << 8  ) /* T0. Timer 0.             */
#define T1CON_EVENT_SPI0               (0x1   << 8  ) /* SPI0. SPI0 Peripheral.   */
#define T1CON_EVENT_SPI1               (0x2   << 8  ) /* SPI1. SPI1 Peripheral.   */
#define T1CON_EVENT_I2CS               (0x3   << 8  ) /* I2CS. I2C slave peripheral. */
#define T1CON_EVENT_I2CM               (0x4   << 8  ) /* I2CM. I2C master peripheral. */
#define T1CON_EVENT_DMAERR             (0x6   << 8  ) /* DMAERR. DMA error        */
#define T1CON_EVENT_DMADONE            (0x7   << 8  ) /* DMADONE. Completion of transfer on any of the DMA channel. */
#define T1CON_EVENT_EXT1               (0x8   << 8  ) /* EXT1. External interrupt 1. */
#define T1CON_EVENT_EXT2               (0x9   << 8  ) /* EXT2. External interrupt 2. */
#define T1CON_EVENT_EXT3               (0xA   << 8  ) /* EXT3. External interrupt 3. */
#define T1CON_EVENT_PWMTRIP            (0xB   << 8  ) /* PWMTRIP.                 */
#define T1CON_EVENT_PWM0               (0xC   << 8  ) /* PWM0. PWM pair 0.        */
#define T1CON_EVENT_PWM1               (0xD   << 8  ) /* PWM1. PWM pair 1.        */
#define T1CON_EVENT_PWM2               (0xE   << 8  ) /* PWM2. PWM pair 2.        */
#define T1CON_EVENT_PWM3               (0xF   << 8  ) /* PWM3. PWM pair 3.        */

/* T1CON[RLD] - Reload control bit for periodic mode. */
#define T1CON_RLD_BBA                  (*(volatile unsigned long *) 0x4200811C)
#define T1CON_RLD_MSK                  (0x1   << 7  )
#define T1CON_RLD                      (0x1   << 7  )
#define T1CON_RLD_DIS                  (0x0   << 7  ) /* DIS. Reload on a time out. */
#define T1CON_RLD_EN                   (0x1   << 7  ) /* EN. Reload the counter on a write to T1CLRI. */

/* T1CON[CLK] - Clock select. */
#define T1CON_CLK_MSK                  (0x3   << 5  )
#define T1CON_CLK_UCLK                 (0x0   << 5  ) /* UCLK. Undivided system clock. */
#define T1CON_CLK_PCLK                 (0x1   << 5  ) /* PCLK. Peripheral clock.  */
#define T1CON_CLK_LFOSC                (0x2   << 5  ) /* LFOSC. 32 kHz internal oscillator. */
#define T1CON_CLK_LFXTAL               (0x3   << 5  ) /* LFXTAL. 32 kHz external crystal. */

/* T1CON[ENABLE] - Timer enable bit. */
#define T1CON_ENABLE_BBA               (*(volatile unsigned long *) 0x42008110)
#define T1CON_ENABLE_MSK               (0x1   << 4  )
#define T1CON_ENABLE                   (0x1   << 4  )
#define T1CON_ENABLE_DIS               (0x0   << 4  ) /* DIS. Disable the timer. Clearing this bit resets the timer, including the T1VAL register. */
#define T1CON_ENABLE_EN                (0x1   << 4  ) /* EN. Enable the timer.  The timer starts counting from its initial value, 0 if count-up mode or 0xFFFF if count-down mode. */

/* T1CON[MOD] - Timer mode. */
#define T1CON_MOD_BBA                  (*(volatile unsigned long *) 0x4200810C)
#define T1CON_MOD_MSK                  (0x1   << 3  )
#define T1CON_MOD                      (0x1   << 3  )
#define T1CON_MOD_FREERUN              (0x0   << 3  ) /* FREERUN. Operate in free running mode. */
#define T1CON_MOD_PERIODIC             (0x1   << 3  ) /* PERIODIC. Operate in periodic mode. */

/* T1CON[UP] - Count down/up. */
#define T1CON_UP_BBA                   (*(volatile unsigned long *) 0x42008108)
#define T1CON_UP_MSK                   (0x1   << 2  )
#define T1CON_UP                       (0x1   << 2  )
#define T1CON_UP_DIS                   (0x0   << 2  ) /* DIS. Timer to count down. */
#define T1CON_UP_EN                    (0x1   << 2  ) /* EN. Timer to count up.   */

/* T1CON[PRE] - Prescaler. */
#define T1CON_PRE_MSK                  (0x3   << 0  )
#define T1CON_PRE_DIV1                 (0x0   << 0  ) /* DIV1. Source clock/1.If the selected clock source is UCLK or PCLK this setting results in a prescaler of 4. */
#define T1CON_PRE_DIV16                (0x1   << 0  ) /* DIV16. Source clock/16.  */
#define T1CON_PRE_DIV256               (0x2   << 0  ) /* DIV256. Source clock/256. */
#define T1CON_PRE_DIV32768             (0x3   << 0  ) /* DIV32768. Source clock/32768. */

/* Reset Value for T1CLRI*/
#define T1CLRI_RVAL                    0x0

/* T1CLRI[CAP] - Clear captured event interrupt. */
#define T1CLRI_CAP_BBA                 (*(volatile unsigned long *) 0x42008184)
#define T1CLRI_CAP_MSK                 (0x1   << 1  )
#define T1CLRI_CAP                     (0x1   << 1  )
#define T1CLRI_CAP_CLR                 (0x1   << 1  ) /* CLR. Clear a captured event interrupt. This bit always reads 0. */

/* T1CLRI[TMOUT] - Clear timeout interrupt. */
#define T1CLRI_TMOUT_BBA               (*(volatile unsigned long *) 0x42008180)
#define T1CLRI_TMOUT_MSK               (0x1   << 0  )
#define T1CLRI_TMOUT                   (0x1   << 0  )
#define T1CLRI_TMOUT_CLR               (0x1   << 0  ) /* CLR. Clear a timeout interrupt. This bit always reads 0. */

/* Reset Value for T1CAP*/
#define T1CAP_RVAL                     0x0

