contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* T2VAL0[VALUE] - Current Wake-Up timer value (bits 15 to 0). */
#define T2VAL0_VALUE_MSK               (0xFFFF << 0  )

/* Reset Value for T2VAL1*/
#define T2VAL1_RVAL                    0x0

/* T2VAL1[VALUE] - Current Wake-Up timer value (bits 31 to 16). */
#define T2VAL1_VALUE_MSK               (0xFFFF << 0  )

/* Reset Value for T2CON*/
#define T2CON_RVAL                     0x40

/* T2CON[STOPINC] - Allows the user to update the interval register safely. */
#define T2CON_STOPINC_BBA              (*(volatile unsigned long *) 0x4204A12C)
#define T2CON_STOPINC_MSK              (0x1   << 11 )
#define T2CON_STOPINC                  (0x1   << 11 )
#define T2CON_STOPINC_DIS              (0x0   << 11 ) /* DIS. Allows the wake-up field A to be updated by hardware. */
#define T2CON_STOPINC_EN               (0x1   << 11 ) /* EN. Prevents wake-up field A being automatically updated by hardware.This allows user software to update the T2INC register value. */

/* T2CON[CLK] - Clock select. */
#define T2CON_CLK_MSK                  (0x3   << 9  )
#define T2CON_CLK_PCLK                 (0x0   << 9  ) /* PCLK. Peripheral clock.  */
#define T2CON_CLK_LFXTAL               (0x1   << 9  ) /* LFXTAL. 32 kHz external crystal. */
#define T2CON_CLK_LFOSC                (0x2   << 9  ) /* LFOSC. 32 kHz internal oscillator. */
#define T2CON_CLK_EXTCLK               (0x3   << 9  ) /* EXTCLK. External clock applied on P0.5. */

/* T2CON[WUEN] - Wake-up enable bits for time field values. */
#define T2CON_WUEN_BBA                 (*(volatile unsigned long *) 0x4204A120)
#define T2CON_WUEN_MSK                 (0x1   << 8  )
#define T2CON_WUEN                     (0x1   << 8  )
#define T2CON_WUEN_DIS                 (0x0   << 8  ) /* DIS. Disable asynchronous Wake-Up timer. Interrupt conditions will not wake-up the part from sleep mode. */
#define T2CON_WUEN_EN                  (0x1   << 8  ) /* EN. Enable asynchronous Wake-Up timer even when the core clock is off. Once the timer value equals any of the interrupt enabled compare field, a wake-up signal is generated. */

/* T2CON[ENABLE] - Timer enable bit. */
#define T2CON_ENABLE_BBA               (*(volatile unsigned long *) 0x4204A11C)
#define T2CON_ENABLE_MSK               (0x1   << 7  )
#define T2CON_ENABLE                   (0x1   << 7  )
#define T2CON_ENABLE_DIS               (0x0   << 7  ) /* DIS. Disable the timer.  */
#define T2CON_ENABLE_EN                (0x1   << 7  ) /* EN. Enable the timer. When enabled wait for T2STA[8] to clear before continuing. */

/* T2CON[MOD] - Timer free run enable. */
#define T2CON_MOD_BBA                  (*(volatile unsigned long *) 0x4204A118)
#define T2CON_MOD_MSK                  (0x1   << 6  )
#define T2CON_MOD                      (0x1   << 6  )
#define T2CON_MOD_PERIODIC             (0x0   << 6  ) /* PERIODIC. Operate in periodic mode.  Counts up to the value in T2WUFD */
#define T2CON_MOD_FREERUN              (0x1   << 6  ) /* FREERUN. Operate in free running mode (default). Counts from 0 to FFFF FFFF and starts again at 0. */

/* T2CON[FREEZE] - Freeze enable bit. */
#define T2CON_FREEZE_BBA               (*(volatile unsigned long *) 0x4204A10C)
#define T2CON_FREEZE_MSK               (0x1   << 3  )
#define T2CON_FREEZE                   (0x1   << 3  )
#define T2CON_FREEZE_DIS               (0x0   << 3  ) /* DIS. Disable this feature. */
#define T2CON_FREEZE_EN                (0x1   << 3  ) /* EN. Enable the freeze of the high 16 bits after the lower bits have been read from T2VAL0. This ensures that the software reads an atomic shot of the timer. The entire T2VAL register unfreezes after the high bits (T2VAL1) have been read. */

/* T2CON[PRE] - Prescaler. */
#define T2CON_PRE_MSK                  (0x3   << 0  )
#define T2CON_PRE_DIV1                 (0x0   << 0  ) /* DIV1. Source clock/1. If the selected clock source is PCLK this setting results in a prescaler of 4. */
#define T2CON_PRE_DIV16                (0x1   << 0  ) /* DIV16. Source clock/16.  */
#define T2CON_PRE_DIV256               (0x2   << 0  ) /* DIV256. Source clock/256. */
#define T2CON_PRE_DIV32768             (0x3   << 0  ) /* DIV32768. Source clock/32768. */

/* Reset Value for T2INC*/
#define T2INC_RVAL                     0xC8

/* T2INC[VALUE] - Wake-up interval */
#define T2INC_VALUE_MSK                (0xFFF << 0  )

/* Reset Value for T2WUFB0*/
#define T2WUFB0_RVAL                   0x1FFF

/* T2WUFB0[VALUE] - Lower 16 bits of Wake-Up Field B */
#define T2WUFB0_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for T2WUFB1*/
#define T2WUFB1_RVAL                   0x0

/* T2WUFB1[VALUE] - Upper 16 bits of Wake-Up Field B */
#define T2WUFB1_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for T2WUFC0*/
#define T2WUFC0_RVAL                   0x2FFF

/* T2WUFC0[VALUE] - Lower 16 bits of Wake-Up Field C */
#define T2WUFC0_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for T2WUFC1*/
#define T2WUFC1_RVAL                   0x0

/* T2WUFC1[VALUE] - Upper 16 bits of Wake-Up Field C */
#define T2WUFC1_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for T2WUFD0*/
#define T2WUFD0_RVAL                   0x3FFF

/* T2WUFD0[VALUE] - Lower 16 bits of Wake-Up Field D */
#define T2WUFD0_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for T2WUFD1*/
#define T2WUFD1_RVAL                   0x0

/* T2WUFD1[VALUE] - Upper 16 bits of Wake-Up Field D */
#define T2WUFD1_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for T2IEN*/
#define T2IEN_RVAL                     0x0

/* T2IEN[ROLL] - Interrupt enable bit when the counter rolls over. Only occurs in free running mode. */
#define T2IEN_ROLL_BBA                 (*(volatile unsigned long *) 0x4204A510)
#define T2IEN_ROLL_MSK                 (0x1   << 4  )
#define T2IEN_ROLL                     (0x1   << 4  )
#define T2IEN_ROLL_DIS                 (0x0   << 4  ) /* DIS. Disable the roll over interrupt. */
#define T2IEN_ROLL_EN                  (0x1   << 4  ) /* EN. Generate an interrupt when Timer2 rolls over. */

/* T2IEN[WUFD] - T2WUFD interrupt enable */
#define T2IEN_WUFD_BBA                 (*(volatile unsigned long *) 0x4204A50C)
#define T2IEN_WUFD_MSK                 (0x1   << 3  )
#define T2IEN_WUFD                     (0x1   << 3  )
#define T2IEN_WUFD_DIS                 (0x0   << 3  ) /* DIS. Disable T2WUFD interrupt. */
#define T2IEN_WUFD_EN                  (0x1   << 3  ) /* EN. Generate an interrupt when T2VAL reaches T2WUFD. */

