contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* T2IEN[WUFC] - T2WUFC interrupt enable */
#define T2IEN_WUFC_BBA                 (*(volatile unsigned long *) 0x4204A508)
#define T2IEN_WUFC_MSK                 (0x1   << 2  )
#define T2IEN_WUFC                     (0x1   << 2  )
#define T2IEN_WUFC_DIS                 (0x0   << 2  ) /* DIS. Disable T2WUFC interrupt. */
#define T2IEN_WUFC_EN                  (0x1   << 2  ) /* EN. Generate an interrupt when T2VAL reaches T2WUFC. */

/* T2IEN[WUFB] - T2WUFB interrupt enable */
#define T2IEN_WUFB_BBA                 (*(volatile unsigned long *) 0x4204A504)
#define T2IEN_WUFB_MSK                 (0x1   << 1  )
#define T2IEN_WUFB                     (0x1   << 1  )
#define T2IEN_WUFB_DIS                 (0x0   << 1  ) /* DIS. Disable T2WUFB interrupt. */
#define T2IEN_WUFB_EN                  (0x1   << 1  ) /* EN. Generate an interrupt when T2VAL reaches T2WUFB. */

/* T2IEN[WUFA] - T2WUFA interrupt enable */
#define T2IEN_WUFA_BBA                 (*(volatile unsigned long *) 0x4204A500)
#define T2IEN_WUFA_MSK                 (0x1   << 0  )
#define T2IEN_WUFA                     (0x1   << 0  )
#define T2IEN_WUFA_DIS                 (0x0   << 0  ) /* DIS. Disable T2WUFA interrupt. */
#define T2IEN_WUFA_EN                  (0x1   << 0  ) /* EN. Generate an interrupt when T2VAL reaches T2WUFA. */

/* Reset Value for T2STA*/
#define T2STA_RVAL                     0x0

/* T2STA[CON] - Indicates when a change in the enable bit is synchronized to the 32 kHz clock domain (Done automatically) */
#define T2STA_CON_BBA                  (*(volatile unsigned long *) 0x4204A5A0)
#define T2STA_CON_MSK                  (0x1   << 8  )
#define T2STA_CON                      (0x1   << 8  )
#define T2STA_CON_CLR                  (0x0   << 8  ) /* CLR. It returns low when the change in the Enable bit has been synchronised to the 32 kHz clock domain. */
#define T2STA_CON_SET                  (0x1   << 8  ) /* SET. This bit is set high when the Enable bit (bit 5) in the Control register is set or cleared and it is not synchronised to tthe 32 kHz clock. */

/* T2STA[FREEZE] - Status of T2VAL freeze */
#define T2STA_FREEZE_BBA               (*(volatile unsigned long *) 0x4204A59C)
#define T2STA_FREEZE_MSK               (0x1   << 7  )
#define T2STA_FREEZE                   (0x1   << 7  )
#define T2STA_FREEZE_CLR               (0x0   << 7  ) /* CLR.  Reset low when T2VAL1 is read, indicating T2VAL is unfrozen. */
#define T2STA_FREEZE_SET               (0x1   << 7  ) /* SET. Set high when the T2VAL0 is read, indicating T2VAL is frozen. */

/* T2STA[ROLL] - Interrupt status bit for instances when counter rolls over. Only occurs in free running mode. */
#define T2STA_ROLL_BBA                 (*(volatile unsigned long *) 0x4204A590)
#define T2STA_ROLL_MSK                 (0x1   << 4  )
#define T2STA_ROLL                     (0x1   << 4  )
#define T2STA_ROLL_CLR                 (0x0   << 4  ) /* CLR. Indicate that the timer has not rolled over. */
#define T2STA_ROLL_SET                 (0x1   << 4  ) /* SET. Set high when enabled in the interrupt enable register and the T2VALS counter register is equal to all 1s */

/* T2STA[WUFD] - T2WUFD interrupt flag */
#define T2STA_WUFD_BBA                 (*(volatile unsigned long *) 0x4204A58C)
#define T2STA_WUFD_MSK                 (0x1   << 3  )
#define T2STA_WUFD                     (0x1   << 3  )
#define T2STA_WUFD_CLR                 (0x0   << 3  ) /* CLR. Cleared after a write to the corresponding bit in T2CLRI. */
#define T2STA_WUFD_SET                 (0x1   << 3  ) /* SET. Indicates that a comparator interrupt has occurred. */

/* T2STA[WUFC] - T2WUFC interrupt flag */
#define T2STA_WUFC_BBA                 (*(volatile unsigned long *) 0x4204A588)
#define T2STA_WUFC_MSK                 (0x1   << 2  )
#define T2STA_WUFC                     (0x1   << 2  )
#define T2STA_WUFC_CLR                 (0x0   << 2  ) /* CLR. Cleared after a write to the corresponding bit in T2CLRI. */
#define T2STA_WUFC_SET                 (0x1   << 2  ) /* SET. Indicates that a comparator interrupt has occurred. */

/* T2STA[WUFB] - T2WUFB interrupt flag */
#define T2STA_WUFB_BBA                 (*(volatile unsigned long *) 0x4204A584)
#define T2STA_WUFB_MSK                 (0x1   << 1  )
#define T2STA_WUFB                     (0x1   << 1  )
#define T2STA_WUFB_CLR                 (0x0   << 1  ) /* CLR. Cleared after a write to the corresponding bit in T2CLRI. */
#define T2STA_WUFB_SET                 (0x1   << 1  ) /* SET. Indicates that a comparator interrupt has occurred. */

/* T2STA[WUFA] - T2WUFA interrupt flag */
#define T2STA_WUFA_BBA                 (*(volatile unsigned long *) 0x4204A580)
#define T2STA_WUFA_MSK                 (0x1   << 0  )
#define T2STA_WUFA                     (0x1   << 0  )
#define T2STA_WUFA_CLR                 (0x0   << 0  ) /* CLR. Cleared after a write to the corresponding bit in T2CLRI. */
#define T2STA_WUFA_SET                 (0x1   << 0  ) /* SET. Indicates that a comparator interrupt has occurred. */

/* Reset Value for T2CLRI*/
#define T2CLRI_RVAL                    0x0

/* T2CLRI[ROLL] - Clear interrupt on Rollover.  Only occurs in free running mode. */
#define T2CLRI_ROLL_BBA                (*(volatile unsigned long *) 0x4204A610)
#define T2CLRI_ROLL_MSK                (0x1   << 4  )
#define T2CLRI_ROLL                    (0x1   << 4  )
#define T2CLRI_ROLL_CLR                (0x1   << 4  ) /* CLR. Interrupt clear bit for when counter rolls over. */

/* T2CLRI[WUFD] - T2WUFD interrupt flag. Cleared automatically after synchronization. */
#define T2CLRI_WUFD_BBA                (*(volatile unsigned long *) 0x4204A60C)
#define T2CLRI_WUFD_MSK                (0x1   << 3  )
#define T2CLRI_WUFD                    (0x1   << 3  )
#define T2CLRI_WUFD_CLR                (0x1   << 3  ) /* CLR. Clear the T2WUFD interrupt flag. */

/* T2CLRI[WUFC] - T2WUFC interrupt flag. Cleared automatically after synchronization. */
#define T2CLRI_WUFC_BBA                (*(volatile unsigned long *) 0x4204A608)
#define T2CLRI_WUFC_MSK                (0x1   << 2  )
#define T2CLRI_WUFC                    (0x1   << 2  )
#define T2CLRI_WUFC_CLR                (0x1   << 2  ) /* CLR. Clear the T2WUFC interrupt flag. */

/* T2CLRI[WUFB] - T2WUFB interrupt flag. Cleared automatically after synchronization. */
#define T2CLRI_WUFB_BBA                (*(volatile unsigned long *) 0x4204A604)
#define T2CLRI_WUFB_MSK                (0x1   << 1  )
#define T2CLRI_WUFB                    (0x1   << 1  )
#define T2CLRI_WUFB_CLR                (0x1   << 1  ) /* CLR. Clear the T2WUFB interrupt flag. */

