contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* T2CLRI[WUFA] - T2WUFA interrupt flag. Cleared automatically after synchronization. */
#define T2CLRI_WUFA_BBA                (*(volatile unsigned long *) 0x4204A600)
#define T2CLRI_WUFA_MSK                (0x1   << 0  )
#define T2CLRI_WUFA                    (0x1   << 0  )
#define T2CLRI_WUFA_CLR                (0x1   << 0  ) /* CLR. Clear the T2WUFA interrupt flag. */

/* Reset Value for T2WUFA0*/
#define T2WUFA0_RVAL                   0x1900

/* T2WUFA0[VALUE] - Lower 16 bits of Compare Register A */
#define T2WUFA0_VALUE_MSK              (0xFFFF << 0  )

/* Reset Value for T2WUFA1*/
#define T2WUFA1_RVAL                   0x0

/* T2WUFA1[VALUE] - Upper 16 bits of Compare Register A */
#define T2WUFA1_VALUE_MSK              (0xFFFF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        WDT                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Watchdog Timer (pADI_WDT)
  */

#if (__NO_MMR_STRUCTS__==0)
typedef struct {                            /*!< pADI_WDT Structure                     */
  __IO uint16_t  T3LD;                      /*!< 16-bit Load Value                     */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  T3VAL;                     /*!< 16-bit Timer Value                    */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  T3CON;                     /*!< Control Register                      */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  T3CLRI;                    /*!< Clear Interrupt Register              */
  __I  uint16_t  RESERVED3[5];
  __IO uint16_t  T3STA;                     /*!< Status Register                       */
} ADI_WDT_TypeDef;
#else // (__NO_MMR_STRUCTS__==0)
#define          T3LD                                       (*(volatile unsigned short int *) 0x40002580)
#define          T3VAL                                      (*(volatile unsigned short int *) 0x40002584)
#define          T3CON                                      (*(volatile unsigned short int *) 0x40002588)
#define          T3CLRI                                     (*(volatile unsigned short int *) 0x4000258C)
#define          T3STA                                      (*(volatile unsigned short int *) 0x40002598)
#endif // (__NO_MMR_STRUCTS__==0)

/* Reset Value for T3LD*/
#define T3LD_RVAL                      0x1000

/* T3LD[VALUE] - Load value. */
#define T3LD_VALUE_MSK                 (0xFFFF << 0  )

/* Reset Value for T3VAL*/
#define T3VAL_RVAL                     0x1000

/* T3VAL[VALUE] - Current counter value. */
#define T3VAL_VALUE_MSK                (0xFFFF << 0  )

/* Reset Value for T3CON*/
#define T3CON_RVAL                     0xE9

/* T3CON[MOD] - Timer Mode */
#define T3CON_MOD_BBA                  (*(volatile unsigned long *) 0x4204B118)
#define T3CON_MOD_MSK                  (0x1   << 6  )
#define T3CON_MOD                      (0x1   << 6  )
#define T3CON_MOD_Reserved             (0x0   << 6  ) /* Reserved                 */
#define T3CON_MOD_PERIODIC             (0x1   << 6  ) /* PERIODIC: Operate in periodic mode. */

/* T3CON[ENABLE] - Timer enable bit. */
#define T3CON_ENABLE_BBA               (*(volatile unsigned long *) 0x4204B114)
#define T3CON_ENABLE_MSK               (0x1   << 5  )
#define T3CON_ENABLE                   (0x1   << 5  )
#define T3CON_ENABLE_DIS               (0x0   << 5  ) /* DIS. Disable the timer. Clearing this bit resets the timer, including the T0VAL register. */
#define T3CON_ENABLE_EN                (0x1   << 5  ) /* EN. Enable the timer.  The timer starts counting from its initial value. */

/* T3CON[PRE] - Prescaler. */
#define T3CON_PRE_MSK                  (0x3   << 2  )
#define T3CON_PRE_DIV1                 (0x0   << 2  ) /* DIV1. Source clock/1.    */
#define T3CON_PRE_DIV16                (0x1   << 2  ) /* DIV16. Source clock/16.  */
#define T3CON_PRE_DIV256               (0x2   << 2  ) /* DIV256. Source clock/256. */
#define T3CON_PRE_DIV4096              (0x3   << 2  ) /* DIV4096. Source clock/4096. */

/* T3CON[IRQ] - Timer interrupt. */
#define T3CON_IRQ_BBA                  (*(volatile unsigned long *) 0x4204B104)
#define T3CON_IRQ_MSK                  (0x1   << 1  )
#define T3CON_IRQ                      (0x1   << 1  )
#define T3CON_IRQ_DIS                  (0x0   << 1  ) /* DIS. Generate a reset on a timeout. */
#define T3CON_IRQ_EN                   (0x1   << 1  ) /* EN. Generate an interrupt when the timer times out. This feature is available in active mode only and can be used to debug the watchdog timeout events. */

/* T3CON[PD] - Stop count in hibernate mode. */
#define T3CON_PD_BBA                   (*(volatile unsigned long *) 0x4204B100)
#define T3CON_PD_MSK                   (0x1   << 0  )
#define T3CON_PD                       (0x1   << 0  )
#define T3CON_PD_DIS                   (0x0   << 0  ) /* DIS. The timer continues to count when in hibernate mode. */
#define T3CON_PD_EN                    (0x1   << 0  ) /* EN. The timer stops counting when in hibernate mode. */

/* Reset Value for T3CLRI*/
#define T3CLRI_RVAL                    0x0

/* T3CLRI[VALUE] - Clear watchdog. */
#define T3CLRI_VALUE_MSK               (0xFFFF << 0  )

/* Reset Value for T3STA*/
#define T3STA_RVAL                     0x20

/* T3STA[LOCK] - Lock status bit. */
#define T3STA_LOCK_BBA                 (*(volatile unsigned long *) 0x4204B310)
#define T3STA_LOCK_MSK                 (0x1   << 4  )
#define T3STA_LOCK                     (0x1   << 4  )
#define T3STA_LOCK_CLR                 (0x0   << 4  ) /* CLR. Cleared after any reset and until user code sets T3CON[5]. */
#define T3STA_LOCK_SET                 (0x1   << 4  ) /* SET. Set automatically in hardware when user code sets T3CON[5]. */

/* T3STA[CON] - T3CON write sync in progress. */
#define T3STA_CON_BBA                  (*(volatile unsigned long *) 0x4204B30C)
#define T3STA_CON_MSK                  (0x1   << 3  )
#define T3STA_CON                      (0x1   << 3  )
#define T3STA_CON_CLR                  (0x0   << 3  ) /* CLR. Timer ready to receive commands to T3CON. The previous change of T3CON has been synchronized in the timer clock domain. */
#define T3STA_CON_SET                  (0x1   << 3  ) /* SET. Timer not ready to receive commands to T3CON. Previous change of the T3CON value has not been synchronized in the timer clock domain. */

/* T3STA[LD] - T3LD write sync in progress. */
#define T3STA_LD_BBA                   (*(volatile unsigned long *) 0x4204B308)
#define T3STA_LD_MSK                   (0x1   << 2  )
#define T3STA_LD                       (0x1   << 2  )
#define T3STA_LD_CLR                   (0x0   << 2  ) /* CLR. The previous change of T3LD has been synchronized in the timer clock domain. */
#define T3STA_LD_SET                   (0x1   << 2  ) /* SET. Previous change of the T3LD value has not been synchronized in the timer clock domain. */

/* T3STA[CLRI] - T3CLRI write sync in progress. */
#define T3STA_CLRI_BBA                 (*(volatile unsigned long *) 0x4204B304)
#define T3STA_CLRI_MSK                 (0x1   << 1  )
#define T3STA_CLRI                     (0x1   << 1  )
#define T3STA_CLRI_CLR                 (0x0   << 1  ) /* CLR. Cleared when the interrupt is cleared in the timer clock domain. */
#define T3STA_CLRI_SET                 (0x1   << 1  ) /* SET. Set automatically when the T3CLRI value is being updated in the timer clock domain, indicating that the timers configuration is not yet valid. */

