contiki-os/contiki/cpu/arm/aducrf101/Common/ADuCRF101.h
/* T3STA[IRQ] - Interrupt pending. */
#define T3STA_IRQ_BBA                  (*(volatile unsigned long *) 0x4204B300)
#define T3STA_IRQ_MSK                  (0x1   << 0  )
#define T3STA_IRQ                      (0x1   << 0  )
#define T3STA_IRQ_CLR                  (0x0   << 0  ) /* CLR. No timeout event has occurred. */
#define T3STA_IRQ_SET                  (0x1   << 0  ) /* SET. A timeout event has occurred. */


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif
/********************************************
** Miscellaneous Definitions               **
*********************************************/

//iEiNr in EiCfg()
#define EXTINT0   0x0
#define EXTINT1   0x1
#define EXTINT2   0x2
#define EXTINT3   0x3
#define EXTINT4   0x4
#define EXTINT5   0x5
#define EXTINT6   0x6
#define EXTINT7   0x7
#define EXTINT8   0x8

//iEnable in EiCfg()
#define INT_DIS   0x0
#define INT_EN    0x1

//iMode in EiCfg()
#define INT_RISE  0x0
#define INT_FALL  0x1
#define INT_EDGES 0x2
#define INT_HIGH  0x3
#define INT_LOW   0x4

//Bit values.
#define BIT0      1
#define BIT1      2
#define BIT2      4
#define BIT3      8
#define BIT4      0x10
#define BIT5      0x20
#define BIT6      0x40
#define BIT7      0x80


/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define ADI_ADC0_ADDR                            0x40050000UL
#define ADI_CLKCTL_ADDR                          0x40002000UL
#define ADI_DMA_ADDR                             0x40010000UL
#define ADI_FEE_ADDR                             0x40002800UL
#define ADI_GP0_ADDR                             0x40006000UL
#define ADI_GP1_ADDR                             0x40006030UL
#define ADI_GP2_ADDR                             0x40006060UL
#define ADI_GP3_ADDR                             0x40006090UL
#define ADI_GP4_ADDR                             0x400060C0UL
#define ADI_GPIOCMN_ADDR                         0x400060F0UL
#define ADI_MISC_ADDR                            0x40008820UL
#define ADI_I2C_ADDR                             0x40003000UL
#define ADI_INTERRUPT_ADDR                       0x40002420UL
#define ADI_IDENT_ADDR                           0x40002020UL
#define ADI_NVIC_ADDR                            0xE000E000UL
#define ADI_PWRCTL_ADDR                          0x40002400UL
#define ADI_PWM_ADDR                             0x40001000UL
#define ADI_RESET_ADDR                           0x40002440UL
#define ADI_SPI0_ADDR                            0x40004000UL
#define ADI_SPI1_ADDR                            0x40004400UL
#define ADI_TM0_ADDR                             0x40000000UL
#define ADI_TM1_ADDR                             0x40000400UL
#define ADI_UART_ADDR                            0x40005000UL
#define ADI_WUT_ADDR                             0x40002500UL
#define ADI_WDT_ADDR                             0x40002580UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define pADI_ADC0                     ((ADI_ADC_TypeDef                *)ADI_ADC0_ADDR)
#define pADI_CLKCTL                   ((ADI_CLKCTL_TypeDef             *)ADI_CLKCTL_ADDR)
#define pADI_DMA                      ((ADI_DMA_TypeDef                *)ADI_DMA_ADDR)
#define pADI_FEE                      ((ADI_FEE_TypeDef                *)ADI_FEE_ADDR)
#define pADI_GP0                      ((ADI_GPIO_TypeDef               *)ADI_GP0_ADDR)
#define pADI_GP1                      ((ADI_GPIO_TypeDef               *)ADI_GP1_ADDR)
#define pADI_GP2                      ((ADI_GPIO_TypeDef               *)ADI_GP2_ADDR)
#define pADI_GP3                      ((ADI_GPIO_TypeDef               *)ADI_GP3_ADDR)
#define pADI_GP4                      ((ADI_GPIO_TypeDef               *)ADI_GP4_ADDR)
#define pADI_GPIOCMN                  ((ADI_GPIOCMN_TypeDef            *)ADI_GPIOCMN_ADDR)
#define pADI_MISC                     ((ADI_MISC_TypeDef               *)ADI_MISC_ADDR)
#define pADI_I2C                      ((ADI_I2C_TypeDef                *)ADI_I2C_ADDR)
#define pADI_INTERRUPT                ((ADI_INTERRUPT_TypeDef          *)ADI_INTERRUPT_ADDR)
#define pADI_PWRCTL                   ((ADI_PWRCTL_TypeDef             *)ADI_PWRCTL_ADDR)
#define pADI_PWM                      ((ADI_PWM_TypeDef                *)ADI_PWM_ADDR)
#define pADI_RESET                    ((ADI_RESET_TypeDef              *)ADI_RESET_ADDR)
#define pADI_SPI0                     ((ADI_SPI_TypeDef                *)ADI_SPI0_ADDR)
#define pADI_SPI1                     ((ADI_SPI_TypeDef                *)ADI_SPI1_ADDR)
#define pADI_TM0                      ((ADI_TIMER_TypeDef              *)ADI_TM0_ADDR)
#define pADI_TM1                      ((ADI_TIMER_TypeDef              *)ADI_TM1_ADDR)
#define pADI_UART                     ((ADI_UART_TypeDef               *)ADI_UART_ADDR)
#define pADI_WUT                      ((ADI_WUT_TypeDef                *)ADI_WUT_ADDR)
#define pADI_WDT                      ((ADI_WDT_TypeDef                *)ADI_WDT_ADDR)

/** @} */ /* End of group Device_Peripheral_Registers *//** @} */ /* End of group ADUCRF101 */
/** @} */ /* End of group CMSIS */

#ifdef __cplusplus
}
#endif


#endif  // __ADUCRF101_H__

